[
    {
        "meta": {
            "idx": 0,
            "title": "Let’s talk about ABA therapy. ABA posts outside this thread will be removed.",
            "link": "https://www.reddit.com/r/autism/comments/ub3skp/lets_talk_about_aba_therapy_aba_posts_outside/",
            "votes": 1939,
            "comments_count": 4526,
            "created": "2022-04-24T20:40:56.673000+0000"
        },
        "body": "ABA (Applied Behavior Analysis) therapy is one of our most commonly discussed topics here, and one of the most emotionally charged. In an effort to declutter the sub and reduce rule-breaking posts, this will serve as the master thread for ABA discussion.\n  \n    This is the place for asking questions, sharing personal experiences, linking to blog posts or scientific articles, and posting opinions. If you’re a parent seeking alternatives to ABA, please give us a little information about your child. Their age and what goals you have for them are usually enough.\n  \n    Please keep it civil. Abusive or harassing comments will be removed.\n  \nWhat is ABA? From Medical News Today:\n  \n\n    ABA therapy attempts to modify and encourage certain behaviors, particularly in autistic children. It is not a cure for ASD, but it can help individuals improve and develop an array of skills.\n  \n\n\n    This form of therapy is rooted in behaviorist theories. This assumes that reinforcement can increase or decrease the chance of a behavior happening when a similar set of circumstances occurs again in the future.\n  \n\n    From our wiki: How can I tell whether a treatment is reputable? Are there warning signs of a bad or harmful therapy?\n\n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 1,
            "title": "Media Monday! Let's talk",
            "link": "https://www.reddit.com/r/autism/comments/1d1lnpr/media_monday_lets_talk/",
            "votes": 7,
            "comments_count": 6,
            "created": "2024-05-27T07:01:09.573000+0000"
        },
        "body": "This post is for any user who wants to share any type of media. Be it games, music, movies and what not. Let's meet some friends.\n  \n    Are you grinding on Fortnight or Red Dead Redemption 2 ?\n  \n    Have you been binge watching Good Girls on Netflix ?\n  \n    Are you rewatching the Remastered version of Akira ?\n  \n    Use this thread to chat up the community. If this seems to be popular we can keep it up. Enjoy folks!\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 2,
            "title": "What is a smell that isn't considered \"good\" that you love?",
            "link": "https://www.reddit.com/r/autism/comments/1d3vyi2/what_is_a_smell_that_isnt_considered_good_that/",
            "votes": 85,
            "comments_count": 151,
            "created": "2024-05-30T04:46:11.731000+0000"
        },
        "body": "Doesn't have to be a bad smell, but not the normal smells that are put in candles and such. Mine is Play-Doh. I've always loved it, and would play with it primarily to smell it.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 3,
            "title": "What is your food ick?",
            "link": "https://www.reddit.com/r/autism/comments/1d3oxcs/what_is_your_food_ick/",
            "votes": 220,
            "comments_count": 346,
            "created": "2024-05-29T22:44:11.396000+0000"
        },
        "body": "Basically, what is a food that you won't eat simply because no?\n  \n    For me it's cheese, I don't get it's hype.\n  \n    (Edit: just a clarifier, the things listed below are things I WILL eat containing cheese / cheese flavoring) Well - kraft Mac and cheese -> yup\n  \n    Pizza (with a Lil cheese) -> yup\n  \n    Cheese itz, Ritz cheese crackers, or any cheese flavored snack -> YUP (definitely yes to cheese itz)\n  \n    But by it's self, hell to the no... I remember I used to eat those baby bell Swiss cheeses when I was a toddler, but if cheese goes on my tongue now, I gag - honestly!\n  \n    (I guess I can specifically eat cheeseburgers from mc Donald's, and the cheeseburgers at my school if I drown it in ketchup..)\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 4,
            "title": "Hello everyone. Just checking on you ",
            "link": "https://www.reddit.com/r/autism/comments/1d3rqan/hello_everyone_just_checking_on_you/",
            "votes": 91,
            "comments_count": 113,
            "created": "2024-05-30T00:59:46.932000+0000"
        },
        "body": "How are you guys?\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 5,
            "title": "What's your favorite comfort song? (if you have one)",
            "link": "https://www.reddit.com/r/autism/comments/1d3w2wb/whats_your_favorite_comfort_song_if_you_have_one/",
            "votes": 36,
            "comments_count": 31,
            "created": "2024-05-30T04:54:00.997000+0000"
        },
        "body": "I'm curious for those that like to use songs as comfort (like me) what songs/genres do you frequent? I like playing calming songs whenever im upset or sometimes even just when i need a good cry. My go-to song to calm down when im upset is 'Rises The Moon' by liana flores because its very relaxing and helps me control my feelings when im overwhelmed.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 6,
            "title": "I feel lonely as an autistic person",
            "link": "https://www.reddit.com/r/autism/comments/1d3vrl9/i_feel_lonely_as_an_autistic_person/",
            "votes": 34,
            "comments_count": 9,
            "created": "2024-05-30T04:34:17.923000+0000"
        },
        "body": "I am a gay person and I really don't like being near people. I can't do intimacy, and I am uncomfortable even looking most people in the eye. I don't want to be near people for sensory and safety reasons. But I yearn to be with someone. I sometimes have dreams where I connect with a man and it makes me feel like I'm missing out\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 7,
            "title": "Does anyone else hate brushing their teeth?",
            "link": "https://www.reddit.com/r/autism/comments/1d3bmjr/does_anyone_else_hate_brushing_their_teeth/",
            "votes": 348,
            "comments_count": 168,
            "created": "2024-05-29T13:00:32.118000+0000"
        },
        "body": "I have always struggled with brushing my teeth. I continuously go through months where I get it done at least once a day to months where I just can't. I hate every bit of it. The feel. The taste of toothpaste. The way the water toothpaste slurry will get on my clothes if I'm not careful or GOD FORBID it drips down my hand to my elbow!!!\n  \n    I use an electric toothbrush in an attempt to get more done with less brushing time but I wish I could just never do it.\n  \n    I hate that our teeth even get dirty. They are BONES!! You don't see the rest of my bones whining /j I also hate flossing bc I always bleed lol\n  \n    I wish I could brush every tooth at once for like a moment and be done!! Does anyone feel this?\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 8,
            "title": "How to respond to \"Are you okay?\"",
            "link": "https://www.reddit.com/r/autism/comments/1d3szyv/how_to_respond_to_are_you_okay/",
            "votes": 29,
            "comments_count": 13,
            "created": "2024-05-30T02:03:53.443000+0000"
        },
        "body": "My (22F) mom has been in the hospital for a few months, it's really hard. My friend (23M) asked if I'm okay, I said no and he asked if he could do anything to help. I want support and idk how to ask for that. We only really communicate via text\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 9,
            "title": "What's the point of living with autism?",
            "link": "https://www.reddit.com/r/autism/comments/1d3j9du/whats_the_point_of_living_with_autism/",
            "votes": 96,
            "comments_count": 161,
            "created": "2024-05-29T18:30:41.067000+0000"
        },
        "body": "It can't be cured, so we'll die with this condition. I have anhedonia, I'm also aromantic and I feel empty on the inside. What is the magic pill for autism to feel alive like a normal human being?\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 10,
            "title": "What’s your weirdest stim? ",
            "link": "https://www.reddit.com/r/autism/comments/1d3pe1y/whats_your_weirdest_stim/",
            "votes": 41,
            "comments_count": 51,
            "created": "2024-05-29T23:05:15.504000+0000"
        },
        "body": "I have this pretty unusual stim. I lay down on my side or on my belly and then I quickly contract and relax my butt muscles repeatedly. I didn’t know it was considered to be a weird thing until my dad once caught me doing it during my early teens. I was laying on his bed, playing a game on my phone. He entered the room and immediately acted like he stumbled upon something shameful. I couldn’t wrap my mind around it at first. Later it dawned on me that the poor guy probably thought I was dry humping his bed .-.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 11,
            "title": "How do we feel about airports?",
            "link": "https://www.reddit.com/r/autism/comments/1d3x3gf/how_do_we_feel_about_airports/",
            "votes": 9,
            "comments_count": 16,
            "created": "2024-05-30T06:00:35.516000+0000"
        },
        "body": "I'm not by any means afraid of flying.  If I'm on an airplane, I have full faith that the pilot is competent and can safely take me from point A to point B.  The airport, however, is sensory hell for me.  It's like nothing and everything is happening all at once.  There's too many people, tired kids are melting down, tired adults are yelling at each other, every smell coming out of the food court is smacking you in the face, the announcements are too loud, it is a NIGHTMARE.  I already have crippling anxiety and it always seems to be exacerbated in airports.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 12,
            "title": "What is your favorite and least favorite mode of transportation?",
            "link": "https://www.reddit.com/r/autism/comments/1d3yvn8/what_is_your_favorite_and_least_favorite_mode_of/",
            "votes": 5,
            "comments_count": 6,
            "created": "2024-05-30T08:09:03.628000+0000"
        },
        "body": "I've only been on a train so many times but it's so relaxing imo. You get your own space, and it's not as scary and overwhelming as planes are.\n  \n    I don't know how other people with autism feel, but cars are so overwhelming sometimes. I've gotten meltdowns + panic attacks just from being in lots of traffic and dealing with bad drivers, which is why I don't drive anymore. Even when driving with other people it's stressful.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 13,
            "title": "I just realized that “fest” is short for “festival”…",
            "link": "https://www.reddit.com/r/autism/comments/1d3wabe/i_just_realized_that_fest_is_short_for_festival/",
            "votes": 8,
            "comments_count": 6,
            "created": "2024-05-30T05:06:45.994000+0000"
        },
        "body": "I’m 27 and just realized this.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 14,
            "title": "Does anyone else get really overwhelmed by text messages?",
            "link": "https://www.reddit.com/r/autism/comments/1d3ok4q/does_anyone_else_get_really_overwhelmed_by_text/",
            "votes": 27,
            "comments_count": 13,
            "created": "2024-05-29T22:27:36.176000+0000"
        },
        "body": "Usually I only text three people, and it's just texting and then responding when we can. Both people texting at the same time like a conversation goes too quick and I get too overstimulated, but that's a different story.\n  \n    When I text these three people I usually take a while to respond just because I can't think of anything to say that's interesting or will keep the conversation going although I've been texting these three people for months. Sometimes it gets to the point where I don't reply to messages until a full 24h or more later and it just makes me frustrated with myself.\n  \n    Too many text messages at the same time just overwhelms me as I have too many messages to think about and what I need to reply with. From my usual texting three people it's gone up to five in a single day and I currently haven't responded to three people.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 15,
            "title": "What’s y’all’s weirdest comfort food?",
            "link": "https://www.reddit.com/r/autism/comments/1d37g0n/whats_yalls_weirdest_comfort_food/",
            "votes": 301,
            "comments_count": 433,
            "created": "2024-05-29T08:44:54.968000+0000"
        },
        "body": "Mine is sour cream sandwiches. Just toasted bread and sour cream.\n  \n    Either that or just straight sour cream.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 16,
            "title": "What does yelling do to you?",
            "link": "https://www.reddit.com/r/autism/comments/1d3d4ve/what_does_yelling_do_to_you/",
            "votes": 109,
            "comments_count": 134,
            "created": "2024-05-29T14:09:41.751000+0000"
        },
        "body": "I have to cup my hands over my ears. It bothers me and it's such a STUPID way to communicate\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 17,
            "title": "everyone always thinks im upset or trying to argue even when im not",
            "link": "https://www.reddit.com/r/autism/comments/1d3wpi4/everyone_always_thinks_im_upset_or_trying_to/",
            "votes": 6,
            "comments_count": 5,
            "created": "2024-05-30T05:34:19.500000+0000"
        },
        "body": "does anyone else experience this? im starting to feel really hopeless about it. its pushing people away and i dont even realize it because i think im just talking. i dont know if i have a condescending tone or if im just saying things that i dont realize are rude. most people think im playing dumb when i say im not trying to be mean. i dont know what else to do\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 18,
            "title": "How to cope with school? ",
            "link": "https://www.reddit.com/r/autism/comments/1d3y9dx/how_to_cope_with_school/",
            "votes": 4,
            "comments_count": 2,
            "created": "2024-05-30T07:22:39.229000+0000"
        },
        "body": "Hello! I was recently diagnosed with adhd and autism(15 f) and honestly I am quite conflicted. I live in India where Adhd isn't even recognized as a disability and autism accommodations are usually reserved for higher support needs autism. In fact I am pretty sure that even if I ask for accommodations at school I will be refused or be asked to shift to Nios which is unusually reserved for higher support autistic kids and kids with severe behavior issues. So yeah, also of track but is it normal for therapist to ask you to stop fidgeting? I fidget almost all the time and my therapist always gives me breathing exercises to stop them but idk since fidgeting is very comforting but it might not be as socially accepted. Honestly the only advice I have gotten from  my therapist is to just go to school as it is the last year but it's not like I don't try. I try, it's just exhausting and it makes me just break down in tears half the time. I just fear I will break down in school someday. Sorry for any grammatical errors and thank you for reading my ramble!\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 19,
            "title": "My gf told me she didn’t « really know me »",
            "link": "https://www.reddit.com/r/autism/comments/1d3zi6f/my_gf_told_me_she_didnt_really_know_me/",
            "votes": 3,
            "comments_count": 1,
            "created": "2024-05-30T08:56:08.004000+0000"
        },
        "body": "(Apologizes for incorrect grammar or any other errors, I’m french)\n  \n    Okay so, my gf (18F) and I (18NB) been together for almost a year now and I’ve only talked about my potential autism a week ago. It’s been a couple of years since I think I might be autistic but i was always afraid to talk about it to people. I didn’t want anyone to think of me as a « pick-me » since I didn’t have a real diagnosis. I finally spoke to my girlfriend about this and she got upset. She told me she didn’t really know me well. In the contrary, she told me everything about her pretty soon, she said she felt silly to have done this. I asked her, it’s not that she regrets anything but more of a « I feel stupid ». We talked about this before going to bed but she had class the morning after so we just agreed to continue this convo another time.\n  \n    I’ve sent an email to my CRA (I’m French) I just need to send some documents, the waiting list range is from 17 to 24 months 😅\n  \n    My question is, how can I talk to my gf about my potential autism also while having major impostor syndrome and fear of appearing as a pick-me ?\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 20,
            "title": "Changing \"self talk\"",
            "link": "https://www.reddit.com/r/autism/comments/1d3zb4s/changing_self_talk/",
            "votes": 3,
            "comments_count": 2,
            "created": "2024-05-30T08:41:21.940000+0000"
        },
        "body": "I, male 51, autistic (gifted / adhd) found out that I have a lot of negative 'self talk' going on.\n  \n    The most obvious is the \"I can't [fill in the blanks]'. These thoughts (or maybe 'this voice' is a better way to say it) is holding me back quite often.\n  \n    A couple of months (maybe a year or so) ago I found out that if I consciously override this, just be adding \"yet\" to the equation like \"I can't ____ YET\", and keep at it, it is changing my perception and if done often enough, it eased / eases my \"self talk\".\n  \n    Since it helps me and after sharing it with my kids and some of my peers, who also happen to be autistic, it helped them too.\n  \n    Maybe I'm just stating something obvious, but I thought it was worth the time and energy to share it here.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 21,
            "title": "Are people with autism more sensitive to porn addiction?",
            "link": "https://www.reddit.com/r/autism/comments/1d3xuw1/are_people_with_autism_more_sensitive_to_porn/",
            "votes": 4,
            "comments_count": 5,
            "created": "2024-05-30T06:53:47.857000+0000"
        },
        "body": "Is it true that autistic people are more sensitive to porn addiction? As someone with autism who is doing everything to quit this, I want to know if fellow people with autism also have/had this problem. It is so bad for you, I wish I never started watching this crap. My coach told me we are indeed more sensitive to it because our brains are more likely to ‘crave dopamine’. Is this true?\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 22,
            "title": "Is being a delivery driver a good job for someone with autism? ",
            "link": "https://www.reddit.com/r/autism/comments/1d3sqoy/is_being_a_delivery_driver_a_good_job_for_someone/",
            "votes": 9,
            "comments_count": 13,
            "created": "2024-05-30T01:50:39.765000+0000"
        },
        "body": "Hey all, i’m currently unemployed. Looking around at jobs.  Would being a delivery driver for even just a fast food place be a good job?  I’ve been very burnt out so I’m looking for something kind of lowkey.\n  \n    I did get hired at a retail mall store but I’m already dreading my first day which is supposed to be tomorrow.  I don’t even know what to do anymore.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 23,
            "title": "Teacher not caring about my 504",
            "link": "https://www.reddit.com/r/autism/comments/1d3uw6v/teacher_not_caring_about_my_504/",
            "votes": 6,
            "comments_count": 3,
            "created": "2024-05-30T03:44:23.231000+0000"
        },
        "body": "(Im not sure if this is the right sub im sorry😭) Anyways my school has a 504 plan for me and I have a few accommodations, one of them being that I can sit anywhere in the classroom. One day I asked my teacher if I could switch to my friends table because the people at mine give me anxiety (teacher knows this) and I would be more productive if i sat next to people I knew. She replied along the lines of  \"Are you sure this is on your 504\" \"It seems kind of odd\" \"Are you sure you're not doing this because you wanna talk with your friends?\" And she told me it's \"not fair\" to the other kids who want to sit w/ their friends. I respectfully reminded her that it's on my 504 plan and she said still said no. Isn't this against the law? or at least county rules?😭😭\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 24,
            "title": "My girlfriend is autistic and I got her some things and I have a few questions ",
            "link": "https://www.reddit.com/r/autism/comments/1d3r2oe/my_girlfriend_is_autistic_and_i_got_her_some/",
            "votes": 11,
            "comments_count": 11,
            "created": "2024-05-30T00:26:30.323000+0000"
        },
        "body": "I havent seen her in forever and we've been long distance for a while, and she loves plushes and stuff and I got her one that's a dog, and I also got her a hoodie, and I don't want to spoil the surprise. I've heard of women liking not body odor, but a man's scent and I'm not sure, with her being autistic, if I should give it to her with my scent on it, only a day or so worth, nothing disgusting, or wash it and the plushie so she doesn't hate the smell\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 25,
            "title": "Special interest series ending: can’t emotionally cope. ",
            "link": "https://www.reddit.com/r/autism/comments/1d3y99c/special_interest_series_ending_cant_emotionally/",
            "votes": 3,
            "comments_count": 1,
            "created": "2024-05-30T07:22:21.370000+0000"
        },
        "body": "My Hero Academia has been my top special interest since early 2018. I’ve interacted with this media in some way every single day since. My bedroom is decorated with mha things. I’m collecting the manga in English and Japanese. I love the characters will so much passion (idk how to even express it) I’ve found myself in so many of these characters and love this series with my whole being…\n  \n    And the next chapter of the manga is going to be the last one and I’m not taking it well.\n  \n    I can’t even think about the show or characters without crying, sobbing. It feels like they are all dying and I’m mourning…nobody gets it. I know I probably sound mad to neurotypicals, but I can’t help it.\n  \n    I know I can just rewatch the anime and read the manga again and again and the story I fell in love with will still be there. I know I can interact with the fandom, read fanfic and see the lives of these characters continued. I know that. But I’m still so upset.\n  \n    I guess what I want to know is: Has anyone else dealt with a special interest show/series ending and if so how did you handle it? Did you react similarly to me?\n  \n    How long did it take you to enjoy your interest again without feeling that gut-wrenching sadness?\n  \n    I don’t want to try and connect with something else and let it be my new special interest. I love mha. I can’t part ways with it but I’m just so so sad. :(\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 26,
            "title": "Kind of embarrassing but I really need help on this asap. Need to take a really terribly bitter and nasty pill or things get bad for me. But how can I? ",
            "link": "https://www.reddit.com/r/autism/comments/1d3umh7/kind_of_embarrassing_but_i_really_need_help_on/",
            "votes": 6,
            "comments_count": 24,
            "created": "2024-05-30T03:29:01.209000+0000"
        },
        "body": "I've had very sensitivity in taste and it triggers  my gag reflects pretty easily all my childhood and  in my adult life. I haven't always taken the best care of myself and hurt myself I guess so I've unknowingly got a staph infection in  my toe. Applesauce isn't good enough,  I don't  like drinking reguar milk or yogurt. Taking pills is a terrible process in every way for me and I dunno what to  do. I can't cut the pill too much. Please  suggest anything  if you think it could help.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 27,
            "title": "My 2yo daughter just got diagnosed with ASD level 3",
            "link": "https://www.reddit.com/r/autism/comments/1d3vnya/my_2yo_daughter_just_got_diagnosed_with_asd_level/",
            "votes": 5,
            "comments_count": 11,
            "created": "2024-05-30T04:28:16.189000+0000"
        },
        "body": "As mentioned in the title, we just received the diagnosis this morning. Prior to the evaluation, I kinda have a hunch that we’re behind in some skills developmental wise (mainly speech). I also have accepted that there might be a chance we’re gonna get the diagnosed. But damn. I didnt know it’s gonna hurt so much once you ACTUALLY get it. It felt like I failed my daughter, I shouldve gotten her evaluated earlier, I shouldve exerted more effort.\n  \n    Pls tell me it gets better. Not for me but for her.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 28,
            "title": "\"Rules\" around dating???",
            "link": "https://www.reddit.com/r/autism/comments/1d3xv35/rules_around_dating/",
            "votes": 3,
            "comments_count": 4,
            "created": "2024-05-30T06:54:13.026000+0000"
        },
        "body": "I often see people talk about what you should and shouldn't do when dating someone, especially in a new relationship. There's like timelines of when to have your first kiss, say i love you ,etc. Then you need to be careful to not give too much affection, but also not too little. If you say ily too much it's weird and too fast, but if you say it too little it's not good either???\n  \n    I'm confused by all these \"rules\", how do I know I'm doing good in my own relationship???\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 29,
            "title": "Did anyone start stimming more after diagnosis?",
            "link": "https://www.reddit.com/r/autism/comments/1d3u6m1/did_anyone_start_stimming_more_after_diagnosis/",
            "votes": 6,
            "comments_count": 6,
            "created": "2024-05-30T03:04:54.264000+0000"
        },
        "body": "I am not diagnosed, but I got assessed a few weeks ago and find out my results in a couple weeks. I have stimmed for as long as I can remember. Usually I rock back and forth, I shake my legs a lot, play with my nails, play with random objects. But recently I am noticing myself stimming WAY more. I think maybe I just wasn’t as aware of my stims. I really never noticed them until someone would ask me to stop. Usually when I was doing a loud or bothersome stim. Like snapping the back to the remote off and on the entire time me and my boyfriend would watch movies 😂 Anyway, has anyone else experienced this? I’m not sure if I’m stimming more or just more aware of it now.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 30,
            "title": "Most Nerotypicals I've Meet Contradict What They Say",
            "link": "https://www.reddit.com/r/autism/comments/1d3jjq3/most_nerotypicals_ive_meet_contradict_what_they/",
            "votes": 28,
            "comments_count": 7,
            "created": "2024-05-29T18:43:04.201000+0000"
        },
        "body": "Not every nerotypical is like this but the ones I've met so far are almost always behaving in this manner...\n  \n    \"We should hangout on Saturday!\" then doesn't show up that day to hangout and cuts off all contact with you\n  \n    \"Hey bestie!\" when you guys only knew each other for a few days then a couple weeks later they cut off contact\n  \n    \"Sure I don't mind you showing me this at all!\" then later on gets upset for showing them what they said was okay to show them\n  \n    \"You can talk to me about anything!\" then when you do they tell you to stop\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 31,
            "title": "Anyone else infantilized and berated for it ",
            "link": "https://www.reddit.com/r/autism/comments/1d3xouc/anyone_else_infantilized_and_berated_for_it/",
            "votes": 3,
            "comments_count": 2,
            "created": "2024-05-30T06:41:41.101000+0000"
        },
        "body": "I’m soooo fucking sick how when you have autism, non-autistic people either treat you like a newborn or the CEO of a company, and never at the correct times.\n  \n    For example, my girlfriend, who knows I have autism and sometimes makes fun of me for it, never tells me anything important or even slightly negative that’s happening to her because “I don’t understand it” and I, specifically, “can’t help” her with anything. ISTG get confused about one social cue or misconstrue a single statement on accident and these assholes will treat you like you just came out of the womb. She actually did tell me about something that was concerning her today (an amazingly rare occurrence and victory for me), companies collecting data and selling it to the government, which I understood and had my own knowledge about so I knew I could help her and maybe ease her concerns. I brought up several points and built on her ideas. I knew she thought I wouldn’t understand so I built my sentences very carefully and agreed with many of her points so she would know I did. But she kept saying I didn’t, and tried making up these elementary school word problems type shit to “get me to understand” ISTG it was a whole “Johnny bought 10 watermelon type thing”. I told her I understood and she got mad because “I should have interrupted her sooner” to explain I did, but I was literally telling her the whole time I did, plus, it’s really rude to interrupt when someone is in the middle of a thought. She got angrier and said that I clearly had never been in a normal conversation and if I would just explain things in a “fucking normal way” it would be better.\n  \n    I did get upset because she yelled at me with that last sentence. The whole time I was talking like I normally do with my friends and in group discussions where everyone understands my ideas fine, or at least I think they do. Her saying that I wasn’t making any sense when I was thoughtfully planning my answers for her really brought me back to reality that to everyone else it really does seem like I’m talking in an alien language. It’s also like she was so determined to believe I am below average comprehension that she purposely infantilized me and made up roadblocks I’d clearly run into on purpose to confirm I was dumb. I thought I was doing what she wanted, I just wanted to help her not feel scared.\n  \n    Is it normal for non-autistic people to interrupt each other in a conversation? Welcomed even , like my gf said? Why did she make me out to be so dumb when I was using very clear and informed discussion? Are non autistics so afraid of smart autistic people they’d make up a fake set of requirements like that?\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 32,
            "title": "how big of a deal is asking for a ride home from work?",
            "link": "https://www.reddit.com/r/autism/comments/1d3w5ns/how_big_of_a_deal_is_asking_for_a_ride_home_from/",
            "votes": 4,
            "comments_count": 6,
            "created": "2024-05-30T04:58:52.172000+0000"
        },
        "body": "I have severe anxiety + I'm autistic, I don't have my license and usually get a ride to and from work from my fiancee. She's going to be working weekends now, and I'll have a ride to work but not necessarily from, depending on what time my shift can be done. My work doesn't have a set end time, so I have no way of knowing if I'll have a ride or not until the very last minute. This means if I need a ride, I'd be asking once or twice a week, at the last minute. There isn't any public transport that late where I am (4pm+) and I can't afford an Uber/Lyft/Taxi. I don't really know my coworkers and I don't want to be a burden. How big of a deal is this, socially? Is this okay to do, or do I need to try and find another way? My fiancee says to just ask and its fine but I feel like I can't do it.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 33,
            "title": "To what extent do you feel accepted by the neurotypical community?",
            "link": "https://www.reddit.com/r/autism/comments/1d3vtqy/to_what_extent_do_you_feel_accepted_by_the/",
            "votes": 4,
            "comments_count": 6,
            "created": "2024-05-30T04:38:03.753000+0000"
        },
        "body": ""
    },
    {
        "meta": {
            "idx": 34,
            "title": "How do you start a phone call??",
            "link": "https://www.reddit.com/r/autism/comments/1d3vtb0/how_do_you_start_a_phone_call/",
            "votes": 4,
            "comments_count": 4,
            "created": "2024-05-30T04:37:15.452000+0000"
        },
        "body": "I always mess this up and end up talking over the other person lol. here's how I think it is supposed to go: Person A calls A: hello this is A. B: hello this is B. A: Hi B, starts talking about the topic at hand.\n  \n    Is this right?\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 35,
            "title": "Sorta funny 6th grade story",
            "link": "https://www.reddit.com/r/autism/comments/1d3x3bv/sorta_funny_6th_grade_story/",
            "votes": 3,
            "comments_count": 1,
            "created": "2024-05-30T06:00:23.683000+0000"
        },
        "body": "This is quick, but in 6th grade I joined a drama class outside of school. It was terrifying but I’ve always had a passion for acting so it was fun. One of the days we were doing improv, and our teacher told us we had to choose something to complain about. Most of the kids chose something that flowed well and made sense, I can’t quite remember what they chose since it was years ago but ya! When we went around in a circle sharing what we were going to complain about, I said “I’m going to complain about the lights being too bright!” My teacher was like “uh…okay” and I think the other kids thought I was strange 😭 I didn’t realize at the time but I genuinely thought the lights were way too bright and I hated it, I felt very singled out. Anyhow I thought this might be a funny/possibly relatable experience\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 36,
            "title": "Workplace dress codes",
            "link": "https://www.reddit.com/r/autism/comments/1d3vm1s/workplace_dress_codes/",
            "votes": 4,
            "comments_count": 3,
            "created": "2024-05-30T04:25:08.855000+0000"
        },
        "body": "…like, I don’t EXPECT to be allowed to wear a Lamb of God (metal band) shirt to work per se, and I realize today was probably pushing it.\n  \n    But I just Can’t do dress codes, for a few reasons. The only one that worked for me was when I worked at the Vans store. Otherwise, I can’t.\n  \n    It’s sensory to a degree, it’s the distraction of knowing I’m not wearing what I would’ve otherwise wanted to wear and therefore not feeling like Me, it’s the resentment of fashion being sort of a hobby/passion of mine and collecting band shirts that I apparently can’t wear to an IT job at a a COLLEGE.\n  \n    So that’s the other part of it….is that it just doesn’t even make sense. There are a couple of other guys in the department with different bosses who can wear whatever shirts they want and/or hoodies all the time (in other words, never a collared shirt, whereas I was told I need to wear one).\n  \n    I am burned out on this job for other reasons but this has pushed me over the edge, on top of not being allowed to wear shorts (not even if they are below the knee). I feel like it sounds beyond ridiculous to anyone else. I’m a 42-year old man this close to quitting a job over a bunch of band shirts and cargo shorts.\n  \n    But dress codes have never sat right with me. I’m also a trans man (I guess somewhat genderqueer, I mean I use he/him pronouns and typically want to be perceived as a man, but I still hate gender haha). So I feel like I already had to dress in a way that was performative and Not Me, prior to transition. I didn’t transition until I was 34.\n  \n    So it just has all these added layers of resentment for me, and I want to fight this but don’t know what to say that will make sense to them. I’m also not diagnosed and can’t afford it. So I can’t really frame it as asking for accommodations. Can I?\n  \n    Has anyone ever fought back against a dress code  due to reasons a bit more along the lines of self-expression rather than sensory?\n  \n    Has anyone ever quit a job because of the dress code- or, not necessarily because of it…but was it the thing that finally drove them to quit?\n  \n    I don’t know what to do. I’m just getting more and more worn down the older I get, by having to look a certain way. I’m sort of embarrassed at how much it upsets me. I know logically I shouldn’t care so much, but I hate it so much that it’s making me physically sick and it’s making me not want to go to work tomorrow.\n  \n    Thoughts? Sorry, I know this got long. And yes I am looking for another job. :-/\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 37,
            "title": "What fictional characters do you headcannon as autistic?",
            "link": "https://www.reddit.com/r/autism/comments/1d2yd9y/what_fictional_characters_do_you_headcannon_as/",
            "votes": 773,
            "comments_count": 1114,
            "created": "2024-05-28T23:49:54.728000+0000"
        },
        "body": "Any character from any medium. Books, movies, comics, games, tv. What characters make your autism radar spike? And why do they do that and/or resonate with you?\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 38,
            "title": "Share your safe foods!",
            "link": "https://www.reddit.com/r/autism/comments/1d3u863/share_your_safe_foods/",
            "votes": 5,
            "comments_count": 9,
            "created": "2024-05-30T03:07:15.030000+0000"
        },
        "body": "I'm going off to college this fall and I need to figure out what food to eat since I don't get lunch at school anymore. I really like Mac and Cheese since it's incredibly versatile; you can put almost anything in it and it'll be good. Honestly, I like almost anything with noodles.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 39,
            "title": "do u ever wish that magic was real & u could learn to do magic at home from internet how-to guides?",
            "link": "https://www.reddit.com/r/autism/comments/1d3u0m0/do_u_ever_wish_that_magic_was_real_u_could_learn/",
            "votes": 5,
            "comments_count": 4,
            "created": "2024-05-30T02:56:12.815000+0000"
        },
        "body": "i wish i could just go on youtube and look up \"how to shapeshift\" and watch a video guide that teaches what magic runes i need to picture in my head and what incantations i need to speak to shapeshift in real life.\n  \n    i hope autistic ppl like me wuld be decent at it.\n  \n    i wuld shapeshift into my fursona.\n  \n    what about u, do u wish magic was real and easily learnable?\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 40,
            "title": "Hyperfixations on media/characters",
            "link": "https://www.reddit.com/r/autism/comments/1d3wsys/hyperfixations_on_mediacharacters/",
            "votes": 3,
            "comments_count": 1,
            "created": "2024-05-30T05:40:54.810000+0000"
        },
        "body": "Hi, I am 30 years old but I have found through my life that I go through periods of being totally obsessed with a character from some media. It can change my interests, my whole attitude toward life, my eating habits, my appearance, because I am so obsessed with this character. It's not even that I want to BE them, but I do want to do things to my appearance that reflect them and how inspired by them I am. Is it an autism thing?I hadn't felt it in a long time but lately I was gripped with it again, and it's not necessarily a harmful thing because in general the fixation is positive (gets me to exercise when I usually find it hard, gets me to want to style my hair when I usually don't care). Etc...I do also think it could be that I am letting myself have fun and my inner child is enjoying herself how she wasn't able to before when she was younger.Curious about your thoughts or experiences regarding this.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 41,
            "title": "Did anyone else talk a lot as a kid?",
            "link": "https://www.reddit.com/r/autism/comments/1d3twvn/did_anyone_else_talk_a_lot_as_a_kid/",
            "votes": 5,
            "comments_count": 3,
            "created": "2024-05-30T02:50:43.340000+0000"
        },
        "body": "My mom said that when I was younger I would “talk to anybody about anything” and that “I didn’t know a single stranger”. I find this interesting because now I’m the complete opposite and really struggle with communicating with others I don’t know very well. I’m curious if anyone else used to be outgoing as a child and if y’all also became more shy.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 42,
            "title": "Scratching the lonely itch",
            "link": "https://www.reddit.com/r/autism/comments/1d3yhmr/scratching_the_lonely_itch/",
            "votes": 2,
            "comments_count": 1,
            "created": "2024-05-30T07:39:58.770000+0000"
        },
        "body": "Sorry if this is a topic covered elsewhere. I tried searching, but was overwhelmed by the sheer volume of posts reporting so many others experiencing loneliness. So I suppose the camaraderie is there, but I am looking for solutions.\n  \n    How do you deal with the loneliness, outside of the obvious \"go make new friends\", \"join a support group\", \"find an outside community relevant to your interests and join that\"? I've been sick for quite a while, and throughout my decline I've lost all friends and family. Just lost my very last \"friend\" today (which was an asshole ex of mine, so I'm honestly not weeping over that). I, like so many of you from the sounds of things, tend to attract users and abusers. I don't think I want people in my life anymore, but I do still feel quite lonely.\n  \n    I've joined a lot of groups on topics that interest me, but I tend to not talk much because it feels difficult and my words are often met with little response. I've tried journaling (or at least ranting on paper), and somehow it makes me ache a little more. Involving myself in my special interests helps, but I've been finding that harder to do regularly because I've been getting more sick. I have a therapist I see regularly and I guess I do talk a little to her, but I'm thinking of discontinuing that because it's not been beneficial.\n  \n    Anyone have any good suggestions that works for them above and beyond all that?\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 43,
            "title": "At what age were you diagnosed?",
            "link": "https://www.reddit.com/r/autism/comments/1d3jdm3/at_what_age_were_you_diagnosed/",
            "votes": 22,
            "comments_count": 32,
            "created": "2024-05-29T18:35:43.830000+0000"
        },
        "body": ""
    },
    {
        "meta": {
            "idx": 44,
            "title": "What are your comfort things really?",
            "link": "https://www.reddit.com/r/autism/comments/1d3cksi/what_are_your_comfort_things_really/",
            "votes": 53,
            "comments_count": 65,
            "created": "2024-05-29T13:45:27.054000+0000"
        },
        "body": "I am pretty sure all of us here have something that brings us comfort, whether it is food, a cartoon, an animal or maybe an interest - I am genuinely really curious to see everyone’s comfort things out there. My comfort food is seafood, my comfort cartoons are Hello Kitty and Friends Supercute Adventures and MLP. As a kid I had comfort toys too - I had a LPS collection that I lost a few years ago, I miss it ;; Nonetheless I still have a huge interest in LPS My comfort games are Tomodachi Life, or any Mii related Nintendo game, and the Animal Crossing franchise!!! My favorite all time Nintendo console is the 3DS!! :DDD And I have a huge interest in collecting Hello Kitty plushies, or plushes in general, I have around 40 in total. :DDDD (I also have a bunch of hello kitty posters and accessories around my room, I really have an obsession with sanrio..)\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 45,
            "title": "Autism",
            "link": "https://www.reddit.com/r/autism/comments/1d3w7kn/autism/",
            "votes": 3,
            "comments_count": 9,
            "created": "2024-05-30T05:01:53.234000+0000"
        },
        "body": "I'm 22 years old and i still cant understand why people can't pick up a hint without me directly saying outloud that im autistic. I've dealt with this my whole life kkeeping to myself unless im around certain people and for some reason people needing to force me into uncomfortable social situations,its like they see me and immediately think \"hey this guys minding his buisness let me put the spotlight on him\". Ill never understand why some people cant pick up a hint. I walk around stores hands in my pockets and head down or constantly gripping my jacket tails. I try and stay polite but reserved and say \"excuse me\", \"have a good day\" etc and people jsut look at me as if i said \"fuck you\" or \"i just ran over your dog\" the simple fact i exist and aint some yippity yappity howdy doodee fella is a good enuff reason to look at me as dogshit. When i got off worm today i just wanted to go get someothing fofor dinner and leave for home, got to Tim's and noticed the drive thru was under construction, almost considered just goin home. I hate entering most stores, at the moment im even more awkward than usaul because im quitting nicotine at the moment. I decided it'd probably be fine to enter the store. I got out and purposely let this old dude go ahead of me and he held open the door. I said \"thanks holmes\" and we get to the second door, and he goes \"lets try that again\" and i just assumed he didnt hear me, i have really good hearing and everything i saw sounds loud to me. I said \"thanks man\" louder when he opened the second door, we got to the counter, as hes ordering his stuff i look at the menu and he turns aroudn and asks \"what are you getting\" and i immediately think to our small town trend of \"buy the person behind you's order\" and i jumped to \"no man you dont gotta buy my food or nothing, thanks tho\" and he goes \"i was jusg askin j dont wanna buy your stuff\" i felt like a jackass but i didnt want soemone to buy my meal because its so fucking awkward and i dont wanna sit there as the waitress goes \"what a gracious man arent you a lucky boy\". The waitress also happened to be a chick who used to hang around my group but after that the whole store looked at me like i was dogshit. I felt like just fuckin crying. Not even to be a bitch just because i was so sick of these people who try to force a conversation outta me and all thw times ive given obvious signs that i just want to be left alone. I have friends i talk to, it doesnt bring me happiness to talk to a stranger. I appreciate them but please just lay off when im giving obvious signs i just want to exist quietly. I know it isnt the worst thing to have autism but it doesnt help when people simply dont want to respect the fact unless your loud and in their face about it\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 46,
            "title": "Certain words as triggers?",
            "link": "https://www.reddit.com/r/autism/comments/1d3w7cx/certain_words_as_triggers/",
            "votes": 3,
            "comments_count": 2,
            "created": "2024-05-30T05:01:30.573000+0000"
        },
        "body": "DAE get really triggered by the words “should” or “expected to/expectation(any form of this word)?\n  \n    Example: “the expectations are ___________(insert some completely arbitrary rule), and you should be responsible and follow them”\n  \n    Usually said by some authority figure or intense and overbearing personality in your life, usually on topics like: -wear certain style of clothing to project an image -eat all your food on your plate -not wearing headphones -ignore insert offending noise and you should just grow up- the world expects you to pull your weight  or get left behind and you’re gonna have to grow up and deal with noises because the world doesn’t pander to anyone\n  \n    And overtime even without an actual comment- hearing those words cause your internal organs to twist?\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 47,
            "title": "Personal Project",
            "link": "https://www.reddit.com/r/autism/comments/1d3y41u/personal_project/",
            "votes": 3,
            "comments_count": 2,
            "created": "2024-05-30T07:11:36.885000+0000"
        },
        "body": "Hi everyone!\n  \n    I've got a little request. I've written a couple blogs about my experiences with horror literature as an autistic person, and I'd love if some of you guys would take a look and tell me what you think.\n  \n    This is the link Home - Reading Neurodiverse (webadorsite.com). Hope you enjoy :)\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 48,
            "title": "Scared of the “it’s just my autism!” mentality",
            "link": "https://www.reddit.com/r/autism/comments/1d3kgxq/scared_of_the_its_just_my_autism_mentality/",
            "votes": 17,
            "comments_count": 14,
            "created": "2024-05-29T19:22:55.502000+0000"
        },
        "body": "Ever since I put autism in the table of possibilities, I’ve been scared I’ll succumb to the mentality of “it’s just autism and there’s nothing I can do about it”, and I’m not sure if that’s a good mentality or not.\n  \n    Growing up, my parents never even suspected autism, so they were always extra strict on me about all the stuff related to autism. I’d never get better at stuff like infodumping around other people and my general clumsiness, forgetting stuff all the time, I was also punished for my stims/tics like biting my nails(which I eventually got rid of, but just substituted for another more discrete habit). Nowadays i just contain myself a lot around other people, I avoid (for example) some comments, not because I think they’re impolite, but because I don’t want to risk being viewed as impolite, as a result of it all. It’s not like “masking”(I think), it’s just not getting too intense about anything around people.\n  \n    All of this makes me indecisive, when I don’t want to socialise with people, for as rude as it is, a part of me will say “it’s just your autism, it’s totally valid if you don’t wanna interact”, and another part, like an inner voice of my parents, says “it’s rude to not interact, simple as, you should feel bad for not doing so”. It’s confusing, and I don’t want to succumb to the “it’s just autism lolz” mentality, because I feel like that’d make me stop trying to improve, but I also feel like I can’t push myself with my other mentality that I got from my parents, because autism is still a disability, and it still makes me unable of certain things.\n  \n    Should I succumb? Is that healthy? Should I not do it at all? I’m genuinely dumbfounded on this and I’d like some outside opinions, thanks.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 49,
            "title": "Late-diagnosed with \"successful\" career: what now?",
            "link": "https://www.reddit.com/r/autism/comments/1d3ir9g/latediagnosed_with_successful_career_what_now/",
            "votes": 20,
            "comments_count": 9,
            "created": "2024-05-29T18:09:51.826000+0000"
        },
        "body": "Wondering if there are others that can relate to my experience. I was a hard-working, high-achiever growing up. Straight As, lots of extracurriculars, extremely high SAT score, top tier college, prestigious job out of undergrad. I'm now early-40s and have had a wildly successful career by most standards, financially above all else. I ended up making it to the senior exec level in big tech with a couple large windfalls in recent years.\n  \n    All along, I've felt like I was hanging on by a thread. I only recently learned that I'm ADHD and autistic, though the signs were there all along. Lots of sensory issues as a child. Always felt like an unknowable outsider. Constant struggles to click with others socially. Intense interests and pursuits. Alcohol as a crutch to connect with others.\n  \n    Professionally, for decades I have described my experience to others as \"arming up\" with my \"work mask\" every working day. My work self was outgoing, friendly and driven which felt like the uniform I was supposed to wear to be successful. I was low-level miserable more often than not and would often feel like I'd be holding my breath for 2 or 3 years in a given job until I could \"escape\" to the next one. My motivation was almost exclusively achievement and financial reward; the work itself rarely felt purposeful or engaging.\n  \n    I used medication to deal with serious public speaking anxiety. Lots of imposter syndrome. Receiving constructive feedback and having performance reviews was excruciating. I was constantly told I was incredibly smart and at times I'd feel highly competent, confident, and effective. Other times I'd feel like a fraud that lucked into my circumstances.\n  \n    Having discovered I'm AuDHD, I've been able to extend compassion and grace to myself for both my personal and professional challenges. I'm now trying to figure out what my career should look like going forward. There's a part of me that wants to just throw in the towel given that I've had success but have had a generally negative experience.\n  \n    On the other hand, I'd love to figure out a way to reshape my work pursuits to be truly meaningful and engaging. If that's even possible...\n  \n    Anyone relate or have words of wisdom to share?\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 50,
            "title": "Anyone else get laughed at in Subway / other food places? ",
            "link": "https://www.reddit.com/r/autism/comments/1d36vvp/anyone_else_get_laughed_at_in_subway_other_food/",
            "votes": 128,
            "comments_count": 83,
            "created": "2024-05-29T08:02:58.418000+0000"
        },
        "body": "I really like the subway bread, however due to all my food phobias and sensory issues, I want only cheese on my sub. No salad, no sauce, no meat. Just cheese.\n  \n    However everytime I order these the sandwich artists crack up as if it's the funniest joke in the world. It doesn't matter which subway it is as I go to many different branches. One worker even held my sandwich up to their co-worker and said \"have you seen this order\" whilst they both laughed.\n  \n    I know it isn't a huge deal and if the workers can find small things amuse after all the crap they have to deal with then that's fine but it does get tiring when it's every single time I go there....\n  \n    Does this happen to anyone else?\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 51,
            "title": "Subtitles and Closed Captions? ",
            "link": "https://www.reddit.com/r/autism/comments/1d3vm52/subtitles_and_closed_captions/",
            "votes": 3,
            "comments_count": 5,
            "created": "2024-05-30T04:25:15.967000+0000"
        },
        "body": "Does anyone else benefit tremendously from subtitles and closed captions?\n  \n    I find I need these in order to fully understand, process, and appreciate what I’m watching.\n  \n    I don’t have any hearing loss; but when I was in college struggling with lectures, I saw the audiologist on campus and she told me I very likely have auditory processing disorder/language processing disorder. This was about a decade before my formal Autism diagnosis.\n  \n    Curious if anyone else shares this experience.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 52,
            "title": "anyone else is with extremely obvious autism?",
            "link": "https://www.reddit.com/r/autism/comments/1d3xk96/anyone_else_is_with_extremely_obvious_autism/",
            "votes": 2,
            "comments_count": 2,
            "created": "2024-05-30T06:32:51.995000+0000"
        },
        "body": "I'm pretty much the most stereotypical version of autism and I can't hide it. Like I talk weird, I bring taboo topics accidentally, I have no social skills etc...\n  \n    like anyone else relates?\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 53,
            "title": "Recently diagnosed, still don't believe it",
            "link": "https://www.reddit.com/r/autism/comments/1d3vf4u/recently_diagnosed_still_dont_believe_it/",
            "votes": 3,
            "comments_count": 9,
            "created": "2024-05-30T04:14:06.118000+0000"
        },
        "body": "i still think there is no way i could actually be autistic...until i go outside and remember that i wasn't given a diagnosis for no reason.\n  \n    do you get that? the constant wavering betwen \"yep, definitely\" and \"no shot\" kinda makes me feel like an impostor 60% of the time. the fact that my traits are relatively mild compared to how others portray them adds to that as well\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 54,
            "title": "Do incoherent texts, typos and/or grammatical mistakes affect you negatively?",
            "link": "https://www.reddit.com/r/autism/comments/1d3nafp/do_incoherent_texts_typos_andor_grammatical/",
            "votes": 10,
            "comments_count": 13,
            "created": "2024-05-29T21:32:46.073000+0000"
        },
        "body": "My friend doesn't mind at all. I find that fascinating and I am slightly envious. Personally, I get deeply frustrated. My brain gets occupied with questions and this is mentally exhausting. Inconsistencies jump at me. Only if paragraphs are logically structured and coherent, reading is a bliss.\n  \n    So, do you mind?\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 55,
            "title": "i am eminently moving in a few months and idfk what to do",
            "link": "https://www.reddit.com/r/autism/comments/1d3x9q9/i_am_eminently_moving_in_a_few_months_and_idfk/",
            "votes": 2,
            "comments_count": 2,
            "created": "2024-05-30T06:12:23.235000+0000"
        },
        "body": "i (18m) have known since like last year i was moving end of this summer and now as the date gets closer im starting to panic more and more because i get scared going to the store alone i dont know how the hell im going to live on my own and be an independent person. the thing is that i can't get out of this either, im going to be attending college in September and just nothing went how i wanted it to and now I'm stuck doing this and im genuinely terrified because i am moving across the goddamn country with pretty much zero plan because i my actual plan fell through.\n  \n    i dont want to drop the course though because i need to get out of where im living now for other personal reasons.\n  \n    it's not gone how i want to because i don't like change and ignored things and procrastinated dealing with it because i didn't want to do it to begin with but i felt like i didn't have a choice, not that i didnt WANT to go to college which I really do, but if i had just done this right i wouldn't be in this postto begin with. I'd still be scared shitless but at least I'd know kind of what im doing.\n  \n    anyone whose had to do this i am so scared idk how to deal with this. sorry it's this is kinda incoherent I'm a little upset rn\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 56,
            "title": "Do you dream in autism? ",
            "link": "https://www.reddit.com/r/autism/comments/1d3rx2w/do_you_dream_in_autism/",
            "votes": 5,
            "comments_count": 11,
            "created": "2024-05-30T01:09:06.870000+0000"
        },
        "body": "Are you autistic in your dreams and are other people autistic in your dreams?\n  \n    If your mind can grasp how a NT person behaves when you're dreaming, what stops you from masking?\n  \n    If everyone in your dreams is autistic, do you sense NTs are missing?\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 57,
            "title": "Are there any other Autistic therapists on here?",
            "link": "https://www.reddit.com/r/autism/comments/1d3qonv/are_there_any_other_autistic_therapists_on_here/",
            "votes": 6,
            "comments_count": 1,
            "created": "2024-05-30T00:06:52.275000+0000"
        },
        "body": "I'm a therapist in my late 30's, diagnosed with ASD earlier this year well into my therapy career. I always suspected I may be Autistic, but started to consider it much more seriously after working more with late-diagnosed Autistic adults and seeing so much of myself in the experiences they described.\n  \n    I'm wondering if there are any other Autistic therapists on this forum, and if so, if they know of any good resources or groups for Autistic folks in the field? I'd like to work toward specializing more in offering neuro-affirming therapy for Autistic people as I see so many people struggling to find a therapist who is competent working with us.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 58,
            "title": "Today my teachers were very rude to me",
            "link": "https://www.reddit.com/r/autism/comments/1d3b5bx/today_my_teachers_were_very_rude_to_me/",
            "votes": 50,
            "comments_count": 12,
            "created": "2024-05-29T12:36:11.382000+0000"
        },
        "body": "Today there was a simulation of the final oral exam and I wanted to try because I really suck at talking. I just wanted to practice and get some feedback but what I got instead was a group of teachers that were looking at me as if they were annoyed, tired and bored; some were talking to each other, while some were giving each other side-eyes. And some even had the audacity to tell me to look at them in the eyes and that I had a bad attitude (like what am I supposed to look at? I don't really wanna look at people giving me annoyed facial expressions). I felt like I was being bullied by those who are supposed to teach me how to improve. I am very aware that listening to someone that makes many pauses, doesn't look at you in the eyes and just looks unresponsive is very boring but I feel like they could have behaved in a more appropriate way.\n  \n    I also hate that when I said that I felt like there was no point in me continuing talking because my grade would be still very low, one of my teachers said that it wasn't true and that I should still try... I hate it when people give you fake hopes. Just shut up or tell me true, I'm not going to get offended or something.\n  \n    I just hate school... I always try to do my best but all my effort is useless... I did my best to try looking in the eyes sometimes, speaking clearly and faster but I'm not even near to what my classmates are able to do. Sometimes I just wish I was normal like them.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 59,
            "title": "Anyone else self diagnosed from TikTok ? ",
            "link": "https://www.reddit.com/r/autism/comments/1d3uurf/anyone_else_self_diagnosed_from_tiktok/",
            "votes": 3,
            "comments_count": 6,
            "created": "2024-05-30T03:41:58.707000+0000"
        },
        "body": "My son is autistic and now I think I may be too. Actually, I’m quite sure I am! I have seen several videos from autistic women who I feel like are telling my exact story. There’s alot of things that I thought I was the only one in the world who experienced. Now I’m in my 30s and I feel kinda sad that no one noticed when I was younger. Maybe life could’ve been easier….\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 60,
            "title": "I think a lot about the whole \"curing autism\" debate...",
            "link": "https://www.reddit.com/r/autism/comments/1d3nj2s/i_think_a_lot_about_the_whole_curing_autism_debate/",
            "votes": 9,
            "comments_count": 5,
            "created": "2024-05-29T21:43:52.757000+0000"
        },
        "body": "I was subjected to unethical medical experimentation as a child for this very purpose (lol didn't work), so every so often I end up thinking about the concept of \"a cure\" and the various points of view that people have on it (both within and outside of our community). I've seen plenty of neurotypical people talk about \"the need for a cure\" (ugh, haven't we all?), but I've also seen other autistic people talk about it, too - people on all sides of the spectrum saying \"well, if I could have a cure, I would\". As a kid, I was one of those people. I fully believed my family's rhetoric around autism being The Thing That Was Wrong With Me and if they could just fix it, I'd always be happy, right?\n  \n    I think I finally figured out what bothers me about the entire concept (outside of the obvious lol): it's not about the cure, it's about the relief. I would never, ever want to \"cure\" my autism. It's how my brain developed, it's an integral part of my personality and interests, my skills and challenges. There are plenty of deeply autistic things about me that are inconvenient or harmful in some way - sometimes struggling with sensory stuff or \"coming on too strong\" socially - and yeah, some of that stuff I would love to be able to control! It would be cool if there was a medication I could take that would make certain types of light or noise bearable on a bad day, like taking a painkiller for a headache. I'd love it if there was an actual form of positive, constructive talk therapy that could genuinely teach me some of the social awareness that I still struggle with at times. But neither of those would change who I am, they would just relieve some of the discomfort. There always seems to be an element of removing our agency and changing us completely when people advocate for \"the cure\", even among autistic people. The only \"fix\" I could ever want would be the exact opposite - relief for some of the challenges that I could pick and choose, not the other way around. People always talk about \"the cure\" (from medical intervention or, god fucking forbid, ABA) as if it's some kind of universal thing that would just make us neurotypical, but that's such bullshit. I'd love to get relief from some of the things I struggle with most and keep my weird social intuition and special interest in air traffic control, lmao. I can only imagine how much better my life would have been if, instead of trying to effectively put me through conversion therapy, my parents had been able to hand me the equivalent of paracetamol when I was struggling and say \"hey, take this and your body will stop hating the sound of your own heartbeat!\"\n  \n    Of course, there's the obvious answer - making the world an easier place for us to live in without ever having to change or adapt - but I see people say really intelligent things about that quite often, so I thought I'd look at this angle instead. :) Sorry for the ramble! (Much like the rest of us, I come by it honestly :P) I hope any of this makes sense. Would love to hear anyone else's thoughts as they have them!\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 61,
            "title": "About Communication Cards",
            "link": "https://www.reddit.com/r/autism/comments/1d3wy8j/about_communication_cards/",
            "votes": 2,
            "comments_count": 7,
            "created": "2024-05-30T05:50:52.340000+0000"
        },
        "body": "I need a good set to go off of but all I can find is either for small children or behind a paywall and I am not in the place to be spending money on these things. Does anyone have a list of cards they have or is there a master list somewhere I can access so I can make my own cards. I was recently put in a situation where I really needed cards and not having them exacerbated it.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 62,
            "title": "Stimming alternatives for nail biting/lip biting?",
            "link": "https://www.reddit.com/r/autism/comments/1d3wwre/stimming_alternatives_for_nail_bitinglip_biting/",
            "votes": 2,
            "comments_count": 3,
            "created": "2024-05-30T05:48:04.181000+0000"
        },
        "body": "I’m trying to curb my bad stimming of biting the skin off my lips and biting my nails. I keep making my lips and fingers bleed, and they hurt. Does anybody have any good advice for alternatives when I need to bite them? I already having a chewable necklace but I can’t wear it at work without being judged/teased for having it. Thank you\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 63,
            "title": "There's something wrong with me... I think ",
            "link": "https://www.reddit.com/r/autism/comments/1d3ua4p/theres_something_wrong_with_me_i_think/",
            "votes": 3,
            "comments_count": 2,
            "created": "2024-05-30T03:10:14.217000+0000"
        },
        "body": "I can barely get a few words out. When I stutter and try to force the words out I feel worse. It almost makes me not wanna talk at all. But there are times when I can talk just fine. When with my few friends it seems fine. Or even about things I can connect to.\n  \n    But with my gf it's either or. When we're sitting together for lunch on Fridays it's great despite the butterflies. But on any night when one calls the other, after a while there's an awkward silence. I know it doesn't bother he but I think it bothers me. And we're both autistic. Just tonight it felt like almost two hours of me trying to say something but backing down. And she still finds away to compliment me.\n  \n    Anyone familiar with the anime and manga Komi Can't Communicate? When I try to tell my mom about this she asks if writing it or texting it makes any difference. I try to explain how at first Komi used a notebook to convey her thoughts and get her point across.\n  \n    Is it because of my autism or is it something else? If I can speak a bit clearer or feel better about talking, that might be the first step. This was a long rant, I know, but I just had to get it all out.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 64,
            "title": "How do you ask somebody something without them feeling they are being accused?",
            "link": "https://www.reddit.com/r/autism/comments/1d3znvj/how_do_you_ask_somebody_something_without_them/",
            "votes": 1,
            "comments_count": 1,
            "created": "2024-05-30T09:07:53.062000+0000"
        },
        "body": "It’s just natural to me to be very direct and I find that this leads to a lot of misunderstanding which consequently requires a lot of explanation. I’d like to understand what the other side sees so I can better gauge the situation and just better communicate.\n  \n    So far, I find that if I state the purpose to why I am asking or just say something to reassure and tone the question down a bit then people are more relaxed. I guess sometimes I fake smile a bit too just to put people at ease a bit more but to be honest I find it a bit uncomfortable as I feel like I’m smiling for no reason.\n  \n    So I say things like “Just a question”, or “I’m asking because I don’t know (followed by the question)”. But it’s just so they don’t get defensive or misunderstand.\n  \n    However, I think they shouldn’t even if I don’t do it. Because they can also just say no or that they don’t know, which is fine also.\n  \n    I hope I make sense but yes I would appreciate to hear what you think. ☺️\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 65,
            "title": "Autistic with cancer",
            "link": "https://www.reddit.com/r/autism/comments/1d3u7zm/autistic_with_cancer/",
            "votes": 3,
            "comments_count": 2,
            "created": "2024-05-30T03:06:58.302000+0000"
        },
        "body": "I am autistic and was diagnosed last month with colon cancer. About 3 weeks ago, I had surgery to remove the tumor, but it was found that the cancer had spread into lymph nodes and is stage 3. This means that I am going to need a minimum of 6 months of chemotherapy, which will begin on Tuesday.\n  \n    I’m wondering if anyone on here has experience they would be comfortable sharing, about being autistic and having cancer. I am very much a sensory-avoidant person and am hypersensitive, and typically very afraid of, new sensory experiences that I’ve never had before. For example, I had to have a port installed near my shoulder to use for chemotherapy, and just the experience of looking at a foreign object under my skin is enough to lead to a meltdown. I’m very scared about what the sensory experience of chemotherapy will be. My doctors tell me that most people don’t feel pain or discomfort while undergoing chemo, but I also know from experience that dr’s  don’t usually take things like hypersensitivity and autistic differences into account when assessing how certain experiences will feel…so naturally I am afraid that the whole chemo experience will be a sensory hell for me and that I will struggle greatly to tolerate it.\n  \n    Anyone with experience able to share what it felt like to them, what helped, what to avoid, etc., from an autistic person’s perspective?\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 66,
            "title": "Are you hyperlexic?",
            "link": "https://www.reddit.com/r/autism/comments/1d3wfp6/are_you_hyperlexic/",
            "votes": 2,
            "comments_count": 2,
            "created": "2024-05-30T05:16:23.716000+0000"
        },
        "body": "What is it like being hyperlexic? What do you remember about this growing up? What does this look like for you now?\n  \n    Part of me wonders if I’m hyperlexic. My parents had me when they were young and I was their first child. They didn’t necessarily think to immerse me in numbers and letters but also they were not the type to notice if I had a special enthusiasm for these.\n  \n    All I know is…\n  \n\n\n    In a home video at 20 months old I seemed to have spent a whole day walking around with comfort items being a “Z” block and an “N” block; setting them up on top of different surfaces and orienting them so they looked identical and then happy stimming via hand flapping and bouncing at them .\n  \n\n\n    I would sneak stacks of books into bed each night and reread them over and over - though I feel I had to read them again and again to fully understand them .\n  \n\n\n    I have memories of my 4-5 year old self stimming by reciting the entire alphabet and counting all of the different ways each letter could be said; recognizing that there were more sounds than there were letters and obsessing over how many different sounds there are in total. I remember thinking I was really on to something and that maybe I discovered something…though now in hindsight I can confirm that the International Phonetic Alphabet (IPA) was indeed already “discovered”…but still I am impressed by my younger self for this.\n  \n\n\n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 67,
            "title": "What do autistic people find funny that neurotypicals don’t?",
            "link": "https://www.reddit.com/r/autism/comments/1d2ws0o/what_do_autistic_people_find_funny_that/",
            "votes": 560,
            "comments_count": 502,
            "created": "2024-05-28T22:38:39.878000+0000"
        },
        "body": "I think my sense of humor is a little bit different than that of most neurotypical people. Whatever they find funny, I usually don’t laugh with them. Whatever I find funny or try to tell a joke/funny story, they don’t laugh or look at me awkwardly and say “Um, Okay…”.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 68,
            "title": "I feel younger than my age",
            "link": "https://www.reddit.com/r/autism/comments/1d3f30v/i_feel_younger_than_my_age/",
            "votes": 24,
            "comments_count": 13,
            "created": "2024-05-29T15:33:59.900000+0000"
        },
        "body": "I’m 22, and I honestly feel like I’m 15. Growing up has always given me anxiety, especially now that I’m an adult but I just feel like a child 😩 My changing body terrifies me. I don’t want anything to change… I just want to be with my parents and not grow at all.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 69,
            "title": "Looking for advice ",
            "link": "https://www.reddit.com/r/autism/comments/1d3twtp/looking_for_advice/",
            "votes": 3,
            "comments_count": 2,
            "created": "2024-05-30T02:50:39.267000+0000"
        },
        "body": "false\n      \n\n    Please delete this if it is not allowed! I am not autistic myself as far as I know but I wanted to ask this community a question if it is ok. I was offered a job as a behavioral intervention staff member and it would require me to register as an RBT in order to do it. Now I am well aware of the bad things about ABA so this makes me uncomfortable. I don’t want to be hurting or traumatizing autistic and other neurodivergent folks however it does seem like after I take the training I have pretty free reign of how I run the program and what activities I do with my clients so I wouldn’t have to incorporate ABA if I didn’t want to I could just help them meet their goals. Is this still bad? I do have other experience working with neurodivergent people and I am neurodivergent myself although not Autistic. So this would not be my only training and experience but I just worry about the ethics of accepting the job. I don’t want to put making money over people’s wellbeing.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 70,
            "title": "Autistic about people and relationships",
            "link": "https://www.reddit.com/r/autism/comments/1d3zaia/autistic_about_people_and_relationships/",
            "votes": 1,
            "comments_count": 1,
            "created": "2024-05-30T08:40:09.190000+0000"
        },
        "body": "Hi All,\n  \n    I am increasingly aware that I have a degree of autism.\n  \n    I’m particularly sensitive to people & relationships, especially close relationships or with work colleagues whom I have to interact with regularly.\n  \n    It feels like something of a blind spot has been revealed to me that others might have seen/known for (potentially) years.\n  \n    Without wishing to sound self indulgent, it’s somewhat liberating to say it but it’s also something of a shock to see a blind spot about oneself. Especially as I’m not a particularly young person.\n  \n    Is this a feeling or condition that anyone else on this forum is aware of?\n  \n    Wishing you all well 😎\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 71,
            "title": "Am I the only one who experienced this? WARNING: Mentions of S/H ",
            "link": "https://www.reddit.com/r/autism/comments/1d3tr12/am_i_the_only_one_who_experienced_this_warning/",
            "votes": 3,
            "comments_count": 2,
            "created": "2024-05-30T02:42:17.677000+0000"
        },
        "body": "So I saw this tiktok where it was like ppl with autism often experience empathy in a different way. Like we literally try to put ourselves in another persons shoes and I fully agree as that was honestly the only way I could try and feel empathy for others. And looking back on it and even now I completely agree that that is how I experience empathy. Any time I try and comfort someone I always preface that while I feel sympathy for them I don’t understand how they feel so my advise may not work. Cause at the end of the day we are all different ppl. I am not going to go super into it but the person who talked about it on tiktok is @genericartdad if you want to check him out. But then I realized that I honestly went a lot further than just that.\n  \n    So my friends always joke with me that I have an addiction to angst and that all my fav character are angsty and yah it’s true. But this was early covid times like right before covid started where I became really hyper fixated on this one character and this character could not catch a break. Like they honestly just suffered and suffered and suffered. And i adored the character. Like I cried every night because of him. But I always felt horrible because even though I knew he was fake I constantly lived with the guilt that my life was so much better than his and that I could never really, truly understand his suffering. And it started to really bother me, i could not physically handle it. To the point I got sick and threw up a few times at the thought. So what I did? I started self harming in hopes to make myself suffer like him. And I know that’s crazy but I could not handle the thought of him suffering alone. And I am a lot better now I have gone to therapy and learned to cope in a better way but I need to know if this is something other autistic ppl experienced? Thanks yall :)\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 72,
            "title": "Can animals be neurodivergent ",
            "link": "https://www.reddit.com/r/autism/comments/1d3i83k/can_animals_be_neurodivergent/",
            "votes": 15,
            "comments_count": 34,
            "created": "2024-05-29T17:47:58.625000+0000"
        },
        "body": "Or is this just a dumb human thing I have to deal with?\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 73,
            "title": "Does anyone else find it difficult to use people’s names? ",
            "link": "https://www.reddit.com/r/autism/comments/1d2tvdk/does_anyone_else_find_it_difficult_to_use_peoples/",
            "votes": 711,
            "comments_count": 239,
            "created": "2024-05-28T20:37:22.967000+0000"
        },
        "body": "Like for example if someone says hi to me they’ll say “hey, JellyfishJam99!” And I’ll just be like “oh hey!”. Never using their name. I can use names for people I’m very comfortable with like my brothers, boyfriend, and few close friends, but not with anyone else. It just feels weird. I know I should use their names because it’s considered more polite but it’s a real struggle for me. Gives me almost the same uncomfortable feeling eye contact gives me (people I’m close with being the exception again). Anyone else?\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 74,
            "title": "I think I'm going crazy",
            "link": "https://www.reddit.com/r/autism/comments/1d3ynyn/i_think_im_going_crazy/",
            "votes": 1,
            "comments_count": 1,
            "created": "2024-05-30T07:53:08.868000+0000"
        },
        "body": "Previously misdiagnosed people help me please Idk where to ask this. please help me if you can. I think I'm going crazy. I was diagnosed autistic when I was 25. I was diagnosed with ocd at 14 but autism didn't come until later. I know some symptoms overlap.. I'm 29 now  I don't think autism was the right diagnosis I think schizophrenia is probably a better diagnosis again I'm not an expert. I have a lot of things that align with autism, it's hard for me to relate to people, emotions don't make sense, I stim when I'm stressed but maybe that could be both?\n  \n    I don't hear voices. But sometimes people talk about me. I'm not a very likeable person I know that but sometimes coworkers will get together and while I don't here exactly what they say I sometimes catch my name when I over hear snips of what they say.. I know that people I'm \"friends\" with don't like me.  They never talk to me unless I'm there but they all know things I only tell one or two of them. I mean fuck my closest friend hasn't even texted me in 5 months but a different friend knows about an issue I told my closest friend about???\n  \n    I am inexplicably paranoid at times. I cant do anything at home that is loud because iight not hear someone break in. If I'm outside and someone drives by I have to hide.. I don't want to I have to\n  \n    I know paranoia can be a symptom of autism. I know almost all of my symptoms could be explained as autism. But some it doesn't really fit. I know symptoms can overlap and I don't know why I need a lable but I know I'm not normal and I think I'm going crazy which means I'm not cause crazy people don't know they're crazy but it just makes more sense but whenever I ask for help they just say \"yeah your autistic weird things happen\" which yes maybe they do I'm not trying to belittle anyone else's problem but I don't know where else to ask because no one gives a singular fuck or they just say it's cause of the autism. I've done online tests for both schizophrenia and autism and I score really high for both. I know it's not necessarily accurate but on a schizophrenia test I scored 58 out of 60 with 25 being a score of seek professional help. Every other test out me I similar ranges.. But I also scored high on several autism tests too. Maybe it's in my head. It probably is everything else is anyway. It's not fair. I want it to end. I don't care what's wrong with me. I want to be able to fix it or die. None of my doctors care it's only autism, I have no friends, my parents constantly tellme I'm a worthless asshole. Maybe death would be best.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 75,
            "title": "Test a browser extension with a new approach to helping you stay focused",
            "link": "https://www.reddit.com/r/autism/comments/1d3ylfz/test_a_browser_extension_with_a_new_approach_to/",
            "votes": 1,
            "comments_count": 1,
            "created": "2024-05-30T07:47:59.527000+0000"
        },
        "body": "Important: The extension is currently only supported on Windows and for the Firefox and Chrome browsers, Opera and MS Edge should be compatible. Check out this Github repo for download and installation instructions.\n\n    Hi, for my data science bachelor’s thesis I’ve been developing a browser extension with a new approach to fight distractions. Instead of specifying apps or keywords to match, you briefly write down your task, what you need for it and what usually distracts you. Then, tab and program titles are continously evaluated for how distracting they are in regard to this description - completely offline on your device, nobody is monitoring you. The extension is designed to be neurodiversity-friendly, particularly in regards to ADHD, autism and demand avoidance. If you get distracted, one of 3 interventions will be triggered automatically:\n  \n\n\n    a chatbot to help you get back on track\n  \n\n\n    all distracting tabs are automatically identified and you’ll be offered to close or save them for later\n  \n\n\n    Firefox only: nudging you by coloring the toolbar depending on your distraction level\n  \n\n\n    Additionally, you can check out your score history in a dashboard. Here are some potential use cases for this approach:\n  \n\n\n    you need to browse some distracting website for a task, but also procrastinate there\n  \n\n\n    you find yourself overwhelmed with dozens of tabs open and want to sort out all the distracting ones with one click\n  \n\n\n    you are stuck in a hole of executive dysfunction or autistic inertia and need a push to get out of it\n  \n\n\n    you’ve been using nudging tools but got annoyed about staring at a green screen for 10 seconds when you just need to take a quick look somewhere\n  \n\n\n    you’ve tried other blocking tools but found yourself sabotaging them out of frustration about rules being incompatible with reality\n  \n\n\n    I’m looking for volunteers to test this extension. If you complete the full study (12 days for Firefox / 9 days for other browsers), you’ll be eligible to participate in a raffle in which two winners will receive 20€ each. All you have to do is occasionally interacting with short self report prompts and the interventions. Every 3 days, the type of intervention that is triggered (of the ones listed above) changes, finished by a baseline period. Some very limited data will be transmitted back to me for research during the study, see the Privacy section in the Github repo for details.\n  \n    Thanks for reading this far, and let me know if you have any other questions or feedback.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 76,
            "title": "Not easily liked or not at all",
            "link": "https://www.reddit.com/r/autism/comments/1d3v1b0/not_easily_liked_or_not_at_all/",
            "votes": 2,
            "comments_count": 1,
            "created": "2024-05-30T03:52:31.689000+0000"
        },
        "body": "Lately I feel very lonely. I've tried making friends online but they talk all over me or when in voice chat when a certain person leaves they don't really respond to me talking. I still have ptsd from highscool where a girl asked me once if I don't have any other friends beside her because she didn't like to be seen with me. It is like everyone hates me and do not want to help me, In public when I look at people they give me an expression of discust or they simply look annoyed. I try my best to be friendly and have a happy expression all the time but it's not appreciated Back in highscool I was top student of most subjects yet NT students preferred students that failed nearly every subject ! I noticed people love social people, however I am much antisocial I barely say a word when in a group I talked to therapists and even my mom but they say the same things over and over, or they tell me to be more social and mask my autism and mutism more\n  \n    I am use to being alone but I still desire a bit of company once in a while\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 77,
            "title": "Do you guys sometimes go non verbal out of Happiness?",
            "link": "https://www.reddit.com/r/autism/comments/1d3i0r2/do_you_guys_sometimes_go_non_verbal_out_of/",
            "votes": 13,
            "comments_count": 11,
            "created": "2024-05-29T17:39:22.085000+0000"
        },
        "body": "One of my special interests is thunderstorms somehow.. and I was happy stimming really heavy and just went non verbal but I don’t really know why\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 78,
            "title": "Could it be related to my autism that I don’t feel upset about my family member’s death?",
            "link": "https://www.reddit.com/r/autism/comments/1d3yem5/could_it_be_related_to_my_autism_that_i_dont_feel/",
            "votes": 1,
            "comments_count": 2,
            "created": "2024-05-30T07:33:27.486000+0000"
        },
        "body": "Unsure of what tag to use, I chose TW just in case due to mentions of death.\n  \n    So my great aunt passed away today, and when my dad told me, I didn't feel anything. I wasn't especially close with my aunt but I always enjoyed it whenever I visited her and found her generally nice to be around. After my dad told me she has died I basically just asked for some time alone to think, and I realised I don't feel anything about it, just completely neutral. Maybe it's because I'm young (15) and I don't really have a lot of experience with death, but I feel like I should feel something, even if it's just mildly upset. I do feel bad right now, but that's because I feel guilty and confused.\n  \n    Could this possibly be relating to my autism, or does this sound like something else?\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 79,
            "title": "How come no one in this subreddit upvotes comments?",
            "link": "https://www.reddit.com/r/autism/comments/1d3he7f/how_come_no_one_in_this_subreddit_upvotes_comments/",
            "votes": 14,
            "comments_count": 13,
            "created": "2024-05-29T17:12:54.624000+0000"
        },
        "body": "I’m just curious, this is one of the only subreddits where I almost never see people upvote comments they like and/or agree with. I get why maybe downvoting might be against the rules, but is there a reason for no upvoting?\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 80,
            "title": "Does a certain personality type trigger you?",
            "link": "https://www.reddit.com/r/autism/comments/1d3qif4/does_a_certain_personality_type_trigger_you/",
            "votes": 4,
            "comments_count": 12,
            "created": "2024-05-29T23:58:55.378000+0000"
        },
        "body": "I am wondering if anyone else has this experience. I can mask well enough when with allistics but there is a personality type that absolutely triggers me every time. If my inner world is a radio frequency that is humming along the best it can, then once I have to interact with this specific personality type the signal becomes distorted and I no longer feel able to mask or be in any type of control. Static...\n  \n    It's always the person who is extroverted, not necessarily insensitive but could not be described as sensitive either. It is clear that they derive all of their \"vibe\" externally. You don't get a sense that this person is authentic or sincere (with you or others or themself!). They are all about show, all about appearances, all about surface only. Some would say they may be high on the NPD spectrum. It's been an issue for me in work situations. Outside of work there is no power issue in play so it's easy enough to just steer clear. But at work....there is always one!\n  \n    It's always disconcerting because I will feel ok and think everything is fine and then...wham!  It annoys me that I haven't been able to learn how to circumvent this type.\n  \n    Does anyone else have this issue - perhaps with another personality type?\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 81,
            "title": "autism-coded Marvel characters ",
            "link": "https://www.reddit.com/r/autism/comments/1d3uv6t/autismcoded_marvel_characters/",
            "votes": 2,
            "comments_count": 3,
            "created": "2024-05-30T03:42:47.162000+0000"
        },
        "body": "For you fellow comic nerds out there-- Which Marvel characters would you consider autistic-coded? And why? I'm curious to see what y'all say.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 82,
            "title": "Was Diagnosed Autistic and I Am Much Happier!",
            "link": "https://www.reddit.com/r/autism/comments/1d3sb11/was_diagnosed_autistic_and_i_am_much_happier/",
            "votes": 3,
            "comments_count": 1,
            "created": "2024-05-30T01:28:40.131000+0000"
        },
        "body": "Hey everyone, it's my first post in the sub!\n  \n    About 1.5 years ago, I was diagnosed as Autistic. At first, I was shocked because I didn't think I was. After all, I was tested when I was younger and it did not show I was. At a young age, I always knew I was different, much different than others. I remember extremely vividly that I autism was a very strong possibility for me, even at a young age. But when I saw Autism back then, it was mostly considered non-verbal, low functioning, etc.... not the way we currently understand it today.\n  \n    As such, I effectively gaslit myself, slowly without realizing - similar to the allegory of the frog and the hot water. I had to learn to communicate and deal with people who were neurotypical while no one understood me, not even my parents. I begged for years for my parents to explain to me but they misunderstood me. One prime example was every year, I would get a report card and it would say OP is very inquisitive and every year I would ask my parents what it means. They would say \"it means you ask too many questions\" and just laugh. I got mad because they weren't explaining it, just laughing to me. It was one day when I came across the definition randomly did it all make sense. I know to some of you this seems silly but that was a huge moment for me. I'm speak literally.\n  \n    When I first got diagnosed, I felt a medley of emotions. I feel very bad that I missed \"being autistic\" during my life. I lead a life of a typical person, as best as I could (think of those funny IG/Tiktok posts of an animal blending in with another). I felt a bit of resentment but when I examined the situation more clearly, it was a blessing in disguise because if I was more of a typical autistic during my childhood and young adult life, I realistically would not be alive today for various reasons. I also have an extremely keen insight onto the way other neurotypical (and now autistic) individuals which puts me into a position of power in certain situations (Ex: Negotiations/bargaining, discussions, etc...).\n  \n    Anyone else care to share their story? I know a lot of people on reddit are autistic or have some part of themselves on the spectrum. Any advice? Any successes or failures of your own?\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 83,
            "title": "When a special interest becomes overwhelming ",
            "link": "https://www.reddit.com/r/autism/comments/1d3rxq4/when_a_special_interest_becomes_overwhelming/",
            "votes": 3,
            "comments_count": 1,
            "created": "2024-05-30T01:10:01.870000+0000"
        },
        "body": "I got into languages a few years ago. I have a talent for them and have spent a lot of time and effort into learning them. I recently got a job at a museum where my skills are put to use and for that I am glad. However, learning languages has become such an obsession that it is affecting my quality of life. I wish I could learn all languages of the world but that is impossible. I think about them all day and when I meet someone who speaks a language I don't know, I get sad that I have to just speak to them in English. I really feel gifted for having autism but I can't be at peace because of this.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 84,
            "title": "I hate my doctors and the threpist I had in in elementary ",
            "link": "https://www.reddit.com/r/autism/comments/1d3ufs5/i_hate_my_doctors_and_the_threpist_i_had_in_in/",
            "votes": 2,
            "comments_count": 2,
            "created": "2024-05-30T03:18:51.834000+0000"
        },
        "body": "Like several times my therapist I had in elementary wrote down I had an autistic trait and throughout my entire life well when I mean that I was doing okay up until when I started school and have struggled ever since. But like she never diagnosed me. When I was first sent to the mental hospital for an ualivement attempt they like yes she shows traits but this diagnosis will helped more instead it didn’t infact I struggled more and had so many attempts it’s so bad and autism wasn’t even put on my medical records until I was 17 and I was functioning better when I had support for the 1st year ever I didn’t struggle and then as soon as I turned 18 lost all my support and now I’m struggling like i use to and don’t know what to do I just really don’t know and can’t helped but feel if I got the support much earlier on in my life I could have been a functional adult\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 85,
            "title": "It's funny how people genuinely believe that I'm capable.",
            "link": "https://www.reddit.com/r/autism/comments/1d3ajgo/its_funny_how_people_genuinely_believe_that_im/",
            "votes": 33,
            "comments_count": 7,
            "created": "2024-05-29T12:04:06.553000+0000"
        },
        "body": "I'm not. I don't know what to do. I'm scared of everything. I always feel overwhelmed. I'm sensitive. My sensory issues are overlooked. Nobody I know understands how hard it is to struggle with so much and keep it bottled up inside. It's my fault for masking and pretending that I got ahold of myself. My existence is not sustainable in the sense that I'm going to break down one day and everything will be revealed. A part of myself wants to stop masking and stop pleasing people but I never do anything about it. I never show my true feelings. I'm a people pleaser. Sorry for this negative post. I become vulnerable sometimes and make posts like this that shows a tiny bit of what's going on behind the scenes.\n  \n    Btw do you know that moment when you feel extremely overwhelmed like you are going to break down but you try so hard to keep it together and act as if your fine? It takes a toll on your soul imo. I needed to put this out there I think.\n  \n    Bless you all. Have a good day.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 86,
            "title": "being touched",
            "link": "https://www.reddit.com/r/autism/comments/1d3k1bw/being_touched/",
            "votes": 9,
            "comments_count": 11,
            "created": "2024-05-29T19:04:04.096000+0000"
        },
        "body": "hi, i hate being touched when i dont know that person or if i dont give them permission. it makes that section on my body feel weird for days and i feel sick and feel the need to rip off my skin. who also has this and have you overcome it ?\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 87,
            "title": "Doctor says i don’t have autism, mom doesn’t believe her",
            "link": "https://www.reddit.com/r/autism/comments/1d3hooh/doctor_says_i_dont_have_autism_mom_doesnt_believe/",
            "votes": 12,
            "comments_count": 40,
            "created": "2024-05-29T17:25:05.023000+0000"
        },
        "body": "Im confused\n  \n    Doctor says i don’t have autism but i do have extremely severe depression and i need medication immediately but i just don’t??\n  \n    All of this was done over the phone so I’m not sure\n  \n    Everyone in my family is like 🤔🤔🤔\n  \n    Idk I’m just confused\n  \n    Edit to add more information\n  \n    Doctor says if i was 4-5 she would have diagnosed me with autism. And that my autism symptoms are just severe depression and anxiety. I am not depressed or anxious.\n  \n    Im an almost 17 year old girl\n  \n    I had mental health issues throughout my childhood but “recovered” from them around age 15. I am happy 90% of the time and i have little to no problems now.\n  \n    I don’t know much about autism but i know i relate 100% to my autistic peers.\n  \n    I don’t relate to “normal” girls my age at all. A ton of people actually thought i had been diagnosed with autism already. Autism runs in my family and most of my family thinks i do have autism.\n  \n    So i joined this subreddit in hopes that i could get more information on autism (other than googling information, i don’t understand it that way) in hopes to understand myself a bit better. Also just because i am now interested in autism whether or not i have it.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 88,
            "title": "My stance on dreams",
            "link": "https://www.reddit.com/r/autism/comments/1d3pqhw/my_stance_on_dreams/",
            "votes": 4,
            "comments_count": 2,
            "created": "2024-05-29T23:21:28.396000+0000"
        },
        "body": "It's a love-hate relationship.\n  \n    Last night, was not one, but TWO recurring dreams in one, but I will name one recurring dream - being able to fly! Last night's dream involved me wanting to fly some DIY hang-glider over some animal auction I used to routinely go to as a kid and still sometimes do, the other recurring dream.\n  \n    Being able to fly and enjoying it is the love part, but the hate part is not only the idea of warping into another world away from reality, but waking up from the fun part and being disappointed.\n  \n    For those bringing up lucid dreams, I very rarely lucid-dream. I, being a fishkeeper at heart, would have recurring dreams about being in the Walmart pet fish section (which IRL discontinued in 2019) and they would have a WILDLY expanded fish selection, even going into other animals at times such as octopuses and frogs! I rarely have said Walmart fish recurring dreams nowadays, but the last time I had these dreams, I knew they were lucid as I told myself \"I'm dreaming\".\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 89,
            "title": "One of the best (that I have seen) sensory games!",
            "link": "https://www.reddit.com/r/autism/comments/1d3pfwu/one_of_the_best_that_i_have_seen_sensory_games/",
            "votes": 4,
            "comments_count": 1,
            "created": "2024-05-29T23:07:37.049000+0000"
        },
        "body": "Its a roblox experience called \"Angel's sensory room.\" It's amazing! It's packed with balls, balloons, glowy stufff, and even it's own pet that wanders around and says Yippee when you click it! It has all kinds of stuff for every special kind! And it doesn't have chat, so people don't bother you, I really reccomend trying it <3\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 90,
            "title": "I LOVE online shopping.",
            "link": "https://www.reddit.com/r/autism/comments/1d3no1y/i_love_online_shopping/",
            "votes": 5,
            "comments_count": 3,
            "created": "2024-05-29T21:49:42.059000+0000"
        },
        "body": "I was just thinking about how much I love online shopping and how much easier and better it makes my life! Being able to order groceries online instead of going into the brightly lit, cold, loud and overstimulating store is a life saver.\n  \n    Also being able to buy clothes and things online without going into a brightly lit clothes store with loud music playing and having to communicate with shop assistants is such a relief.\n  \n    Anyway I was just thinking about how much better online shopping makes my life as an autistic person. When I thought I just had bad anxiety I used to try and force my self to go out and go to shops as exposure therapy even though it left me stressed and having meltdowns every time.\n  \n    I guess the only bad thing about online shopping is sometimes it does make it too easy to buy things and I can’t really afford to buy too much.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 91,
            "title": "How do you Feel about having Specific Strong Convictions? ",
            "link": "https://www.reddit.com/r/autism/comments/1d3i259/how_do_you_feel_about_having_specific_strong/",
            "votes": 10,
            "comments_count": 17,
            "created": "2024-05-29T17:41:00.803000+0000"
        },
        "body": "Here’s my biggest shtick: I literally… cannot stand or understand… the usage of the n-word.\n  \n    Ever since I was a toddler, my day was ruined every time I hear/see someone of drop the n-word (I am black for reference). It rattles my being. Why do you have to say that word? Why do you have to say something so historically dehumanizing and play it off as a joke? Why do you get positive attention for it? And why am I almost always the weird one for telling people to stop saying it?\n  \n    I see it everywhere on the internet because people think it’s cool to say nowadays. It makes me wish I could beat them up, and I have never seriously put my hands on anyone.\n  \n    I don’t believe myself to be morally superior at all. I just never understood how peoples’ minds can seem devoid of basic morals/decency and it drives me crazy.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 92,
            "title": "Is getting a diagnosis worth it?",
            "link": "https://www.reddit.com/r/autism/comments/1d3q8fa/is_getting_a_diagnosis_worth_it/",
            "votes": 3,
            "comments_count": 3,
            "created": "2024-05-29T23:45:37.142000+0000"
        },
        "body": "A few years back, my psych at the time had me to a questionaire to see if I had autism. He said I do (mild to moderate), but I'd have to go through a long expensive process to get formally diagnosed, along with the fact that in the state of Texas they don't treat autistic folks and the mentally unstable the best. Which I know to be true because I have other mental health issues on top of it due to trauma (schizoaffective and CPTSD are the only ones I'm willing to mention).\n  \n    I kinda want a diagnosis to get on disability on top of my current diagnoses because working is super hard for me due to my mental health issues and right now I'm a stay at home mom, but in the same breath, I also want to get my degree in graphic design so I can make something of my life and provide for my family.\n  \n    Another issue is I kinda don't want to get diagnosed because I feel like it's just another label to add to the 3487234986342986432+ things wrong with me.\n  \n    Is it also bad I let people know I'm autistic and because of it I have trouble communicating and what not? Or because I don't have an official diagnosis I don't have a right to?\n  \n\n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 93,
            "title": "New Discord Server",
            "link": "https://www.reddit.com/r/autism/comments/1d3suw3/new_discord_server/",
            "votes": 2,
            "comments_count": 4,
            "created": "2024-05-30T01:56:41.494000+0000"
        },
        "body": "Myself and friends have created a server by autistic people for autistic people.  If you would like to join, the link is below.  We are determined to make this a safe and welcoming community.\n  \n    Please let me know if the invite link expires, I will do my best to get a new link to you as soon as possible.\n  \n    Thank you\n  \nhttps://discord.gg/DPgQTYhH\n\n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 94,
            "title": "Does anyone struggle with how people feel about you?",
            "link": "https://www.reddit.com/r/autism/comments/1d3j3o8/does_anyone_struggle_with_how_people_feel_about/",
            "votes": 8,
            "comments_count": 3,
            "created": "2024-05-29T18:23:56.961000+0000"
        },
        "body": "Romantically, it took me at least a year and a half to even consider someone as a potential partner. For me and the men I was with, this was never a problem. But my issue is that I always think they don't care. So I would leave, only to realize later that they did care and I was unaware. I know this, and I've tried to be aware of it, but it's hard. Really hard. I still go back and forth, wondering if these people actually care or like me. but somehow it protects me from being taken advantage of. Like I know I can be naive so I would rather not assume positive income\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 95,
            "title": "What happens when you meltdown completely?",
            "link": "https://www.reddit.com/r/autism/comments/1d3pwc7/what_happens_when_you_meltdown_completely/",
            "votes": 3,
            "comments_count": 1,
            "created": "2024-05-29T23:29:29.693000+0000"
        },
        "body": "My whole life, up until I was 18 (24M) If I had a meltdown around my family I would tend to punch myself in the head, NOT AS SELF HARM, it would just be an instant reaction and I couldn't help it. I did this once while working at an Arby's around one of my co workers in the kitchen and I sadly lost my job that time...Good thing I don't do this often or out in public anymore at least. So far it's been 4 years since I've done this, which I am proud of.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 96,
            "title": "Is this a normal sensory issue?",
            "link": "https://www.reddit.com/r/autism/comments/1d3wk9o/is_this_a_normal_sensory_issue/",
            "votes": 1,
            "comments_count": 1,
            "created": "2024-05-30T05:24:43.992000+0000"
        },
        "body": "I’ve had this experience quite a lot and I’m unsure how to describe it. It’s like an internal thing often in my jaw or forearm and hands. It almost feels like the tiny blood vessels in all the muscles are tight or something. The muscles themselves aren’t contracted or anything but it’s a tightness type of feeling I guess. Stretching the area tends to temporarily stop the sensation but it comes right back after. It almost tingles. Can anyone relate to this or is it unrelated to my autism?\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 97,
            "title": "Anyone else HATE being told off? Like really hate it?",
            "link": "https://www.reddit.com/r/autism/comments/1d3nqb0/anyone_else_hate_being_told_off_like_really_hate/",
            "votes": 4,
            "comments_count": 4,
            "created": "2024-05-29T21:52:10.698000+0000"
        },
        "body": "I know that nobody likes being told off however even if I'm gently told off by a teacher in school, I just melt down and start uncontrollably crying. People have told me to get over it but every time I try, I just can't! Is this an autism thing?\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 98,
            "title": "For my teenager - noise cancellation headphones",
            "link": "https://www.reddit.com/r/autism/comments/1d3eamm/for_my_teenager_noise_cancellation_headphones/",
            "votes": 14,
            "comments_count": 23,
            "created": "2024-05-29T15:00:35.520000+0000"
        },
        "body": "Any recommendations for a brand or type you use? And why? She’s needing a pair to help with her sensory and surroundings. Getting into high school and around public areas more often with clubs and friends, etc…. She would like a pair. Maybe a pair that isn’t as bulky or noticeable? She’s worried people will “see them and know” but the idea of making the environment around her more quiet would be amazing.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 99,
            "title": "Does anyone else have issues with their gender",
            "link": "https://www.reddit.com/r/autism/comments/1d3pp9q/does_anyone_else_have_issues_with_their_gender/",
            "votes": 3,
            "comments_count": 6,
            "created": "2024-05-29T23:19:55.646000+0000"
        },
        "body": "I recently got diagnosed with ASD and my provider asked about gender and how it works. I am male, but my imagination and inner voice is female. In addition to that my comfort clothes are sport bras and one piece swimsuits. Wearing stuff like that give my body the same response as a weighted blanket. With all that being said, I don't have a desire to transition, but I do have days where I can transform into a different person to understand the world better.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 100,
            "title": "I am now a level 1 autistic ",
            "link": "https://www.reddit.com/r/autism/comments/1d3f7nk/i_am_now_a_level_1_autistic/",
            "votes": 12,
            "comments_count": 11,
            "created": "2024-05-29T15:39:33.134000+0000"
        },
        "body": "I just received the results of my psych evaluation and it says level 1. I low-key feel relieved in that all of my difficulties weren't character issues. It would've helped if my mom saw the signs early.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 101,
            "title": "Autism and interrupting/talking over people",
            "link": "https://www.reddit.com/r/autism/comments/1d3g9l1/autism_and_interruptingtalking_over_people/",
            "votes": 10,
            "comments_count": 19,
            "created": "2024-05-29T16:24:26.176000+0000"
        },
        "body": "Does anyone else have a hard time trying to not talk over people or knowing when it’s their time to speak in a conversation? I’ve always struggled with this and I don’t do it intentionally, but people used to call me “rude” and “ignorant” whenever I interrupted or spoke over people during conversation even though I didn’t know when it was the right time for me to talk. When people do it to me it’s not a problem and I’m often ignored or left out of conversation, but when I do it (unintentionally) I’m labeled as “rude”, “ignorant”, “impolite”, or even an “asshole” sometimes, especially when I was younger. I try not to do it anymore, especially in group conversations, but it still happens from time to time. I even politely allow people to finish what they say after interrupting them by mistake. People usually don’t do this to me in return and that’s one of the reasons I hate group conversations, because somebody’s always talking over somebody, nobody is polite or apologizes after interrupting or allows you to continue during conversation, and they think what they say is more important than what you have to say. I don’t like socializing in general but group interactions piss me off a lot, so I always prefer talking to one single person over a bunch of mfs who won’t let you speak your mind for more than two seconds.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 102,
            "title": "I achieved something I never thought I could!",
            "link": "https://www.reddit.com/r/autism/comments/1d3rwhw/i_achieved_something_i_never_thought_i_could/",
            "votes": 2,
            "comments_count": 3,
            "created": "2024-05-30T01:08:19.661000+0000"
        },
        "body": "Honestly I just need to talk about this because no one in my school wants to talk to me. In my school we have a yearly talent show and last year I sang with an old group of friends,(that I later learned were secretly ableist) in which I learned that I disliked singing with others. So this year I decided to sing one of my favorite songs as a solo. This song is called “The Ballad of Jane Doe” from a musical called Ride the Cyclone. The song is very high pitched and a bit difficult but I decided to sing it because I hate being underestimated (especially in singing because I am self taught). I ended up hitting all the notes but sadly with three minor mistakes which irritated me but I think I still did well! Unfortunately, due to my reputation for being weird, a very small amount of people actually complimented me (my school is EXTREMELY small) but I had a friend who paid attention to other’s reactions to tell me later. I honestly always had stage fright so hitting such high notes by myself and without any fidgets, is a huge accomplishment for me! Thank you for reading if you did! :)\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 103,
            "title": "Four year old diagnosed level two",
            "link": "https://www.reddit.com/r/autism/comments/1d3rsqn/four_year_old_diagnosed_level_two/",
            "votes": 2,
            "comments_count": 4,
            "created": "2024-05-30T01:03:00.853000+0000"
        },
        "body": "Hello, my four year old son was just diagnosed with level two autism with moderate to severe speech impairment. The psychologist also said he exhibited high IQ traits and hyperlexia. Was wondering if any adults here received a similar diagnosis as children and how it has impacted your life. I'm wondering what the future may hold for him.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 104,
            "title": "How do I fix problems with my tone?",
            "link": "https://www.reddit.com/r/autism/comments/1d3k1sb/how_do_i_fix_problems_with_my_tone/",
            "votes": 6,
            "comments_count": 2,
            "created": "2024-05-29T19:04:37.610000+0000"
        },
        "body": "Asking for some advice here since most of my research has bought me to reassurance that it isn't my fault and that I need to communicate with people to ask them to be patient with me, and although I do appreciate this, I feel as though it isn't realistic to how the world works and how my personal experiences have gone.\n  \n    I have repeatedly had issues for most of my life with people often thinking I am being snarky or condescending when I try to tell them why they have upset me or think I am being dismissive and back handed when responding to their issues with me. It has become extremely frustrating having people think that I am saying something to be malicious and backhanded instead of just taking what I'm saying literally.\n  \n    I appreciate that these experiences just come with the condition, however, I also have BPD and it has become extremely draining and triggering repeatedly getting into arguments and not understanding what it was that I said that caused it. People won't explain to me what I did wrong other than my \"tone\" but I don't fully understand what that means anymore and have no idea how to fix it to avoid anymore conflicts.\n  \n    Does anyone have any advice on how I can learn to speak in a way that isn't misread or at least approach social situations in a better way to avoid saying something that could upset someone?\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 105,
            "title": "How to survive school?",
            "link": "https://www.reddit.com/r/autism/comments/1d3mxhb/how_to_survive_school/",
            "votes": 4,
            "comments_count": 2,
            "created": "2024-05-29T21:15:24.434000+0000"
        },
        "body": "So school starts in a few days and im pretty scared i have been staying up all night trying too look for the best tips when you have no accommodations as im currently undiagnosed my appointment is in 2 weeks but this is only the first talk so i will have to survive longer as 2 weeks and till the next holiday there aren’t any special days so no break for 2 months straight. I’m currently very stressed about this because i get overwhelmed pretty easily and school is hell for me. I’m currently using loop earplugs but i hate the feeling of earplugs i have asked teachers to wear my headphones i have had some teachers say yes but most of the time im not allowed. when it gets too overwhelming i normaly just shutdown and sometimes go nonverbal. I struggle with school a lot because im very sensitive to sound. at home i always wear headphones and when something is overwhelming i can just wear them but in school i don’t have a choice and it’s really stressing me out.\n  \n    Does anyone have any tips?\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 106,
            "title": "Relationship Advice Needed:",
            "link": "https://www.reddit.com/r/autism/comments/1d3lbe4/relationship_advice_needed/",
            "votes": 5,
            "comments_count": 3,
            "created": "2024-05-29T20:00:05.275000+0000"
        },
        "body": "I’ve been on two dates with this guy who I’ve been friends with for two years. He’s 21 and I’m 31, though my therapist says she’s not that concerned about the age difference with my diagnosis in mind.\n  \n    The guy I’ve been on dates with is super sweet. We went on two dates in May. We have another date planned in June. We’re both Autistic and except for the two weeks before I got off work for the summer when I was really busy, we’ve been texting a lot. So far, I like what I see. We have a lot of commonalities and a lot of differences as well in our hobbies. He’s so kind, sweet, easygoing, and understanding. His manners are amazing. I had always dreamed about meeting someone who pulls my chair out for me and holds the door open for me.\n  \n    Yesterday, we had a really bad storm early in the morning that caused tons of damage in several cities. He texted me to make sure I was ok. It warmed my heart and honestly, I feel like he stole a piece of my heart that day too.\n  \n    He’s all in, but I told him I want to go slow and not label what we have yet. I’d really like to be exclusive, but I want to keep in mind that before this, we were friends, and I’d hate if we break up to never be friends again. This is my first relationship. So, my question is, at what point is it good to label a relationship and decide if I want to be something more?\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 107,
            "title": "Do you think the character of Sheldon Cooper in the Big Bang Theory is an accurate representation of someone who is autistic? ",
            "link": "https://www.reddit.com/r/autism/comments/1d3vpyr/do_you_think_the_character_of_sheldon_cooper_in/",
            "votes": 0,
            "comments_count": 8,
            "created": "2024-05-30T04:31:28.980000+0000"
        },
        "body": "It is never explicitly mentioned in the show that he’s autistic but he shows most or all of the most common autistic traits. Some of these include his difficulty understanding sarcasm, difficulty understanding social cues, difficulty understanding other people’s point of view, adherence to a strict routine, and sensitivity to temperature changes.\n  \n    He also only has coitus with his girlfriend Amy (later his wife) once a year on her birthday. Does the fact that they only have sex once a year have to do with his autism? Is there a link between autism and reduced libido? Do the people in this group feel he represents autism accurately?\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 108,
            "title": "Special Interest Poll",
            "link": "https://www.reddit.com/r/autism/comments/1d3va18/special_interest_poll/",
            "votes": 1,
            "comments_count": 7,
            "created": "2024-05-30T04:06:02.044000+0000"
        },
        "body": "Stereotypically, and it seems like statistically, tech related special interests are the most common among autistic people. But I am a natural-born data collector. I would love to gather some real world data.  And I always feel like I'm an oddball even among autistic people. So, it'd also be nice to know that I'm not. But either way...\n  \n    You may not fit into one specific category. For example, for me, as far back as I can remember, I was obsessed with anything creative. From the time I could hold a pencil or paint brush... Drawing, painting, sculpting, carving... anything I could get my hands on. But I was also taking things apart to see how they worked - Radios, computers, cell phones, remote control cars, etc. I like to create and invent things that are both beautiful and functional. I also love writing and literature. I'm also obsessed with science - especially neuroscience, psychology, and physics.\n  \n    So I know, like me, not everyone will fit neatly into one category, but try to pick the best primary category. And feel free to explain /expound in the comments.  This list is by no means exhaustive, but I've tried to encompass most possibilities into these few specific categories.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 109,
            "title": "why am I suddenly mute in one situation but then randomly can talk freely when I want to?",
            "link": "https://www.reddit.com/r/autism/comments/1d3v3iy/why_am_i_suddenly_mute_in_one_situation_but_then/",
            "votes": 1,
            "comments_count": 7,
            "created": "2024-05-30T03:56:08.926000+0000"
        },
        "body": "Like I tried making videos today and in This one I'm barely talking. but in this one I can talk freely?! Annoys the hell out of me. is it the number of people? this annoying me.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 110,
            "title": "Mental war about Medicaid",
            "link": "https://www.reddit.com/r/autism/comments/1d3v25v/mental_war_about_medicaid/",
            "votes": 0,
            "comments_count": 1,
            "created": "2024-05-30T03:53:53.225000+0000"
        },
        "body": "Hey there, I'm a proud dad to my 3 year old son with the tism! He is high functioning, I'd say level 1, a genius-to-be, semi-verbal with current inability to communicate verbally. He only echoes, but the amount of things he echoes is crazy, sometimes being entire 20 minute episodes of Elmo. Anywho, he is very independent, as long as things are in his reach, he can go hours without anyone at his side. He plays alone, never seeks praise, just is in his own little world (big world in his head, I think. I imagine in his head he sees so many shapes, letters, colors, numbers, nursery rhymes, animals, dinosaurs, etc, I feel like it's likely nonstop as he literally NEVER stops \"talking\"). As for myself, I'm a nurse dad. I make a great living. I'm very proud of my son, and I don't hide his ASD from anyone #noshame. I'm a go-getter, I love challenges and am very headstrong, quitting is never even close to option for me. I'm burdened by being a perfectionist, and I'm also burdened by being a \"fixer\" due to my personality. I'm extremely competitive, I take on leadership roles naturally, am very calm, leveled, calculated during high stress situations (such as people dying, dangerous environments, etc). All of this to say, I'm admittedly stubborn at times, but also open-minded and considerate as well. Overall, I pride myself on being a family man that can do anything I put my mind to and will do anything I have to do no matter the difficulty for the ones I love, including my son. Now you know a little about me so as to have a go with my issue. Now, the dilemma. Medicaid. Them calling my son disabled if I apply for it. My wife has had the moms on her pages tell her Medicaid helps with ASD and getting things done in regards to therapies and what not. I applied for it, and in doing so, had to choose the \"disabled child in home\", as we're over income for the rest of them, including SSI. Again, I don't want SSI or a check written to me. I want what's best for my son. We have United Healthcare through my job, but I've heard that Medicaid is better when it comes to ABA and other therapies. Plus having him declared disabled opens avenues through the state. But I'm not entirely ok with having him called disabled by the government. I don't see him as disabled. He has some shortcomings, as do we all. I plan to help him past them, as I would my NT child. Also, the government requires full access to his medical record. I'm not ok with that either. That's MY son's privacy, not Uncle Sam's. His diagnosis should be enough, not his entire medical record and ongoing. It's like for the government to help for something they likely caused (don't get me down that rabbit hole), I have to sign over custody to them AND have them title my child as disabled. Of course, I understand that disability is a broad term covering physical, mental, intellectual, etc, but in my mind he is none of those. He's a toddler that has quirks and has complications that are resolvable or atleast adaptable. And he's only 3, for all I know, some or most of this will change for the better as he gets older and smarter. Some will say, \"just get over it, they can call him something but that doesn't mean he is, just ignore it to get what he needs, you said you'd do anything for his betterment\". Yes. But again, I'm confrontational when it comes to injustices and things that aren't right. I can't just sit by and allow a wrong to happen, even if it's \"for the better good\". I'm the guy that tries to find the alternative route to the better good without the wrong being an option. Idk, as you can see, it's created quite the internal dilemma in me. I want my son to have Medicaid if it will help him, but I also don't want him to be called something that he's not, and I also don't want his privacy invaded, as it's MY job to protect that for him as his father. I think I even feel as though having him declared disabled is declaring defeat, submitting to autism, failing him as a parent, like I'm giving up, conceding my child's well-being to the government. But then again maybe it's not permanent, just a temporary declaration to better arm us for the road to helping him adapt to this world. I'm heavily conflicted on it the more I think about it. Perhaps you think it's stupid, you wouldn't worry about it. Maybe it is. It's not affecting me negatively, I'm not depressed or bummed out. It's just on my mind, especially when I look at the Medicaid packet they sent for me to fill out. My mind went to storming about it while I hesitatingly browsed through the packet. Red flags were shooting around my brain telling me I should burn it, buckle up and find a different way without the gov holding my hand. But what a little assistance going to hurt? It's not admitting failure, but more so just getting some help. But I don't need help at that cost that I'm hung on. Mental war. Have any dads or even moms felt this way before? Any relations to my venting? Perhaps no one understands what I'm feeling here. I'm admittedly an odd cookie, but a prideful, determined, steadfast one at that, a protective papa bear! Thanks for reading this far. Anywho, keep up the great work moms, dads, brothers, sisters, fam, therapists, friends, and you all with ASD. I love you all, and I'm proud of everyone for pushing through everyday. Little victories and major victories, they're all wins. We just have to do better tomorrow than we did today. I'm sure trying. Just keep being awesome🤘🏼😎 I'll probably just put my pride aside and do the app because it's what my wife wants and I want to ease her worries and mind, and it's likely what's best for him in the long run. Still doesn't help how I feel inside about it. It's just my personality and unfortunately at times like these, how my mind works. Thanks again! Have a great Friday-Eve😬\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 111,
            "title": "What affordable Graduation gift to buy my Autistic teen who doesn't show interest in much...",
            "link": "https://www.reddit.com/r/autism/comments/1d3jzlp/what_affordable_graduation_gift_to_buy_my/",
            "votes": 5,
            "comments_count": 8,
            "created": "2024-05-29T19:01:53.642000+0000"
        },
        "body": "If I'm in the wrong sub, please let me know.\n  \n    He has outgrown gaming. His Nintendo switch, tablet, and PlayStation sit in the corner collecting dust. He doesn't even watch TV much unless it's funny videos. He spends all of his free time on his phone (TikTok, YouTube etc). He doesn't care about fashion, he'll wear the same thing every day if you let him. Doesn't have any friends or many family members his age, he is not much of a people person, so a party isn't really ideal. He doesn't like to watch or play sports and is not very outdoorsy.\n  \n    He is graduating from middle school and I have no idea what to get him that won't be added to the dust collected pile of previous gifts. We are poor but he is a good kid and I want to get him something nice but not too extravagant, especially if we're not sure he'll use it. We thought about taking him to the arcade but he did that last month for his birthday and was bored within an hour. Any suggestions would be appreciated.TIA!\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 112,
            "title": "I felt stupid during a driving lesson ",
            "link": "https://www.reddit.com/r/autism/comments/1d3ae6i/i_felt_stupid_during_a_driving_lesson/",
            "votes": 18,
            "comments_count": 15,
            "created": "2024-05-29T11:56:42.806000+0000"
        },
        "body": "I don't know what happened, like, the other day I was performing just fine but suddenly today my brain had like a f aneurism, I mistook the accelerator and the brake, going left with changing directions, at some point I stopped hearing what my instructor was telling me and couldn't function physically so I shut down (I think? I dunno if this is what it is) and the car did like a sudden stop. I hate roundabouts. I found harder to sense speed so I always felt like I was going too fast.. maybe due to the wind? It's true that I only slept like 5 hours, there was a really hot weather but I should be able to perform normally, right? Instructor said that I should get used to drive while eye strained (when I'm eye strained I feel like falling asleep at any moment) or hungry (I basically get aggressive and impulsive if I don't eat at my hours), I'm myopic btw. I also found him today to be not too chatty so I got nervous because I felt like he was either annoyed or disappointed at me. He must think I'm either stupid or crazy for acting like this when I was doing so well the other day. Am I f stupid? I feel so useless and I don't want to be a danger to anyone. I'm so scared because I don't know what happened? I had fun then other day so I wasn't stressed today when I started\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 113,
            "title": "Does anyone here not have that food issues",
            "link": "https://www.reddit.com/r/autism/comments/1d3nfc4/does_anyone_here_not_have_that_food_issues/",
            "votes": 3,
            "comments_count": 13,
            "created": "2024-05-29T21:39:28.347000+0000"
        },
        "body": "Hey all, just to preface this I am not diagnosed but My therapist says he is convinced I have autism / adhd and so am I.\n  \n    Well I am just wondering if anyone else here doesn’t struggle that much with food (but also sensory issues in general). Now, whilst I do struggle with sensory issues I find my struggles don’t seem as Severe as others. Mainly I have almost never struggled with food and in fact love trying new foods in fact I would even say it’s one of the things that brings me the most joy in life . Does anybody else have a similar experience?\n  \n    Also I find that when it comes to my sensory issues it is only very few incredibly specific textures, sounds or tastes which I genuinely struggle without otherwise I find I am mostly fine h. This has really got me confused because otherwise I tick almost all of the box’s for autism, any help is much appreciated.\n  \n    Sorry if this is a stupid question.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 114,
            "title": "anyone else feel like there's always someone watching and/or talking negatively about you?",
            "link": "https://www.reddit.com/r/autism/comments/1d3l9ro/anyone_else_feel_like_theres_always_someone/",
            "votes": 4,
            "comments_count": 3,
            "created": "2024-05-29T19:58:05.437000+0000"
        },
        "body": "or is that part of some other disorder i should probably get tested for?\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 115,
            "title": "My autistic cousin is incredibly racist",
            "link": "https://www.reddit.com/r/autism/comments/1d3n1v7/my_autistic_cousin_is_incredibly_racist/",
            "votes": 3,
            "comments_count": 5,
            "created": "2024-05-29T21:21:10.591000+0000"
        },
        "body": "I don’t know what happened during covid but after covid she just seems so much worse. It’s almost like she has ticks where she’ll say the most racist things incredibly loud in public. For example, there was an Asian cashier while we were shopping and she goes along the lines to essentially scream “I wish I could be an Asian woman so a white man would fetishize me.” And “I wish I was a skinny tiny Asian girl so I would be good enough for porn” I straight up walked out and I don’t know what to do anymore. I feel a somewhat responsibility to make sure she doesn’t feel left out but Jesus Christ what do I do\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 116,
            "title": "Loops earplugs have been my lifesavers ",
            "link": "https://www.reddit.com/r/autism/comments/1d3uf03/loops_earplugs_have_been_my_lifesavers/",
            "votes": 1,
            "comments_count": 1,
            "created": "2024-05-30T03:17:38.169000+0000"
        },
        "body": "Pretty much the title. I’ve tried other brands, but for my noise sensitivities the loop engage earplugs have been a godsend. I’ve also purchased the additional mutes/muffles (?) that add an additional 5db of noise suppression. I don’t like things in my ears and found them comfortable enough! Wondering if anyone has the switches, and what they think of them? They look a little bulky.\n  \n    I recommended them to my gc of folks with noise sensitivities but realized loops kinda hides referral/discount codes. I was given a referral link for 20% off, if anyone is interested.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 117,
            "title": "Audhd, Female, and incredibly bitter.",
            "link": "https://www.reddit.com/r/autism/comments/1d3hvlr/audhd_female_and_incredibly_bitter/",
            "votes": 6,
            "comments_count": 4,
            "created": "2024-05-29T17:33:12.067000+0000"
        },
        "body": "Something I’ve noticed in myself more and more lately after my unmasking journey began into my 20’s is that I’m so hateful and tired of people in general. NT’s can be awful and they’re exhausting to deal with.\n  \n    I find myself being just…. ladened with pure fury and rage due to the way I’ve been treated, never having my needs taken seriously because I “looked normal” being bullied out of school by my teachers when I was 15 because they just gave up on me instead of just…. Following the IEP that was written for me in the meetings…..??\n  \n    I was always hit with “you have so much potential, if only you would apply yourself” gosh… that sends me into a fit of rage even now.\n  \n    People just don’t understand and never will.. and that’s why it absolutely blows being an autistic woman with adhd too in chronic burnout with chronic pain and fatigue and all kinds of other things I can’t even think of right now because my mind is just laced with stress.\n  \n    Hope everyone is having a great day.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 118,
            "title": "I go to a lot of conventions, this weekend I was supposed to go to one fully dedicated to my biggest hyperfix of 4 years, plans fell through and I’m struggling to cope with it",
            "link": "https://www.reddit.com/r/autism/comments/1d3j6bf/i_go_to_a_lot_of_conventions_this_weekend_i_was/",
            "votes": 5,
            "comments_count": 2,
            "created": "2024-05-29T18:27:06.628000+0000"
        },
        "body": "I didn’t know where else to bring it up because I don’t think any other place would truly understand how gut wrenching it is for me\n  \n    I’ve been non stop about this interest for years and not being able to go and everyone I follow on Twitter is going is hitting me really fucking hard\n  \n    I don’t know what to do\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 119,
            "title": "Seeking Feedback on Designing a Website to Help Autistic Adults Meet and Socialize",
            "link": "https://www.reddit.com/r/autism/comments/1d3kmmh/seeking_feedback_on_designing_a_website_to_help/",
            "votes": 4,
            "comments_count": 2,
            "created": "2024-05-29T19:30:02.047000+0000"
        },
        "body": "I'm an autistic UX designer and event organizer who helps organize social opportunities for people on the spectrum in Philadelphia. I'm building a new website for autistic adults to RSVP to these events. I created a survey to gain input to ensure the website is accessible and user-friendly for everyone, as the current platform we use to post events, Meetup, has been causing us some issues.I greatly value your time and insights. As a token of my appreciation, all respondents who complete the survey will be automatically entered into a raffle for a chance to win a $20 Amazon gift card. Your feedback is crucial, and I thank you for helping me with this.Link to Survey here: https://merrimack.qualtrics.com/jfe/form/SV_0U1stl7BBLwtWqW\n\n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 120,
            "title": "Movies that resonate with you as an autistic person?",
            "link": "https://www.reddit.com/r/autism/comments/1d2t1z4/movies_that_resonate_with_you_as_an_autistic/",
            "votes": 290,
            "comments_count": 271,
            "created": "2024-05-28T20:06:06.765000+0000"
        },
        "body": "false\n      \n\n    The anime movie “Perfect Blue” has always resonated with me since I was 16, and I never knew why until I was diagnosed at 21! The concepts of having an “image” to satisfy the public and identity crisis as the main conflict in the movie are the exact same issues I’ve always struggled with as an aspiring performer who had long undiagnosed AuDHD.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 121,
            "title": "I can’t tell if i’m autistic or just a loser ",
            "link": "https://www.reddit.com/r/autism/comments/1d3e67n/i_cant_tell_if_im_autistic_or_just_a_loser/",
            "votes": 9,
            "comments_count": 7,
            "created": "2024-05-29T14:55:19.091000+0000"
        },
        "body": "I (16M) have always been kind of weird or not cool in school and in my social life. I often haven’t had many friends at all in school and i find it hard and tiring trying to make friends, so i just stay to myself. i think most people think im weird or a loser bc i barely talk and i dress punk/emo ish. I’ve been wondering for a while if i might be autistic or something bc ive felt like something isnt normal about me, and i often hear many autistic people to be similar in personality/mindset in a lot of things. I’ve tried to make friends but it seems like i can’t keep them because i prefer to be by myself, but i also do want to interact with people and not be a total outcast. I really enjoy certain things like video games, and when i get hyper fixated on some things it seriously consumes all of me until i get the thing o want, or im able to do that certain thing. recently i’ve been super hyper fixated on this video game i’ve been playing and it’s been making me wonder if im just a introverted loser who likes to stay to himself, or if there might be some tism there. i’m open to any questions!\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 122,
            "title": "I’m a “picky eater” and that’s a problem ",
            "link": "https://www.reddit.com/r/autism/comments/1d3ifbm/im_a_picky_eater_and_thats_a_problem/",
            "votes": 5,
            "comments_count": 10,
            "created": "2024-05-29T17:56:27.241000+0000"
        },
        "body": "This has been a nightmare for me in every social or economic aspect. Whenever a personal circumstance occurs where i go to a restaurant or an delivery from an specific place, it’s anxiety assured. Whoever has to get to hang with me, they know they can’t choose just any place or order any big meal if I have trouble with such specific food. And it’s a shame.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 123,
            "title": "My mom's coworker apparently thinks I'm a child.",
            "link": "https://www.reddit.com/r/autism/comments/1d2sy8g/my_moms_coworker_apparently_thinks_im_a_child/",
            "votes": 279,
            "comments_count": 45,
            "created": "2024-05-28T20:02:23.815000+0000"
        },
        "body": "\"Do you trust her driving your car?\"\n\n    This is something i heard my mom's coworker (who knows i have autism) say today, and it's been irking me all day.\n  \n    I was borrowing my mom's car to run some errands and was picking it up from her workplace. I heard her coworker quietly ask her this question just as i was walking out the door. I guess he didn't want me to hear that, but i did. I didn't engage but i got really angry.\n  \n    I'm a 27 year old woman, not a f***ing child. I've had a driver's licence for years and i haven't even been close to being in an accident. But i guess since i have autism i can't be trusted to operate a vehicle?\n  \n    I've been thinking about this all day. I try so hard to present myself as their idea of an \"upstanding normal adult\". I spend so much of my energy masking, and this is still how some people see me?  Like, he probably wouldn't even say this if he didn't know i have autism.\n  \n    Just wanted to vent some of my frustration about this. Honestly i feel like it shouldn't anger me this much, but it does.\n  \n    Rant over.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 124,
            "title": "I was born with two Y chromosomes and diagnosed with autism, anyone else have this?",
            "link": "https://www.reddit.com/r/autism/comments/1d3gulk/i_was_born_with_two_y_chromosomes_and_diagnosed/",
            "votes": 6,
            "comments_count": 6,
            "created": "2024-05-29T16:49:51.302000+0000"
        },
        "body": "I read that having XYY can make you have a higher chance of being autistic. Now let’s put all of the sensationalized media/television crap about it being the serial killer gene in the dumpster where it belongs. But when I tell people I have two Y chromosomes they do a quick Google search and bring up the serial killer thing, like they didn’t do any proper research.\n  \n    As soon as I got my genetic test results I thought we’ll shit no wonder why I am the way I am and my autism makes things much worse in terms of adapting to the norms of society such as driving, working full time, going to college, getting married, socializing and all that stuff people expect of you.\n  \n    I’m 29 and have only attempted driving once and let’s just say anytime you see someone on the road and say to yourself “that person should not be driving” well that person is me. My electric scooter suits me just fine but I noticed people really don’t like electric scooter folk.\n  \n    The older I get I realize life is just a game, (a proving ground) and everyone loves to play it, I don’t..\n  \n    Anywho I don’t know where I’m going with this, I’m just curious if there are others out there like me.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 125,
            "title": "Struggling with lack of recognition at work ",
            "link": "https://www.reddit.com/r/autism/comments/1d3lz4y/struggling_with_lack_of_recognition_at_work/",
            "votes": 3,
            "comments_count": 4,
            "created": "2024-05-29T20:29:11.589000+0000"
        },
        "body": "Basically the title, we have a board where we can write people’s names and then they get recognized and get some sort of reward like points (we have a shop where you trade them for items). Well last year I was put on the board but never received the points I was supposed to get. Everyone else did.\n  \n    Now I’m struggling because everyone else in my department has been put on the board for recognition except me. I literally changed my schedule to come in 2 hours earlier on Thursday and Friday because someone left and we needed the help and I never call out. And it just seems like whatever I do isn’t good enough to be recognized even though it’s the best work I can do.\n  \n    I don’t know I’m just feeling defeated, and like I don’t matter to my employer.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 126,
            "title": "I think I have autism but I’m too old to get tested/diagnosed",
            "link": "https://www.reddit.com/r/autism/comments/1d3agqf/i_think_i_have_autism_but_im_too_old_to_get/",
            "votes": 13,
            "comments_count": 25,
            "created": "2024-05-29T12:00:33.328000+0000"
        },
        "body": "I don’t even know anymore, all of the stereotypes and things autistic ppl get linked with are relevant to me and I am like 98% sure I have autism.\n  \n    I asked my mom, who knows a bit about it since she deals with some autistic children at her work and she says that these symptoms usually come in childhood and what I think I have is not real.\n  \n    Yet all of the stuff are suddenly appearing (or I am now just realizing them) I have a hard time making friends and making a friendship last, I avoid eye contact and I am too aware of me doing it that I sometimes force myself but it’s just way too uncomfortable and weird. I have a couple of special interests, the most prominent are random cool fun facts about literally anything, guitars (or generally musical instruments, including the use of vocals and such) and the afterlife and how every different religion views it. I stim, alot and can’t change my routine as easily. I’m going to list an example but it might be a bit weird/unhygienic so bear with me, I shower once every two days for example because no one told me better and when my mom found out she began making me take showers more, like twice a day and I hate it. I am trying to change my routine but it’s way too hard for me.\n  \n    And some honorable mentions: I am too picky of an eater, I hate everything that is unfamiliar, I can’t eat with big spoons or small forks and I prefer to eat everything in a bowl. Sometimes noises get too loud or too repetitive and I need to shut my ears or silence it and that helps me somehow.\n  \n    Any thoughts on how I can get diagnosed?\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 127,
            "title": "For those who struggle with sarcasm/irony. Here's a tried a true video to explain",
            "link": "https://www.reddit.com/r/autism/comments/1d3s6ec/for_those_who_struggle_with_sarcasmirony_heres_a/",
            "votes": 1,
            "comments_count": 1,
            "created": "2024-05-30T01:22:06.646000+0000"
        },
        "body": "It's somewhat ironic within the video itself but it's helped a number of friends of mine on the autism spectrum understand irony and sarcasm better (including myself)\n  \nhttps://youtu.be/nsuSveDAlpI?si=xOZ5sPJBvtssvQPe\n\n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 128,
            "title": "I am so fucking overwhelmed i cant",
            "link": "https://www.reddit.com/r/autism/comments/1d3c29w/i_am_so_fucking_overwhelmed_i_cant/",
            "votes": 9,
            "comments_count": 4,
            "created": "2024-05-29T13:21:39.215000+0000"
        },
        "body": "I just recently learned what a autistic burnout is and holy shit i am having a bad one. i cant even watch a 15 min youtube video of people explaining what to do when having a autistic burnout in one sitting. on the other hand i am relieved that whats happening to me is somewhat normal and i can communicate it better to the other people around me e.g. send them article and videos of whats going on whit me.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 129,
            "title": "What are some ways of going about being blunt, yet respectful?",
            "link": "https://www.reddit.com/r/autism/comments/1d3n8fq/what_are_some_ways_of_going_about_being_blunt_yet/",
            "votes": 2,
            "comments_count": 9,
            "created": "2024-05-29T21:30:09.873000+0000"
        },
        "body": "Let’s say you pull through the line where you work and X coworker pretends to give you your drink then pulls it back in a teasing way. They do this twice, successively. You’re not having a great morning due to other things. The initial reaction is, “give me the damn drink, you’re being annoying.” But you are 5+ years older then this person (they are early 20’s) and you don’t want to come across as harsh or irritated by something trivial. You know they are doing something immature and it’s playful. They are looking for a reaction.\n  \n    5 types of responses I though of:\n  \n    “You are being annoying. Give me my drink.”\n  \nplayful assertive “Give me the facking drink, NOW.”\n  \nsarcastically “C’mon you can do it, I know you can.”\n  \ncalmly playfully “Oh ok, I see how it is. You wanna play this game.”\n  \n    “You know what? I am not having the greatest morning right now and am not in the mood to joke around. Maybe try and tease me next time.”\n  \n    Curious as to what you think of these responses and or what type of responses you can come up with.\n  \n    Bonus: after this exchange, they ask if what they were doing was funny, what do you say?\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 130,
            "title": "Looking for shoe advice - hot feet/hates confinement ",
            "link": "https://www.reddit.com/r/autism/comments/1d3ry0t/looking_for_shoe_advice_hot_feethates_confinement/",
            "votes": 1,
            "comments_count": 2,
            "created": "2024-05-30T01:10:22.781000+0000"
        },
        "body": "Looking for advice on shoes, my kid hates wearing socks because of how they feel. He hates feeling like his feet are confined and get really hot, but does okay with crocs. Any suggestions that may help? Eventually will need running shoes or shoes to wear generally around, and trying to find something that has better foot support but still comfortable and not causing him to be uncomfortable.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 131,
            "title": "Trust and (well-meaning) lies.",
            "link": "https://www.reddit.com/r/autism/comments/1d3rqml/trust_and_wellmeaning_lies/",
            "votes": 1,
            "comments_count": 2,
            "created": "2024-05-30T01:00:12.997000+0000"
        },
        "body": "I don’t understand why, if you value trust in that relationship, why you’d lie and risk that? A lie is still a lie, I can’t help but see it as an unintended demonstration that you’re willing and able to lie to my face, it doesn’t matter the purpose.\n  \n    I value trust more than anything else in my relationships, and I’ve been having serious difficulty trusting my friends lately. I struggle with understanding what other people are saying/implying and their intentions, so I DEPEND on integrity-based trust and  trusting that people mean what they say. Because of those lies, it’s hard for me to trust in what they have to say. Every potentially well-meaning lie feels like it takes a point away from their integrity. Then they’ll be frustrated with me for not trusting them. Well… I’m not the one lying. Idk, I’m really frustrated. I don’t get how someone expects me to trust what they say, but will lie anyway??? The intention behind the lie doesn’t mean SHIT to me anymore. I don’t have the energy for it anymore. Tired as hell.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 132,
            "title": "Any coders/developers here? ",
            "link": "https://www.reddit.com/r/autism/comments/1d3hojo/any_codersdevelopers_here/",
            "votes": 4,
            "comments_count": 7,
            "created": "2024-05-29T17:24:56.314000+0000"
        },
        "body": "My Autistic son (27) has completed a 15 week full stack Python course, and finished 80% of a 12 week Javascript course. (Didn't complete the terminal project because he hated the library.) He finished the Python course three years ago. His instructors said he was an excellent coder, and he loves doing it.\n  \n    He's interested in back-end and AI.\n  \n    I know zero about coding, and have no contacts in the field.\n  \n    He's been unable to find a job. He had a few information interviews, but no real interviews. He has a LinkedIn account and has posted his classwork on github.\n  \n    He's not a self-starter, and needs to be given an assignment. His github is thin, because he doesn't know what to do.\n  \n    How can I help him find work in IT or development or anything computer related?\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 133,
            "title": "Parents and caregivers of autistic children - breaks, support, and respite care",
            "link": "https://www.reddit.com/r/autism/comments/1d3himh/parents_and_caregivers_of_autistic_children/",
            "votes": 4,
            "comments_count": 2,
            "created": "2024-05-29T17:18:10.031000+0000"
        },
        "body": "Hello everyone,\n  \n    I am a PhD student studying respite care for families of autistic children.  Respite care is a support service to provide breaks from caregiving. If you provide care to a child age 2-18 with an autism diagnosis, and would like to help advance research, please consider taking this survey. You do not need to currently have access to respite care to participate, a diversity of experiences and voices are welcome and appreciated.\n  \n    Hello parents and caregivers,\n  \n    My name is Valerie Senkowski, and I am a PhD student in the department of Educational Leadership at Miami University. I am conducting a study for my dissertation research on parents' use of respite care for children on the autism spectrum. I would greatly appreciate it if you would assist me by participating in this research study. This survey will take approximately 15 minutes to complete. All of your responses will be anonymous. Completion of the survey is voluntary. You must be above the age of 18 and a parent or legal guardian of a child ages 2-18 with an autism diagnosis in the United States to participate.\n  \n    The possible risks or discomforts of the study are minimal, although you may feel some stress or anxiety answering some of the questions about private matters. For every survey completed, a $1 donation will be made to support Pause for Parents, Play for Kids, a nonprofit organization which serves special needs children and their families. \n  \n    If you have any questions about the study, you can contact me at senkowvm@miamioh.edu, or my faculty advisor Dr. Paul Branscum branscpw@miamioh.edu.\n  \n    Thank you for your time. Please click the link below to participate. \n  \nhttps://miamioh.qualtrics.com/jfe/form/SV_egrPPcHRDlJ3Olw\n\n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 134,
            "title": "Should I speak to my family doctor (Canada) about getting diagnosed?",
            "link": "https://www.reddit.com/r/autism/comments/1d3he3d/should_i_speak_to_my_family_doctor_canada_about/",
            "votes": 4,
            "comments_count": 9,
            "created": "2024-05-29T17:12:47.721000+0000"
        },
        "body": "I know the answer is probably yes I’m autistic but it’s kinda driving me crazy not knowing, I just want to be able to say yes, this is it, diagnosed autism, I’ve heard it can take a while to get tested but I just really need to know, so should I talk to my family doctor or is there someone else I need to speak too? I don’t have a therapist or anything like that\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 135,
            "title": "Investigating Psychological Safety Levels in Autism and ADHD [Mod Approved] ",
            "link": "https://www.reddit.com/r/autism/comments/1d3e99h/investigating_psychological_safety_levels_in/",
            "votes": 6,
            "comments_count": 1,
            "created": "2024-05-29T14:59:03.152000+0000"
        },
        "body": "Link here - https://hass.eu.qualtrics.com/jfe/form/SV_2sJ7mvDo6eTCzUW\n\n    I am researching psychological safety levels in Autism/ADHD as part of my master's dissertation project. This is an Autism/ADHD led project in collaboration with clinical psychologists. I am happy to share findings and hope some of you will participate. The survey is anonymous and takes 10-15 minutes to complete.\n  \n    We feel this research is imperative to providing better mental health support to our community. Ethical approval by Strathclyde University SEC.\n  \n    Thank you!\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 136,
            "title": "PhD programs with autism research focus ",
            "link": "https://www.reddit.com/r/autism/comments/1d3mgk1/phd_programs_with_autism_research_focus/",
            "votes": 2,
            "comments_count": 1,
            "created": "2024-05-29T20:52:35.026000+0000"
        },
        "body": "Not sure if anyone on this form can help me but i figured its worth a shot bc i’m rlly lost here!\n  \n    I'm an autistic undergrad looking for PhD programs with a focus on autism research. I am specifically interested in autism in adults/emerging adults or adolescents, the study of suicidality, and the co-occurrence of personality disorders and psychotic features with ASD. I'm having a hard time locating programs that have a researcher focusing on this area. The only person I've come across focusing on autism in adults is Laura Klinger at UNC Chapel Hill.\n  \n    I am open to exploring PhD programs in autism studies in any area of study focusing on this area of research. I am NOT looking for an ABA-focused program or a school psychology program.\n  \n    Any help or guidance is so so appreciated\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 137,
            "title": "Had a wreck, struggling to mask ",
            "link": "https://www.reddit.com/r/autism/comments/1d3rawl/had_a_wreck_struggling_to_mask/",
            "votes": 1,
            "comments_count": 5,
            "created": "2024-05-30T00:38:04.058000+0000"
        },
        "body": "So I had my first wreck, no one is hurt but my car is all damaged. The other vehicle didn't even stop. But I had a major meltdown after, and now I'm struggling to mask at all. I can't regulate my tone to add the right inflictions, I can't quit Stimming, I'm shaky, I can't quit hitting my head and biting myself, I can't force eye contact, I'm struggling verbally (I already ahve problems with going nonverbal).\n  \n    I have work tomorrow, how the heck am I supposed to mask and seem neurotypical while I deal with customers??? I can't afford to take the day off.\n  \n    I just need advice. It took forever to even type this up.i just need help\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 138,
            "title": "Is it normal to have \"exaggerated\" emotions?",
            "link": "https://www.reddit.com/r/autism/comments/1d3jfan/is_it_normal_to_have_exaggerated_emotions/",
            "votes": 3,
            "comments_count": 1,
            "created": "2024-05-29T18:37:45.471000+0000"
        },
        "body": "I feel like I become easily sad for things that may seem not that big of a deal. I'll go more into detail in this post.\n  \n    I have a close friend I talk to most of the time. Since private matters got both of us, some conditions developed that don't allow us to talk as much as we did previously. Now we only talk during weekends, but I expect that to change for the better for a period of time during the summer. The thing with this is that I feel lonely simply for the fact that I can't talk with them as much as I did before. I felt the same with previous \"friends\" who would actually talk with me only a few times. They're the only true friend for me, and I understand that we are both busy during different times, but it makes me sad when I can't talk with them due to this.\n  \n    Now, I have this colleague who I seem to get along with because of similar ideas that we both have. The problem is that whenever they're frustrated for something which I'm able to do pretty easily, they tell me to shut up. When that happens, I'm frozen because I feel offended, sad and angry at the same time. \"How can you tell me to shut up when we both manage to get along easily?\" is what I think during that time.\n  \n    Is this normal for a neurodivergent person to happen?\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 139,
            "title": "How are your sims/webkinz/puffles/neopets doing in this moment?",
            "link": "https://www.reddit.com/r/autism/comments/1d3jeo9/how_are_your_simswebkinzpufflesneopets_doing_in/",
            "votes": 3,
            "comments_count": 5,
            "created": "2024-05-29T18:37:03.179000+0000"
        },
        "body": "Genuinely havent thought about some of these games in years but I just got kinda sad at the thought that all my Webkinz have been starving for 15 years\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 140,
            "title": "I have autism and adhd. My friend took some of my adderrall medication and started getting really flirty with me?",
            "link": "https://www.reddit.com/r/autism/comments/1d3r8aa/i_have_autism_and_adhd_my_friend_took_some_of_my/",
            "votes": 1,
            "comments_count": 2,
            "created": "2024-05-30T00:34:22.971000+0000"
        },
        "body": "So I’m 21M and we’ve been friends a long time he’s also 20. He’s never really taken any drugs before so he tried one of my adderall. After he took it he started changing a lot I think it may have been too high of a dose for his first time. We started flirting alot which was strange and the night was strange. Is this odd for people to act like that after taking this medication? He seemed to have really really loved it so wants more\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 141,
            "title": "Saliva Sensory Issues ",
            "link": "https://www.reddit.com/r/autism/comments/1d3r5pu/saliva_sensory_issues/",
            "votes": 1,
            "comments_count": 1,
            "created": "2024-05-30T00:30:52.046000+0000"
        },
        "body": "Does anyone else have sensory issues with their own saliva, like it just feels wrong and swallowing it is 🤢🤢🤢.  It's definitely worst after brushing teeth but sometimes just happens randomly too.  It's so bad right now and I need to sleep so bad I'm losing my mind.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 142,
            "title": "Marcel, the shell with shoes on",
            "link": "https://www.reddit.com/r/autism/comments/1d3qyhp/marcel_the_shell_with_shoes_on/",
            "votes": 1,
            "comments_count": 1,
            "created": "2024-05-30T00:20:32.557000+0000"
        },
        "body": "This is the cutest, most adorable thing I've ever seen.  I feel like ya'll would appreciate it.  Dean Fleisher Camp and Jenny Slate, whoever you are, this is great!  (28) MARCEL THE SHELL WITH SHOES ON - YouTube\n\n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 143,
            "title": "My mom yelled at me again",
            "link": "https://www.reddit.com/r/autism/comments/1d3qusa/my_mom_yelled_at_me_again/",
            "votes": 1,
            "comments_count": 3,
            "created": "2024-05-30T00:15:21.845000+0000"
        },
        "body": "Well, it happened again. I got yelled at for something I couldn’t help once again.\n  \nSee other post  to see what happened\n  \n    I was pouring a smoothie my mom made earlier and she put it in the fridge. It got thick of course (I knew that) and poured it into another cup and I poured slowly so it wouldn’t get messy. Of course it got almost everywhere in the kitchen and my mom saw and started yelling. She started saying stuff like “You couldn’t pour slowly” even though I did try to put it in the cup as slow as possible and also said “You and your dad are always clumsy”. I kept trying to defend myself and say that I tried as hard as I could to not get it everywhere.\n  \n    I honestly don’t know what to do, I can’t keep living like this all the time. I can’t help my autism, I can’t help my ADHD. I’m so sick of always getting yelled at for things I can’t help, even though I tried to prevent chaos from happening. Because trust me, I don’t like getting messy as much as my mom doesn’t so I really try hard to not cause problems. I really hope my autism and situations like this gets better in the future and I’ve even tried telling my parents that I don’t like being yelled at and I get yelled at even for crying by my dad. Trust me, I love my parents but it’s too much and I hope other people who are autistic don’t have to go through this.\n  \n    Thank for your time\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 144,
            "title": "Struggling to work. Anyone else?",
            "link": "https://www.reddit.com/r/autism/comments/1d36lo5/struggling_to_work_anyone_else/",
            "votes": 21,
            "comments_count": 25,
            "created": "2024-05-29T07:42:11.543000+0000"
        },
        "body": "So I CAN work. But not consistently and only from home. Do you work? How often? What do you do?\n  \n    I’ve had full time jobs but all of them I ended up eventually burning out and having a breakdown which led to a huge break from working at all. I get so anxious, stressed and overwhelmed - it takes over my entire mind. Employers haven’t been understanding because I’m in the process of getting my diagnosis sorted so it’s on paper so I haven’t said anything. I also have endometriosis which makes it worse.\n  \n    I feel completely useless and codependent. I’m scared I’ll never achieve financial independence. I did for a bit but then I burnt myself out totally. I’m trying to get onto disability to help supplement my income but it’s a lengthy process and I may not be approved. And I feel like…a failure for doing that. I’ve had it hammered into me that work is best and you should work.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 145,
            "title": "Experiences with Risperidone?",
            "link": "https://www.reddit.com/r/autism/comments/1d3glyo/experiences_with_risperidone/",
            "votes": 4,
            "comments_count": 13,
            "created": "2024-05-29T16:39:49.167000+0000"
        },
        "body": "So I've been on 2 mg of Risperidone for the past two years or so. In some ways it really helps me; I don't feel so extremely anxious all the time, and I don't get so caught up in my head all the time.\n  \n    On the other hand, I have like no thoughts at all. I'll think really basic stuff sometimes like \"I'm hungry\" or \"it's raining...\" but otherwise my mind is completely blank and silent for most of the day. I don't really feel anything either, just calm.\n  \n    I was wondering what other people's experiences with risperidone are like, and if anyone else had their mind go blank?\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 146,
            "title": "Dreams",
            "link": "https://www.reddit.com/r/autism/comments/1d3qojm/dreams/",
            "votes": 1,
            "comments_count": 2,
            "created": "2024-05-30T00:06:42.993000+0000"
        },
        "body": "I can’t remember ever having any of the more common dreams or nightmares people always talk about. Things like teeth falling out, being chased, being naked in public, falling. My dreams are always very intricate narratives for better or worse, and they feel like they go on forever. It’s a bit of a stretch to connect that with my autism, but I’m curious- what are y’all’s dreams like?\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 147,
            "title": "I’ve been having a lot of meltdowns lately but I’m not able to figure out what’s up whilst in this state to relieve it ",
            "link": "https://www.reddit.com/r/autism/comments/1d3qlm5/ive_been_having_a_lot_of_meltdowns_lately_but_im/",
            "votes": 1,
            "comments_count": 4,
            "created": "2024-05-30T00:02:48.385000+0000"
        },
        "body": "I’ve been having a lot of meltdowns over the last three days\n  \n    It’s bad\n  \n    The anger and rage now seems to have turnt to mostly crying spells which is better but it’s still rough\n  \n    The problem is I can’t relieve any of what might be causing this because I’m not able to process things right now and I feel like I’d just be guessing if I pushed it\n  \n    How can I relieve this stress and get out of this awful loop I’m in?\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 148,
            "title": "Anyone experienced a stim they can’t control?",
            "link": "https://www.reddit.com/r/autism/comments/1d3imkm/anyone_experienced_a_stim_they_cant_control/",
            "votes": 3,
            "comments_count": 5,
            "created": "2024-05-29T18:04:31.669000+0000"
        },
        "body": "I have this stim where I constantly make a bird noise and can’t really control it\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 149,
            "title": "Why am I so useless.",
            "link": "https://www.reddit.com/r/autism/comments/1d3qg9u/why_am_i_so_useless/",
            "votes": 1,
            "comments_count": 2,
            "created": "2024-05-29T23:56:07.772000+0000"
        },
        "body": "Yesterday my girlfriend got a msg from her Mom. It's my girlfriend's sister's birthday today and they're having a party, my partner and I were invited. A party of unknown size at unknown time and of unknown duration potentially less than 24 hours in advance.\n  \n    I had a panic attack. For the rest of the day I was on edge, could barely eat. I ended up staying up all night until I only had time to get 6 hours of sleep before needing to get up to get ready. Still couldn't fall asleep. Got up, had an anxiety attack. Barely got myself into the shower only to just sit there. Barely finished washing myself before I ran out of hot water. Then my gf comes in to see how I'm doing and I just had a meltdown. Rocking and crying and just a full mess. I told her I couldn't do it. Couldn't just go to her parents place for dinner with her sisters. Because they called it a party.\n  \n    I've said it so maybe times more it doesn't sound like a word, party. But I just can't. Parties are stressful and I need more than \"unknown but potentially less than 24 hours from now\" amounts of notice. I need to know when it will start, when it will end, who is going.\n  \n    My girlfriend said she understood and wasn't mad. But she had said earlier how much she wanted me to go...her family even made special food for me since I'm lacrosse intolerant.... But that just added to the pressure.\n  \n    I can't even get up and go get free food. Why am I so useless.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 150,
            "title": "Any tips on how to take things slower and stop overplanning?",
            "link": "https://www.reddit.com/r/autism/comments/1d3qd3y/any_tips_on_how_to_take_things_slower_and_stop/",
            "votes": 1,
            "comments_count": 2,
            "created": "2024-05-29T23:51:51.135000+0000"
        },
        "body": "So lam a really really impatient guy, and it is putting some issues on my current talking stage of a relationship, basically she wants to take things nice and slow which is fair and I want to go slow for her, but then suddenly we are talking and end up asking like 1 question about the future, then suddenly I go on a huge rant about the future with her and I can tell it is starting to offput her which is the LAST thing - wanna do. I am still in a huge burst of energy over it and want to just keep going and going and going about the future and plans and all that nonsense, I keep flipping over my phone in anticipation even though I legit said I am gonna give her a bit of space. I desperately need some advice to be able to actually give her space when she needs and calm myself down about overthinking every little bit of the future and actually take things slower.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 151,
            "title": "Opinion? ",
            "link": "https://www.reddit.com/r/autism/comments/1d3qcqk/opinion/",
            "votes": 1,
            "comments_count": 2,
            "created": "2024-05-29T23:51:20.604000+0000"
        },
        "body": "How do you feel about the TBH/autism creature\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 152,
            "title": "I may unaliv3 soon and that worries me. ",
            "link": "https://www.reddit.com/r/autism/comments/1d3ibza/i_may_unaliv3_soon_and_that_worries_me/",
            "votes": 3,
            "comments_count": 7,
            "created": "2024-05-29T17:52:29.984000+0000"
        },
        "body": "I'm tired of being treated like shit. I'm tired of doing everything. I'm tired of being the shoulder everyone cries on without caring about my feelings. I want it to end.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 153,
            "title": "I can't stop stimming/fidgeting? ",
            "link": "https://www.reddit.com/r/autism/comments/1d3ibbr/i_cant_stop_stimmingfidgeting/",
            "votes": 3,
            "comments_count": 4,
            "created": "2024-05-29T17:51:42.560000+0000"
        },
        "body": "Hello. I'm sorry if this is a stupid question. I'm a 26(f) autistic adult with a learning disability and I was wondering if other autistic people go through phases where they fidget or stim more? Idk why it's freaking me out...I've always been fidgety. Always have had to do things with my hands but recently it's gotten a lot \"worse\". I can't sit still anymore. Sitting through lectures used to be fine, I used to be able to put through videos just fine. I have been dealing with mental health struggles like burnout. I'm on medication for depression and in therapy. I plan on bringing this up to my therapist. I have actually been feeling a bit better recently since my medication has taken effect and I been trying to priorize my mental health. So if I'm getting better, why is my stimming so much worse?? Even just trying to do homework or draw I'll start fidgeting with my hands, intense rocking, etc. I've had moments where I could not sit still and would stand up and pace around, flapping, fidgeting and disturbingly I'll start hitting myself. Not hard, I resist those impulses. But I'll hit my thighs and hips, idk why. It's like my limbs just need to MOVE. Sorry it's so long, it's just been on my mind. Especially since it's starting to get physical. Has anyone had this happen? Am I going crazy?? Autism doesn't get worse right?? What's going on?? Am I just stressed?\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 154,
            "title": "Cleaning the house?",
            "link": "https://www.reddit.com/r/autism/comments/1d3i9fx/cleaning_the_house/",
            "votes": 3,
            "comments_count": 2,
            "created": "2024-05-29T17:49:32.354000+0000"
        },
        "body": "Im 28, have my diagnosis for almost 2 years now and I work 28 hours a week. I worked 36 hours at my previous job, but I quit a half year after my diagnosis because I couldn't handle it anymore. Not only because of work and my bosses, but also because 36 hours was way too much for me to handle AND also do my chores at home.I live alone, have 2 cats since december 2023. I have autism coaching since 3 months to keep me regulated, but I still struggle a LOT with cleaning my house and the chores in overall.. How do you guys do it?I have a whiteboard in my kitchen with a weekplanning, all with magnet plates in different colors you can write on. Also have a smaller board that says TO DO and has the main chores (dishes/throwing away garbage/laundry/dying the dishes etc etc) with a \"done\" and \"not done\" switch. Which is helping sometimes for the main chores, but I still feel like my house is a fucking mess and it gets me so overwhelmed. I come home from work, cook myself dinner and after that my energy is just gone. My mom and my coach tell me to \"do it later when I have the energy\" but I only have Thursdays and Sundays off and it feels like I have to clean both whole days to get ANYTHING done and just wasted all of my spare time to relax and take it easy (which is already a difficult task for us autistic people).\n  \n    Any more people with the same trouble? Or have some tips? I suspect I have adhd as well (which was the main reason to get me tested, but only got autism lol). I tend to have \"piles\" of stuff laying everywhere in my home and I exactly know where everything is. But if I would have a \"cleaning frenzy\", it would cause me to have panic afterwards because I can't find anything anymore and its frustrating haha. Also; I don't know where to begin or in what tempo I should do everything. It feels like its 0% or 100% and nothing in between :(\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 155,
            "title": "I need help with sensory issues please",
            "link": "https://www.reddit.com/r/autism/comments/1d3q5j7/i_need_help_with_sensory_issues_please/",
            "votes": 1,
            "comments_count": 3,
            "created": "2024-05-29T23:41:45.626000+0000"
        },
        "body": "I'm here just to ask this question but I have serious sensory problems with my feet and hands and I've tried everything that I know of so how do you guys help it?\n  \n    When it gets hot or wet (including cold water), it feels like my skin is peeling off and even fluffy material feels like jeans at that point. Like it's not itchy or uncomfortable, it's almost painful and nauseating because of how extreme the sensory is\n  \n    I've tried using gloves to take a shower or to make my bed but then it gets sweaty and it causes it to get hot and wet and it frustrates me. I've tried putting powder in the gloves but dry skin makes it worse. The only thing I'm able to do is putting my hands on ice cold metal or plastic to numbify it (making sure the surface isn't wet or anything (the inside of a freezer)) so I can finally touch material such as my own clothing\n  \n    I can't talk to anyone about this as I'm physically unable to, but if anyone can help come up with solutions, I honestly appreciate it so much. Thanks in advance\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 156,
            "title": "Recommendations for Toothpaste",
            "link": "https://www.reddit.com/r/autism/comments/1d3q5gh/recommendations_for_toothpaste/",
            "votes": 1,
            "comments_count": 5,
            "created": "2024-05-29T23:41:39.597000+0000"
        },
        "body": "I cannot stand brushing my teeth. I don't even like watching others do it. I'm really scared of losing my teeth though so feel I need to find a better way to get myself to do it.Right now i use Crest Gum Detoxify Deep Clean. The mint flavor does not bother me and I prefer it over flavored kind as something about flavoring just icks me. I know the part I hate the most is the foaming and am not sure if there is a way around that.Does anyone have any toothpaste recommendations or other ways they got around getting themselves to brush their teeth?\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 157,
            "title": "Massive TW for something, I'm not even sure what? I had a really bad meltdown and I really needed to talk about this to someone, but don't have anyone to talk to",
            "link": "https://www.reddit.com/r/autism/comments/1d3q4s8/massive_tw_for_something_im_not_even_sure_what_i/",
            "votes": 1,
            "comments_count": 1,
            "created": "2024-05-29T23:40:48.878000+0000"
        },
        "body": "false\n      \n\n    First of all, I know how fucked up this was, I can't stop thinking about how horrible of a person I am for this.\n  \n    Earlier today I had a meeting with a psychiatrist that didn't go well and I got very triggered. I managed to stay calm though the meeting, but once I got out and my care worker was booking a follow-up I just couldn't take it anymore. I left the building, with intentions of waiting outside for her. I was fiddling with plants because idk I was bored and my worker comes out and starts calling my name.\n  \n    I don't know what was going on in my head at this point, but I went full on meltdown and started speed walking away from her down the street. She followed me and kept asking me to stop and talk to her and where I was going. I was nonverbal at this point and juts kept going. I have no clue where I was going I just wanted her to go away.\n  \n    I got to a main road where my worker caught up to me and was right beside me now. I don't know what possessed me to do this, but I started walking trough traffic trying to get hit. I have struggled with suicidal ideation/suicide attempts in the past, but I don't think that's what this was. I didn't want to die, I don't know why I was trying to get hit.\n  \n    I walked in the road for 3 blocks while my worker called 911 because I wasn't getting out of the road. It was pouring rain and I got soaked and was freezing. The ambulance came first and directed traffic away from me. I kept walking until I was by my old highschool (transfered to a different one 2 years ago). There was a class going on a walk that saw me in the road with an ambulance following.\n  \n    Eventually the cops arrived too and drove their cars in front of me to cut me off. I just bolted and they grabbed me. I got apprehended under the mental health act and taken to the hospital for a little while before being released.\n  \n    All I can think about is how I scared the shit out of not only my worker, but a bunch of innocent people just trying to drive to work or pick up their kids or get groceries or something. Those people didn't deserve to have to dodge a mental headcase of a teen walking through the road. That class of teens, some of which may even have recognized me, didn't deserve to see another kid getting handcuffed and taken into an ambulance. These people were just trying to live a normal day and had the misfortune of witnessing my bullshit. I can't stop thinking of the trauma I probably inflicted on them and how much of a shit person I am for doing that. I don't even know why I did it too...\n  \n    Its not even the first time I've inflicted genuine trauma on people because of my struggles, my poor foster family had to deal with me for years with incidents MUCH worse than this one. I've cause so many people so much pain with my meltdowns and I genuinely and wholeheartedly believe that I am an abuser. I don't want to be, I don't try to be, in fact I do everything I can to avoid these urges and triggers to not act like this, but I can't change the fact that I hurt people. I traumatize people. I'm a fucking abuser.\n  \n    I keep searching google for stuff like \"girl running through traffic in my city\" or \"girl walking in road I was on\", scanning the news to see if anyone has mentioned my incident or posted about it on social media. I feel so horrible for my actions. I've barely eaten today or done anything but mindlessly scroll, I feel like I don't deserve to eat or do anything.\n  \n    I know I wasn't thinking straight, but I don't think that excuses it. Especially because I have faced absolutely no repercussions outside of being taken to the hospital for a few hours, but I was immediately released and sent home. My worker and the manager of the group home I live in literally said to me that I'm not in trouble and they're going to make sure I don't get punished for this, but I feel like I deserve punishment. I acted horribly, why is everyone acting like its fine? I hurt so many innocent bystanders today for nothing!!\n  \n    Idk I'm sorry, I needed to get this off my chest. Feel free to berate me in the comments, I know how fucked up I am for this.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 158,
            "title": "a good career path for autistic people? ",
            "link": "https://www.reddit.com/r/autism/comments/1d3q4nw/a_good_career_path_for_autistic_people/",
            "votes": 1,
            "comments_count": 4,
            "created": "2024-05-29T23:40:39.163000+0000"
        },
        "body": "I’m currently 17 and a year away from uni, I’m not build for academics whatsoever; i have concentration issues, memory issues, SEVRE lack of motivation and a major procrastinator and these qualities combined have left my grades in shambles\n  \n    I’m incredibly worried for both my academic future and career path options\n  \n    Im wondering if anyone who’s already in a secure branch of work has any advice? what are some good things to pursue that are a little more welcoming to autistic individuals? I know the world shouldn’t have to cater to certain needs but if anyone has any advice it would be much appreciated :’) especially based in the UK\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 159,
            "title": "I'm a student making an app for my school project, that is designed to help people with ASD through their daily lives, the only problem is I haven't got ASD and have no idea of the struggles you all have that an app could help with",
            "link": "https://www.reddit.com/r/autism/comments/1d3e502/im_a_student_making_an_app_for_my_school_project/",
            "votes": 5,
            "comments_count": 8,
            "created": "2024-05-29T14:53:49.507000+0000"
        },
        "body": "So, if you are willing to fill out a survey for me it's greatly appreciated: https://forms.gle/iWM75MmvQLznbLoj7If you don't want to do that can you tell me below some daily struggles you have that a mobile app could help with!\n  \n    I already have some ideas like:\n  \n\n\n    In-app features to reduce overstimulation (eg. fidgets)\n  \n\n\n    A Mood tracker\n  \n\n\n    Help with communicating needs to people like doctors or police officers\n  \n\n\n    What else could I add?\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 160,
            "title": "Do you also mimic characters from TV shows and movies?",
            "link": "https://www.reddit.com/r/autism/comments/1d30u5v/do_you_also_mimic_characters_from_tv_shows_and/",
            "votes": 55,
            "comments_count": 34,
            "created": "2024-05-29T01:50:36.479000+0000"
        },
        "body": "Sometimes it happens to me, I mimic the attitudes, accents, or words and expressions of some characters because I like them and feel that they would be good to use in my life. It also happens to me with people sometimes... I noticed that sometimes I mimic my boss and some colleagues from my old job when making jokes or sarcastic comments because it seemed to work for them. Do you also experience this? Do you know if it works in any way or is it something I should change?\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 161,
            "title": "Sensory friendly fabrics",
            "link": "https://www.reddit.com/r/autism/comments/1d3l2yz/sensory_friendly_fabrics/",
            "votes": 2,
            "comments_count": 6,
            "created": "2024-05-29T19:49:39.178000+0000"
        },
        "body": "What fabrics do you find yourself wearing on a regular basis? Are there any fabrics that always cause sensory overload for you?\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 162,
            "title": "has anyone tried the flare audio calmer earplugs? how did they work?",
            "link": "https://www.reddit.com/r/autism/comments/1d3q0ht/has_anyone_tried_the_flare_audio_calmer_earplugs/",
            "votes": 1,
            "comments_count": 2,
            "created": "2024-05-29T23:34:56.862000+0000"
        },
        "body": "my mom has finally accepted i have autism and after a really bad breakdown today, she showed me some earplugs that apparently reduce the frequencies of noises that commonly bother people and told me they would be good to try.\n  \n    has anyone tried these out? did they work well for you?\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 163,
            "title": "I feel like it’s way easier to argue that life sucks on top of being autistic if you live in the US because living in the US has its own unique problems that don’t exist anywhere else. ",
            "link": "https://www.reddit.com/r/autism/comments/1d3py00/i_feel_like_its_way_easier_to_argue_that_life/",
            "votes": 0,
            "comments_count": 4,
            "created": "2024-05-29T23:31:35.681000+0000"
        },
        "body": "Here are some examples\n  \n\n\n    At-will employment which means there’s always some chance that you could get fired or laid off for a really small reason\n  \n\n\n    The fake positivity culture which means that being honest about anything shitty in your life isn’t normalized\n  \n\n\n    It’s somehow easier to be poor here than it is elsewhere. I think that’s mainly because of a lack of free healthcare\n  \n\n\n    Imagine getting date rejection just because you don’t drive a car. Doesn’t sound like something that’s common in any country that isn’t car centric\n  \n\n\n    Not sure if this expectation exists anywhere else but, imagine being expected to spend money on people you barely know just because there’s a potluck. That’s like asking a total stranger to give you one article of clothing that you’re wearing.\n  \n\n\n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 164,
            "title": "Help me please",
            "link": "https://www.reddit.com/r/autism/comments/1d3pv5c/help_me_please/",
            "votes": 1,
            "comments_count": 5,
            "created": "2024-05-29T23:27:51.446000+0000"
        },
        "body": "Hi everyone. I recently found out I am mild-moderately autistic. I am a 28M and have been struggling with depression/anxiety and addiction for years. Things keep getting worse day by day and I fear I am going to lose everyone and everything. I am so depressed. I can barely do anything but sleep. Usually I function okay but this is getting worse. I think I am suffering from burnout/depression. Anyone out there who wants to chat?\n  \n    I just wanna talk to someone and know I have a community. I am stimming and it wont help. Nor will sleep. I feel so burnt out. I had to quit my pt job. I have incredible college debt. I cant really work right now. I am not eating and I feel anxious all the time.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 165,
            "title": "Looking for a chart to help an autistic friend identify her feelings",
            "link": "https://www.reddit.com/r/autism/comments/1d3psz9/looking_for_a_chart_to_help_an_autistic_friend/",
            "votes": 0,
            "comments_count": 1,
            "created": "2024-05-29T23:24:51.146000+0000"
        },
        "body": "Hello! I'm a very close friend to an autistic person - she has recently received her diagonis (a few months ago), and now we're trying to find ways to help her adapt and overcome her difficulties.\n  \n    One of these difficulties is that she has a very, very hard time identifying her sensations. For instance, she has difficulty knowing when she is hungry, when she wants to go the bathrom... She'll say \"I'm feeling weird\", and them describe how her feet is kind of numb and she feels weak, but can't really understand why, or what her body is trying to tell her. Sometimes I'm able to help her, but most of the time I'm just kind of useless, in a practical sense.\n  \n    I'm trying to find some kind of chart that would help her - I don't know, something like \"If you're feeling X in your belly and a slight pain on the front of your head, it's probably hunger\", or something of the sort.\n  \n    Is there a resource like this available? Or any other resource that I could use to help her?\n  \n    Thanks in advance and God bless.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 166,
            "title": "How do you maintain employment with sensitivity to micromanagement?",
            "link": "https://www.reddit.com/r/autism/comments/1d3kof8/how_do_you_maintain_employment_with_sensitivity/",
            "votes": 2,
            "comments_count": 2,
            "created": "2024-05-29T19:32:00.871000+0000"
        },
        "body": "Edit: To clarify, I posted here because while almost everyone is annoyed by micromanagement, I think the demand avoidance from autism (I'm level 1) is what's taking this from annoying to unbearable, and I'm wondering if this has been a barrier to employment for anyone else.\n\n    I [23M] have worked in restaurant kitchens and mental health case management.  In every job I've had, I've enjoyed the work but left due to a micromanagey coworker.  I generally get along with almost everyone, but it just takes that one who will inevitably pop up to take it from a job I love to one where I'm drinking myself to sleep every night until I ultimately quit.\n  \n    They always have the manager wrapped around their finger.  At my last job, the manager was occasionally a bit of a problem as well, but it's generally coworkers.  That manager was weird: she'd be very hand-off but occasionally decide to breathe down my neck, usually when I voiced concerns about anything (which led to me no longer communicating, which led to her getting onto me for not communicating).\n  \n    Do I just have to continue this cycle of dealing with a job for as long as I can before changing to find a new micromanager to deal with?  Or is there some solution?  Maybe a job with few coworkers?\n  \n    Ultimately, I plan to work alone (I'm a counseling major finishing up grad school and plan to start my own practice), but that will take at least 5 years to get licensed and enough experience, capital to rent a place, etc.\n  \n    And I'm not sure what to do in the meantime: this is exhausting, and now I'm to the point where I'm paralyzed trying to find a new job.  I've been unemployed for months, and I'm burning through my savings.  But I'm so afraid of choosing wrong and dealing with this again.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 167,
            "title": "not officially diagnosed but i need help with my volunteer job. please ;w;",
            "link": "https://www.reddit.com/r/autism/comments/1d3plmh/not_officially_diagnosed_but_i_need_help_with_my/",
            "votes": 1,
            "comments_count": 1,
            "created": "2024-05-29T23:15:07.446000+0000"
        },
        "body": "So first off not officially diagnosed, my doctor thinks i have autism but the nhs rejected my referal and i need to try again but i really need advice with this cause im crying here\n  \n    I volunteer at a zoo for 3 hours a week. we rotate every like.. 45 mins and its always just standing there doing nothing and i get so bored and drained. I am very anxious around people so i mainly stay silent avoiding eye contact and only talking when someone asks me a question like where the red panda is..\n  \n    It was nice at first to just look at the animals but as the weeks have gone by its gotten more and more draining for my mental health. I am now dreading going and i cry and struggle to sleep and get a really bad stomach ache when just thinking about it.\n  \n    I can't even quit because my dad threatened me if i did quit it.\n  \n    What i wanted to ask was how can i make this less boring and how do i keep my hands and mind occupied when working? My stress ball wasnt enough and i just feel like a broken spoiled person because its only 3 hours a week (unpaid) and it isnt \"hard work\" i apparently am overreacting cause its easy.. but for me this is very hard to handle. I want to work with animals i want to have a full time job but with how this is affecting me i worry i cant handle this without causing extreme harm to my mental health.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 168,
            "title": "Should I pursue a diagnosis as a high-schooler?",
            "link": "https://www.reddit.com/r/autism/comments/1d3pk8f/should_i_pursue_a_diagnosis_as_a_highschooler/",
            "votes": 1,
            "comments_count": 2,
            "created": "2024-05-29T23:13:19.300000+0000"
        },
        "body": "I'm female and currently in highschool and about 98% sure that I am autistic. I've spent years researching asd and ADHD, and I just can't imagine a world in which someone would get to know me and insist that I'm neurotypical.\n  \n    I've discussed the possibility of me being autistic before with my mom, and she insists there's nothing \"wrong\" with me and that I'm just lazy or weird or a normal teenager. She seems to be slightly more accepting of the idea recently, but is still definitely of the mindset that a label would just ruin my future and cause people to discriminate against me. While this is a valid point for many people, I believe the benefits that accomodations in school would have on my mental health would far outweigh any possible downsides of this \"label\". At least in the present. I'm wondering if I should push more on talking to a doctor about it.\n  \n    After I first bought this up to my mom a couple of years ago, she very casually mentioned how she used to think that I had Asperger's (which is of course now recognized as a part of ASD) when I was little, but I \"grew out of that\". I really don't understand it.\n  \n    I have already been \"assessed\" (I put in quotes because it was a done by my general pediatrician using only fill in the bubble surveys from me, me parents, and a teacher)in 8th grade for ADHD, but was told I don't have it. I think this may be because I made the mistake of giving the form to the teacher who had known me the longest, assuming she would have the best insight on me. I only later found out that she didn't believe that girls could have ADHD after talking to a friend who has had a formal diagnosis since second grade, but this teacher pretended it didn't exist. I went to a private school pre k through 8th grade so they didn't care much about it. That teacher was the reason that friend switched to homeschooling.\n  \n    I excelled in school until around 5th grade, which is when I began to struggle to keep up with homework and time management, especially in subjects I didn't much like. I think a lot of my symptoms probably flew under the radar at my old school because it was small a comfortable and familiar environment, surrounded by many of the same people for years at a time, along with being in small classes of 14 or less people. I was just me there, and everyone knew me as kinda weird but also they were used to it. The transition from an 8th grade class of 9 people to an overpopulated public highschool with almost 3,000 students was incredibly difficult, and these last two years I have never struggled more in school. My mental health has been such a rollercoaster and I'm so stressed out. I think I'd benefit greatly from a 504 plan.\n  \n    Sorry for the obscenely long post, and thank you to anyone who read through everything. I'd be really grateful for any advice on the matter.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 169,
            "title": "Im suspecting i might have autism ",
            "link": "https://www.reddit.com/r/autism/comments/1d3phyq/im_suspecting_i_might_have_autism/",
            "votes": 1,
            "comments_count": 2,
            "created": "2024-05-29T23:10:21.584000+0000"
        },
        "body": "Im not diagnosed and im not trying to diagnose myself but i simply wanted to ask some people who are more knowledgeable about this topic.\n  \n    Im a girl and here are some of the things i observed about myself that made me questions this:\n  \n\n\n    when i was little ( 6 -11)  i would shake my hands without even knowing i was doing it.  I would do it in school and  at home especially when i was stressed or just thinking and day dreaming. To this day i do it sometimes when im alone ( when i was a kid my mum got angry at me for it) because it helps me be more calm.\n  \n\n\n    i would do wierd movements when sitting down or walking when alone ( when i was a kid i would do them whenever ) especially when im day dreaming ( i day dream most of my day) or when im imagining something. This also happens on its own and i don’t  know im doing it\n  \n\n\n    -when i was a kid i was extremely scared and irritate by loud sounds. I remember i was extremely scared of fireworks. Once we were having family over and all the kids were outside looking at the fireworks but i had to be with my mum inside the house as i wouldn’t stop crying. For my 11th birthday my dad was doing fireworks and i stood outside the house with my mum, really far away. I ended up begging her for us to go inside the car as it wouldn’t  be as loud. She would get angry at me for not acting “normal”.\n  \n    I was also scared of balloons poping becouse of how loud the sound is when that happens.  I would still play with them but whenever someone was making one or i saw a balloon that seemed close to poping i would cover my ears and often start crying. I remember for one of my birthdays when i was really young my dad was blowing a balloon and before he even started i asked him not to overdo it so it wouldn’t pop. He started to overdo it and i was thinking it was going to pop so i covered my ears and stared crying. I never seen someone as a kid be so anxious about things like that.\n  \n    -i seem to behave a bit differently to other people. I behave a bit more monotone then others even when i don’t mean to. For example, when i get given a gift and i am very  happy about it  i have to force myself to seem happy and most of the time it doesn’t  really work out so people think im not happy with it or disappointed. Throughout my whole life i was told i always look very sad and my family keeps asking me if im okey. This happens when i feel fine?\n  \n    -im often anxious about many things especially when im in public. I start to think i walk weird and that people are looking at me. This causes me to act very weird and ackwardly as if im moving too fast and cant focus on things like people around me who just seem calm. I heard of people talking about being over-stimulated often in public.\n  \n    I was hoping i could get given some simple advice or input ( because maybe im just being stupid )but actually seeing if i can diagnose is out of question as my mum would simply laugh in my face if i ever tried to bring any of this up.\n  \n    (Sry for any spelling mistakes im writing this on my phone)\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 170,
            "title": "Need input on coworker behavior.",
            "link": "https://www.reddit.com/r/autism/comments/1d3pdpz/need_input_on_coworker_behavior/",
            "votes": 1,
            "comments_count": 4,
            "created": "2024-05-29T23:04:51.144000+0000"
        },
        "body": "Hi ASD community, question to help me understand what's going with my coworker.\n  \n    We work in an open office environment, with semi-flexible start and end times. When coworkers pack up to go home for the day, my autistic coworker is hell bent on saying goodbye to each of them.\n  \n    Keep in mind, some folks just want to quietly go home--particularly when they may be leaving earlier than normal--and it's apparent they're irritated by loud \"goodbye coworker!\" as they're walking out.\n  \n    I've explained to my coworker some people want to leave quietly, and to please stop doing the loud \"goodbye!\" Nonetheless, he continues this behavior.\n  \n    How else can I explain to him that he needs to \"read the room\" and tone it down, or better yet, stop the behavior?\n  \n    Thanks in advance for your responses.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 171,
            "title": "Why do neurotypicals dislike talking about the dead?",
            "link": "https://www.reddit.com/r/autism/comments/1d3pb5f/why_do_neurotypicals_dislike_talking_about_the/",
            "votes": 1,
            "comments_count": 3,
            "created": "2024-05-29T23:01:35.817000+0000"
        },
        "body": "A few years ago a a classmate died while hiking and he was the first one of our high-school class to seize to exist. Last month we had a class reunion and at some point I thougt we could talk about him or the memories we share.\n  \n    But the two occasions I brought it up, it was not picked up. They acted like he never existed as if the fact that he is dead means you mustn't talk about him anymore.\n  \n    I do know that death is something that is barely talked about in a neurotypical world, while neurodiverse people seem to not push it away as much (e. g. I do have contingency plans for my wife in case I die and we often talked about what would happen and so on. I'm 28 years old so probably also an autism thing to think about it this early in life). But is a funeral really the point where bringing a person up ends?\n  \n    It's actually saddening me to see him being forgotten as the only ones remembering him don't seem to want to talk about him at all\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 172,
            "title": "Why do I struggle so hard to understand the importance of going to my sisters events like concerts.",
            "link": "https://www.reddit.com/r/autism/comments/1d3patt/why_do_i_struggle_so_hard_to_understand_the/",
            "votes": 1,
            "comments_count": 1,
            "created": "2024-05-29T23:01:12.821000+0000"
        },
        "body": "On top of that I think I struggle with discomfort around showing other people especially close family that I care about them. (Probably my alexithymia) and is probably a large contributer to why I don't go because it is really hard to overcome the discomfort around certain things like this.\n  \n    I feel really bad, and my sister is gonna be moving out for uni soon. I dont want our relationship to be distant for the rest of our lives.\n  \n    She had a concert tonight, and yet again I didn't go.\n  \n    Any advice\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 173,
            "title": "Does the world not like singles?",
            "link": "https://www.reddit.com/r/autism/comments/1d3k7pd/does_the_world_not_like_singles/",
            "votes": 2,
            "comments_count": 4,
            "created": "2024-05-29T19:11:39.988000+0000"
        },
        "body": "I mean like the government and the like\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 174,
            "title": "why do people say “your autistic” as an insult?",
            "link": "https://www.reddit.com/r/autism/comments/1d3ew1p/why_do_people_say_your_autistic_as_an_insult/",
            "votes": 4,
            "comments_count": 15,
            "created": "2024-05-29T15:25:33.946000+0000"
        },
        "body": "It's usually always in a joking way, but I feel like I hear “your acoustic” as a joke used to make fun of people in a somewhat lighthearted way. It's thrown around in the streaming community a lot, just like how “your gay” or “ur zesty” is also used to joke around. There's nothing wrong with being gay, but people, especially guys, use it to make fun of each other.\n  \n    I have noticed this with my favorite streamer on Twitch because the chat will spam \"your sped,\" \"ur on the spectrum,\" or \"ur autistic\" in situations where he is having a slow moment. It doesn’t make me upset; it’s more unsettling, especially because it makes me question if these people even know anything about autism.\n  \n    Personally, I think having autism would make it harder to actually be a good streamer, at least for me. I am pretty much the complete opposite of witty or good with my words, and most streamers are exactly that. It's just annoying when people question “am I autistic” even if they are joking for entertainment. I can never easily understand social cues well, so it just is something that will confuse me or rub me the wrong way.\n  \n    I know autism is a spectrum, so some autistic people could actually be very witty or good with their words.\n  \n    It’s just strange seeing people take “am I autistic?” tests online lmao 😂🤦‍♀️\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 175,
            "title": "How does one cope with too much empathy?",
            "link": "https://www.reddit.com/r/autism/comments/1d3p4n4/how_does_one_cope_with_too_much_empathy/",
            "votes": 1,
            "comments_count": 1,
            "created": "2024-05-29T22:53:28.615000+0000"
        },
        "body": "Growing up I never much related to anything, never felt much about anything. I was almost proud that no book or movie had ever made me cry. That was until I opened up to my then boyfriend, now husband. He helped me realise that I had mostly hidden behind a mask and so much so, that I didn't even feel the emotions myself. The thing is, once I opened those floodgates I haven't really been able to hold back on the empathy again. Advertisements make me cry, thoughts about characters in a tv show keep me up at night, book characters appear in my dreams, etc. It feels like my empathy is either 100 % or 0 %. I don't want to mask and hide it again, yet, being so emotionally involved in everything is exhausting and painful. How does one cope with that? It's been 4 years of empathy now and time doesn't really seem to help.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 176,
            "title": "Hi, I'm an Autistic and Schizophrenic music producer",
            "link": "https://www.reddit.com/r/autism/comments/1d3atox/hi_im_an_autistic_and_schizophrenic_music_producer/",
            "votes": 7,
            "comments_count": 3,
            "created": "2024-05-29T12:18:53.492000+0000"
        },
        "body": "I have aspergers in the process of getting reassessed with a comorbid a psychotic spectrum disorder. I was wondering if you could listen to my music and tell me what you think (dubstep & trap fusion)? I need the support because I only have a few friends irl. Would appreciate any comments, positive or negative.. and of course any likes or subscribes.\n  \n    No obligation, and if you hate it, be honest, I want to hear your feed back.\n  \nhttps://youtu.be/2I9ApiofjmU?si=Ewyk4i7OT8nS241f\n\n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 177,
            "title": "How many others here have gone through this 'chain' of specific subjects??",
            "link": "https://www.reddit.com/r/autism/comments/1d3k24a/how_many_others_here_have_gone_through_this_chain/",
            "votes": 2,
            "comments_count": 1,
            "created": "2024-05-29T19:05:03.033000+0000"
        },
        "body": "I don't know why but, during a conversation with someone I met recently also on the spectrum, we were talking about our phases in special interests and a thought occurred to me!\n  \n    I know some other of my friends (also on the spectrum or at least suspecting) also have shared these as being things they read into / studied a bit and hopped around in a way.\n  \n    Subjects kinda go like: \"Space / psychology / religion / philosophy / personality (MBTI / enneagram) / astrology\" . Almost everyone I've met has gone in more or less this kind of succession of interests. This grouping isn't 'abnormal' and loads of people study it, but I'm curious is there a correlation with like \"always these subjects\" + \"autism\".\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 178,
            "title": "How can I help my autistic brother?",
            "link": "https://www.reddit.com/r/autism/comments/1d3p17x/how_can_i_help_my_autistic_brother/",
            "votes": 0,
            "comments_count": 2,
            "created": "2024-05-29T22:49:05.797000+0000"
        },
        "body": "I have an 22 year old autistic brother, who is currently at university studying Maths. My father gives him a hard time for not studying Engineering like he did, and I feel like they don't really understand his condition.\n  \n    Is there anything I could do to help my brother, in terms of living life, making friends, seeking employment etc?\n  \n    I am worried that he will grow increasingly isolated and I am not sure what to do\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 179,
            "title": "Feeling Lonely Sucks... ",
            "link": "https://www.reddit.com/r/autism/comments/1d3gpfu/feeling_lonely_sucks/",
            "votes": 3,
            "comments_count": 5,
            "created": "2024-05-29T16:43:49.195000+0000"
        },
        "body": "I'm currently 21, will be 22 in July, and I've never had real friends. I've always had one-sided friendships or mutuals online. Nobody cares to be around me. I've always struggled with striking up a long conversation, conversations with me are always smalltalk. I desire to have a friend group to rely on so we all can do stuff together whenever. But nobody will ever understand me, my passions, my feelings. I feel so useless.\n  \n    I've also been bullied several times in my life over my own hobbies and passions so its given me so much self-confidence issues as a whole. I will always be a lonely nobody whos always rejected long term, I'll just never be good enough for anyone. I was always that one lonely kid sitting alone in the cafeteria during lunch back in school and over 4 years later I still feel like that...\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 180,
            "title": "NT Spouse Separation - Feedback Needed! ",
            "link": "https://www.reddit.com/r/autism/comments/1d3crg6/nt_spouse_separation_feedback_needed/",
            "votes": 5,
            "comments_count": 1,
            "created": "2024-05-29T13:53:45.187000+0000"
        },
        "body": "I'm going through a heartbreaking separation (which could end in a possible divorce) with my unofficially diagnosed ASD Level 1 husband. We've been married for five years and had many, many big life changes during this time - but one of the contributing factors leading to the breakdown in relationship is likely the undiagnosed autism.\n  \n    (Obviously there are many other small factors like unresolved issues, some trust breakdown and intimacy issues that we didn't work through and let build up, so I want to be clear that ASD isn't the core issue regardless and I am not trying to blame him for being who he is.)\n  \n    I have so much love for him and he is my best friend, I am so proud of him. He is massively successful career-wise and showed up in many ways I chose not to acknowledge in the course of the relationship. Even now we still get along relatively well and I want the best for him - even if it isn't with me. But we are no longer \"in love\" and he has emotionally withdrawn and checked out of the relationship. He says he wants something \"easier\" and someone less \"clingy\" and that he cannot meet my needs and we are probably incompatible. He wants space from me right now and says he will probably move on soon.\n  \n    We used to be so much more affectionate/loving and collaborative before we lived together. We've been a couple for 12 years so I thought I knew who he was before we got married!\n  \n    I have let him down many times, including making assumptions when we communicated, accusing him of just being an asshole, not knowing/choosing not to recognise his need for space, and nagging him a lot to help with the housework and the dog, asking if I can have a friend over etc (not respecting his boundaries/safe space), feeling offended about him being \"controlling\" (but really I think he just wanted the best for me).\n  \n    Can you suggest how I can be supportive through the separation, whilst giving him the space he needs? Is this normal in a neurodiverse relationship?\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 181,
            "title": "What do you think of the movie Rain Man (1988)?",
            "link": "https://www.reddit.com/r/autism/comments/1d3gluc/what_do_you_think_of_the_movie_rain_man_1988/",
            "votes": 3,
            "comments_count": 5,
            "created": "2024-05-29T16:39:39.417000+0000"
        },
        "body": "I was under the impression that most autistic people see it as a harmful stereotype but maybe I'm the minority.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 182,
            "title": "Hand washing",
            "link": "https://www.reddit.com/r/autism/comments/1d3gke7/hand_washing/",
            "votes": 3,
            "comments_count": 5,
            "created": "2024-05-29T16:37:49.283000+0000"
        },
        "body": "Hi everyone. I am the mother of an autistic teenage son. I’m trying my best to navigate his needs and help him, but he often shut down when I ask him questions about these things. I’m wondering if you guys can help me.\n  \n    My son is in drivers training right now. He’s doing great for the past six months or so he’s been obsessively handwashing. I suspect that may it was triggered by learning to drive and the stress involved. However, it’s almost an out of control situation. He uses a whole Bathroom pump hand soap container every day. He’s obsessively washing with bar soap in the shower, going through what would normally be a month worth of soap in a day or two. He recently started using dish soap on his hands in the kitchen and washes his hands for Several minutes with the dish soap, lathering over and over. I’m wondering if anybody else has experienced this. If anyone has any suggestions on how I can get him to stop. His hands are dry and chapped and bleeding from over washing. I’m wondering if maybe there’s a kind of soap I can start buying that he might not enjoy as much so that he uses it only for necessity. Also wondering if there’s anything I can do to help him get a handle on this before it gets worse.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 183,
            "title": "Books",
            "link": "https://www.reddit.com/r/autism/comments/1d3bd93/books/",
            "votes": 6,
            "comments_count": 2,
            "created": "2024-05-29T12:47:34.250000+0000"
        },
        "body": "Hi everyone,\n  \n    I recently finished reading Unmasking Autism: Discovering the New Faces of Neurodiversity by Devon Price, and I absolutely loved it.\n  \n    I'm now on the lookout for other books that explore similar themes, particularly those that focus on neurodiversity and self-understanding. If anyone has any recommendations, I would greatly appreciate it!\n  \n    Thanks in advance.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 184,
            "title": "Overstimulated and indecision",
            "link": "https://www.reddit.com/r/autism/comments/1d3bbzv/overstimulated_and_indecision/",
            "votes": 6,
            "comments_count": 1,
            "created": "2024-05-29T12:45:47.930000+0000"
        },
        "body": "Hey guys!\n  \n    Does anyone else get overstimulated by something they can control but not do anything about it for a while? Like for example if you were playing music and the volume was too loud would you just put up with it for a while before realising that you can just turn it down?\n  \n    I realise that I do this with a lot of things and my current hypothesis is that because 90% of the things I get overstimulated by I can’t control so it doesn’t occur to me to try and control the other 10% of things that overstimulate me, if that makes any sense? So I’ll just put up with it for ages before realising “oh, I can just turn the music down”\n  \n    Does anyone else get this??\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 185,
            "title": "I’ve noticed myself having delusions all my life is this related to autism or something else?",
            "link": "https://www.reddit.com/r/autism/comments/1d3g7q5/ive_noticed_myself_having_delusions_all_my_life/",
            "votes": 3,
            "comments_count": 3,
            "created": "2024-05-29T16:22:15.320000+0000"
        },
        "body": "I used to believe people could hear my thoughts, many many times I’ve had convictions that people were out to get me. When I was a child I had a lot of delusions of grandeur.\n  \n    They’ve had a pretty negative impact on my life, I’ve ruined a lot of relationships because of my delusions\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 186,
            "title": "Benefits of an autism diagnosis after already having ADHD?",
            "link": "https://www.reddit.com/r/autism/comments/1d3oaaf/benefits_of_an_autism_diagnosis_after_already/",
            "votes": 1,
            "comments_count": 2,
            "created": "2024-05-29T22:15:37.954000+0000"
        },
        "body": "I've been diagnosed with ADHD since I was around 8 or 9 years old (I am now 16 reaching 17) I would like to consult a therapist or doctor about a possible Autism diagnosis (I don't want to just self diagnose for obvious reasons but I feel like I could really be autistic, especially because I notice patterns I myself have in autistic friends, and one is very on my side that I should look for a professional opinion) But my mother won't let me. She sees no use and benefit in possibly having it diagnosed, because \"it would just be another lable I don't need\" She does think my brother (also diagnosed with ADHD but around 5 or 6. He got the diagnosis through me) could be autistic but also doesn't want a diagnosis for him because of the same reasons, she thinks he will just get bullied. (He experienced, same as me, bullying in elementary school)\n  \n    I don't know about my brother because he just takes his ADHD medications and he seems \"normal\" but I struggle a lot more so I think a possible diagnosis would help me, at least a bit, but that's not a good enough reason for my mother (my father is the only neurotypical person in our house hold and doesn't even like us taking medications and the ADHD diagnosis we have because it's \"unnatural\" and stuff)\n  \n    Could I maybe get some benefits for why a diagnosis would actually help and be more than \"just a label\"? Thank you very much in advance\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 187,
            "title": "Expressing more emotion with reactions instead of face expressions",
            "link": "https://www.reddit.com/r/autism/comments/1d3o7ni/expressing_more_emotion_with_reactions_instead_of/",
            "votes": 1,
            "comments_count": 1,
            "created": "2024-05-29T22:12:29.094000+0000"
        },
        "body": "When i am masking i tend to barely show emotion when i am not interacting with anyone but i still get some reactions that could reveal it like if i am happy or excited i get goosebumps (can also get them from sensory issues tho) if i am sad i look like tired, if i am scared i breathe fast and if i am angry or frustrated i get itches around my body. does anyone relate?\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 188,
            "title": "For the late diagnosed: What are the 3 words that describes your process of finding out you are autistic?",
            "link": "https://www.reddit.com/r/autism/comments/1d2jll9/for_the_late_diagnosed_what_are_the_3_words_that/",
            "votes": 398,
            "comments_count": 370,
            "created": "2024-05-28T13:33:28.765000+0000"
        },
        "body": "1 word for before finding out | 1 word for the moment you found out | 1 word for how you feel now, the present time after knowing your diagnosis. (Sharing mine in the fist comment)\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 189,
            "title": "Why I can't talk when I'm overstimulated?",
            "link": "https://www.reddit.com/r/autism/comments/1d3asu4/why_i_cant_talk_when_im_overstimulated/",
            "votes": 7,
            "comments_count": 4,
            "created": "2024-05-29T12:17:37.253000+0000"
        },
        "body": "Sometimes when we're out and it is really hot, loud and I'm uncomfortable with my clothes and backpack, when someone ask me question I can't answer it. I feel like talking is hundred times harder than usually and people get mad at me because of that. I can't even think of any solution for that, I'm so hopeless about that. I don't want to make people sad because I can't describe and just say how I'm feeling/what I want/where we are going next.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 190,
            "title": "🚨 Sensory Warriors! This is Your Call 🚨",
            "link": "https://www.reddit.com/r/autism/comments/1d3frey/sensory_warriors_this_is_your_call/",
            "votes": 3,
            "comments_count": 1,
            "created": "2024-05-29T16:03:04.549000+0000"
        },
        "body": "Bright lights, loud noises, and intense smells making you overstimulated? Fed up with not knowing what sensory experience awaits?\n  \n    My friend and I are working on developing software to assist with sensory experiences to put YOU in control before you go anywhere. But we need your input!\n  \n    ➡️ Take the 2-min survey and help shape the future of individuals with sensory overstimulation and needs.\n  \nhttps://docs.google.com/forms/d/11ft7CK85OLvLE3R3xbbeBXGEGCnwFGaN8ppldLBEW8w/edit?ts=664f6aa5\n\n    Make your voice heard! Share with others who need sensory solutions too. We genuinely appreciate your feedback.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 191,
            "title": "A stim I have that I've never heard anyone else discuss.",
            "link": "https://www.reddit.com/r/autism/comments/1d3bxmv/a_stim_i_have_that_ive_never_heard_anyone_else/",
            "votes": 5,
            "comments_count": 3,
            "created": "2024-05-29T13:15:24.261000+0000"
        },
        "body": "When I was younger I used to stare at lights or far away objects and then move my eyes in a figure 8 or plus sign type pattern. My grandma took me to the optometrist because she thought I was having trouble seeing and I couldn't explain what I was actually doing. They confirmed I was fine. At this point, I'd already been diagnosed with ADHD and PDDNOS, but if I take a video of myself doing it I can see why she'd think it was something wrong with my eyes\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 192,
            "title": "What’s your weird stimm?",
            "link": "https://www.reddit.com/r/autism/comments/1d35vrp/whats_your_weird_stimm/",
            "votes": 16,
            "comments_count": 31,
            "created": "2024-05-29T06:52:09.581000+0000"
        },
        "body": "For me it’s putting my left hand on the side of my right ribs, on the last 4th one. I always do it while walking, I look kind of like a Minecraft villager but with only one arm bended. It started when I had pain in between my ribs 6 years ago and I used that hand to ”massage it” constantly and I did it for 6 months straight, and now years later I got used to always walking in that position. I am kind of worried that it look like I would scratch my armpit but my hand is lower but I still worry sometimes :(\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 193,
            "title": "Does anyone else with the tism get REALLY strong crushes?",
            "link": "https://www.reddit.com/r/autism/comments/1d3nquv/does_anyone_else_with_the_tism_get_really_strong/",
            "votes": 1,
            "comments_count": 3,
            "created": "2024-05-29T21:52:48.483000+0000"
        },
        "body": "I took ppls advice on my last post and didn’t give up on that app. Matched with a girl who doesn’t care about my work status or that I talk a lot. This could also be because I’m a baby bi and usually I don’t even match with girls on this app very often, but I have a giga mega crush on this girl now. Things are going great but I have a big tendency to jump the gun and be all like “I LOVE YOU DOG!” when admitting my feelings and it’s really soon to be this infatuated but I can’t help but giggle and blush when I think about her.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 194,
            "title": "I think I might be autistic, but I'm scared I'm making it up",
            "link": "https://www.reddit.com/r/autism/comments/1d38b2n/i_think_i_might_be_autistic_but_im_scared_im/",
            "votes": 9,
            "comments_count": 11,
            "created": "2024-05-29T09:47:32.667000+0000"
        },
        "body": "Really sorry if this doesn't fit here, I didn't know where else to ask.\n  \n    Before I start let me say that I haven't talked to a professional yet, but I plan on doing so soon. Recently I started researching about autism because I was interested and realized that there is a possibility that I might be autistic. There are some symptoms or some behavior I have that would fit with the description. I know that online tests don't give accurate or true results, but I still tried a few and they confirmed what I was already thinking. Again I know that just because an online test said I might be autistic doesn't actually make it true so I'm planning on talking to a professional soon.\n  \n    But I feel like I'm trying to shove myself into something I'm not a part of. Like all of my symptoms and behavior can be explained through other means and I'm trying to make myself a victim somehow. I'm scared I'm just making all of it up just to get sympathy or something. Even though I know I would never do that on purpose, I struggle with my emotions and often don't know the exact reason behind them and I don't know if this time it's the same, where I think I'm just trying to find out the truth, but in reality I'm just trying to get pitied or something.\n  \n    So I just wanted to ask if you have any advice? What would you do? Does it even make sense for me to talk to a professional or am I just trying to shove myself into a space that's not meant for me? I know this is very limited information for these types of questions, but I don't really know what else to share.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 195,
            "title": "Why is autism speaks considered a hate group?",
            "link": "https://www.reddit.com/r/autism/comments/1d3n2f9/why_is_autism_speaks_considered_a_hate_group/",
            "votes": 1,
            "comments_count": 23,
            "created": "2024-05-29T21:21:55.430000+0000"
        },
        "body": "New to the reddit scene and trying to make the autistic forums my comfort space. I never really cared for organizations that are run by neurotypicals intended for neurodivergents, exactly why I uninstalled hiki 🤢. But I’m curious, why label them a “hate group”.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 196,
            "title": "what is something you don’t understand why, but you just can’t stand seeing it? (visual version of texture issues?)",
            "link": "https://www.reddit.com/r/autism/comments/1d3eqbn/what_is_something_you_dont_understand_why_but_you/",
            "votes": 3,
            "comments_count": 10,
            "created": "2024-05-29T15:19:00.453000+0000"
        },
        "body": "does anyone else have essentially visual versions of texture issues? seemingly regular things that you can’t stand seeing because it pings your brain as “wrong?”\n  \n    for some reason i don’t like looking at people’s hands. they often move in ways i don’t understand, and hitchhiker’s thumbs freak my brain out so bad. i know reasonably that people just move in certain ways, or their hands are just another part of them, but it’s similar to eye contact. the less i know you, the harder it is to look at your hands.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 197,
            "title": "Am I mean",
            "link": "https://www.reddit.com/r/autism/comments/1d3houo/am_i_mean/",
            "votes": 2,
            "comments_count": 4,
            "created": "2024-05-29T17:25:14.472000+0000"
        },
        "body": "So I am autistic and I hate vinegar but my mum brought chips with vinegar on them so I tried one and I hated it and it made me gag and it caused me to have a melt down now I feel bad what should I do\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 198,
            "title": "Finding decent employment in this job market with autism and anxiety to boot.",
            "link": "https://www.reddit.com/r/autism/comments/1d3hnny/finding_decent_employment_in_this_job_market_with/",
            "votes": 2,
            "comments_count": 1,
            "created": "2024-05-29T17:23:52.669000+0000"
        },
        "body": "I should tell my whole story but we'd literally be here for days.\n  \n    I'm almost 30 and finally moving out of my father's place, while everyone seems to either have the mental fortitude or parental support to help them develop as people: I was deprived of that and accumulated horrific low self confidence issues. Now that I'm finally getting out I just never want to go back, not even for the apparent \"oh that phase where everyone moves back one\" nope I don't want to go back ever I've been here long enough.\n  \n    From my previous work experience: employer's don't give single crap about anxiety which is sad, asking customers to be decent to their worker's on a basic level just seems too out of their reach despite asking the minimal. Autism however I'm less sure about. I finally have a certificate of authenticity for it, but even then I'm 100% sure despite laws or positive public consensus: most employment places avoid hiring people with any form of disability unless its for public reception purposes.\n  \n    Right now I'm struggling to even organize my resume, and I've contacted a work force near my new place (I'm moving 4 hours away) that said they can help with that. On that note does anyone know what I should bring with me aside from SS Card? Because I can't find my birth certificate like 99% of people.But anyways yeah, I've only worked at places for around 2 to 2¾ years and one period where I was struggling with severe depression after losing a loved one.\n  \n    Any help is appreciated and I hope y'all are doing well.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 199,
            "title": "check lists... are, importante? (fun workarounds?)",
            "link": "https://www.reddit.com/r/autism/comments/1d3hml1/check_lists_are_importante_fun_workarounds/",
            "votes": 2,
            "comments_count": 1,
            "created": "2024-05-29T17:22:39.045000+0000"
        },
        "body": "Trying to come off as my child self here...\n  \n\n    I think with pathological demand avoidance, other people's checklists are 🤢🥶🤮🤒😶‍🌫️\n  \n\n\n    BUT.  my actual thoroughly cared, unique checklist full of funn for myself, is kind of fire 🥳\n  \n\n    This isn't me as an adult, but more so my Damaged Ego. I guess I'm subconsciously avoiding people able to read my checklists and understand what it means.. I do have trust issues, but if Im honest, Im just having more fun this way for some reason.\n  \n    has this ever been something you experience? Something so dumb to keep you excited? but it keep you working?\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 200,
            "title": "Should I get a diagnosis?",
            "link": "https://www.reddit.com/r/autism/comments/1d3hind/should_i_get_a_diagnosis/",
            "votes": 2,
            "comments_count": 5,
            "created": "2024-05-29T17:18:11.743000+0000"
        },
        "body": "Hi I'm Shiloh,\n  \n    I've been considering getting a diagnosis because for a while now my sister has suspected that I have autism. But what has stoped me is that I am unsure if I have it or not. I do have dyslexia which could be comorbid with Autism. However have taken a lot of online quizzes. But they all say that I don't have it.\n  \n    Would it be a good idea to go though with the effort of getting tested or should I not?\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 201,
            "title": "Is anyone else’s special interest True crime?",
            "link": "https://www.reddit.com/r/autism/comments/1d3hhtg/is_anyone_elses_special_interest_true_crime/",
            "votes": 2,
            "comments_count": 2,
            "created": "2024-05-29T17:17:10.065000+0000"
        },
        "body": "I know it can be debatable at times, and its controversial with the recent series about the perpetrators out on Netflix. I find myself fascinated about the details, and the motives and psychology of the perps. It honestly made me more paranoid about people, lol.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 202,
            "title": "Anyone else has the need to do things completely in one time without breaks?",
            "link": "https://www.reddit.com/r/autism/comments/1d389mg/anyone_else_has_the_need_to_do_things_completely/",
            "votes": 8,
            "comments_count": 5,
            "created": "2024-05-29T09:44:40.854000+0000"
        },
        "body": "Watching a 3 hours movie listening to a long album Playing a game basically anything you do that take a long time. I wonder if it's related to autism because my parents always tell me I can stop and continue later. I once watched a movie in the living room my dad wanted to watch the news and the movie was almost over so I asked him if he can wait and he couldn't, he told me that I can always watch this movie again but it's not the same. another example I have is when I put songs I like on the television in the living room and my brother come with his kids unexpectedly (they live close to me) and he stop the song without even asking even if there is only 30 seconds till the end. I can't say anything because I will get labeled as dramatic over little things.\n  \n    If I know I'll get interrupted I just don't do some things because it ruins my mood.\n  \n    just want to know if someone relate\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 203,
            "title": "Bad Sensory Days",
            "link": "https://www.reddit.com/r/autism/comments/1d3c7lq/bad_sensory_days/",
            "votes": 4,
            "comments_count": 3,
            "created": "2024-05-29T13:28:32.081000+0000"
        },
        "body": "Does anyone else have days where your sensory issues are worse? Some days I'll notice that the seams in my clothes are especially irritating, or smells and sounds that I can normally deal with (begrudgingly) are a lot harder to ignore. This usually seems to be a premonition that its not going to be a fun day, and by the end of the day I'm in full blown sensory overload on the verge a shutdown/meltdown.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 204,
            "title": "Is this skill regression?",
            "link": "https://www.reddit.com/r/autism/comments/1d3h2mh/is_this_skill_regression/",
            "votes": 2,
            "comments_count": 1,
            "created": "2024-05-29T16:59:35.483000+0000"
        },
        "body": "insert butterfly meme here\n\n    Alright, I've been reading a lot of articles and posts about skill regression but I've got to ask because if I don't I'm just going to sit here and waste time obsessing over it.\n  \n    So I (26) recently realized that I've got autism and I'm currently going through assessments with my therapist. Shortly after all this started, I started noticing that I felt like I couldn't do a lot of like... really \"\"normal\"\" things. And when I would inevitably be getting really upset about the situation, I kept having the recurring thought of \"Didn't I used to be able to do this???\" Which has led me to this question.\n  \n    For example, I used to cook quite a bit and while I usually followed recipes, I had a good enough grasp on cooking that I could usually just figure stuff out and make it work but now it feels like if someone asks me to make something that seems pretty straightforward but they don't give me really clear instructions on how they want it done, it suddenly feels like I'm losing my mind and it's some insurmountable task. I also used to be good (not great or anything but not awful) about keeping up with small cleanliness and tidying tasks around the house but now it feels like I never notice when things need to be done until someone points them out, which pisses my partner off to no end which in turn becomes a huge thing because like... yeah she's right why is it so hard for me to keep things tidy? Especially when it didn't used to be? There's other little things like my coworkers commenting on how my expression when reacting to things hasnt lined up with the \"expected\" reaction (like my facial expressions have just been off when I'm trying to express certain things and so everyone's confused by what I'm trying to say, etc.\n  \n    The other big thing is that I can't handle social interactions anymore. I work in a coffee shop and have had years of being annoyed by customers but moving on where as now if the slightest thing goes wrong in the interaction (especially if I feel like the trajectory of the conversation is obvious and the customer says something unexpected/\"off topic\"/useless), I'm just done. Like it feels so extreme but there's no coming back from that in an interaction I'm just like dead faced, how do we end this as fast as possible. Which I used to be able to smile through it or just laugh it off but now it's so freaking exhausting to me. (Can't wait for the answer to be no this isn't skill regression you're just bad at your job 😂). But even in interactions with friends there's moments where I'll basically just try to straight up leave the interaction because something is bothering me and I'm like \"Oh you know an easy way to not be bothered? Just leave.\" People don't seem... to really appreciate that one though... and just standing up and leaving during a conversation was definitely not something I would have even thought to do before.\n  \n    Oh cool, I sound like a huge asshole now that I've written all this out 😂 well... I guess my question still stands of \"does any of this sound like skill regression\" or am I just the asshole?\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 205,
            "title": "What are your favorite dried fruits?",
            "link": "https://www.reddit.com/r/autism/comments/1d3m8ed/what_are_your_favorite_dried_fruits/",
            "votes": 1,
            "comments_count": 3,
            "created": "2024-05-29T20:41:37.942000+0000"
        },
        "body": "Mangos? Bananas? Strawberries? Other?\n  \n    I'm looking for a healthy shelf-stable bulk snack that I can just graze on. I like crispy dried apple slices but haven't found an inexpensive source for them. I hate getting stuff stuck in my teeth, so nuts are unfortunately a no-go unless swallowed like pills.\n  \n    I'm asking you all because you understand the importance of texture consistency. What's your favorite dried fruit or veggie (if applicable)?\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 206,
            "title": "Finally diagnosed",
            "link": "https://www.reddit.com/r/autism/comments/1d3gziy/finally_diagnosed/",
            "votes": 2,
            "comments_count": 11,
            "created": "2024-05-29T16:55:43.217000+0000"
        },
        "body": "Yesterday, I got a diagnosis of Level 1 ASD. I have waited so long for this vital missing piece of my identity, that somehow makes me feel like I don't need to hate myself anymore. I am 41(F) and I finally feel understood.\n  \n    I just needed to put this out there.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 207,
            "title": "Have you considered a career involving your special interest?",
            "link": "https://www.reddit.com/r/autism/comments/1d3gwnc/have_you_considered_a_career_involving_your/",
            "votes": 2,
            "comments_count": 5,
            "created": "2024-05-29T16:52:12.708000+0000"
        },
        "body": "Hello all,\n  \n    The recent trains discussions have gotten me thinking about how the overall community deals with work and special interests. Idk about all of you, but there have definitely been times I'm grateful to be as independently functional as I am but I've had some moments where I would have understood if I was deemed incompetent to the point of needing full time care. This conversation isn't about that, but rather about the struggles we face enmeshing in a neurotypical environment. The book \"Look Me In The Eye\", was the first time I knew it was possible for us autistic folk to carve a niche I'm society, and still it seemed unobtainable.\n  \n    For instance I struggled working in kitchens for years because of the constant noise, and most customers facing jobs were just too peopley to not completely overwhelm me. It wasn't until I started working in private security that I was able to thrive in a work environment, but that was just because of very clear rules and plenty of alone time. It wasn't fulfilling work but it more than paid the bills.\n  \n    In recent years though I've been transitioning to working more in my special interest, bonsai, and the stresses of work have just disappeared. The days of endless anxiety, and going mute are behind me and I get to sperg out all I want to. My partner is no longer annoyed talking in circles about the special interest because.. I get it all out during the day? Plus the social component is much easier to manage with small groups. Across the board my QoL has gone up since the transition.\n  \n    Sorry for rambling, but I hope by sharing we can get the ball rolling on some convo. Have you had luck finding work that aligns with your special interest? Are you unsure what a job would even look like? Have a plan to try it? I think it'd be cool to try and build each other up here if you'd like to share, whether it's a story of success, failure, or what could be.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 208,
            "title": "How to stop feeling overstimulated?",
            "link": "https://www.reddit.com/r/autism/comments/1d3lzo0/how_to_stop_feeling_overstimulated/",
            "votes": 1,
            "comments_count": 1,
            "created": "2024-05-29T20:29:53.299000+0000"
        },
        "body": "I was cutting some fruit and the juices got on my hand, and now I feel really overstimulated and I’m literally just in my bed\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 209,
            "title": "I'm just so in love with my husband's pet! Gushing post haha",
            "link": "https://www.reddit.com/r/autism/comments/1d3gjme/im_just_so_in_love_with_my_husbands_pet_gushing/",
            "votes": 2,
            "comments_count": 3,
            "created": "2024-05-29T16:36:50.919000+0000"
        },
        "body": "I just need to gush!! My husband has a BTS we bought together, so I guess our pet? [Living Apart Together situation, though]\n  \n    I love him!!! I love Beepy! I love Prince Beepy of the Kingdom Eepy!!! I love him I love skinks! He's so damn cute!\n  \n    He's so dumb and stupid looking in the BEST WAY and he's ADORABLE. He's an Ambon Blue Tongue Skink. I'm on my way to my husband's place so I can hold Beepy and pet him!\n  \n    I wish I could put a picture here but it won't let me. But he is literally the CUTEST LITTLE GUY EVER. It really scratches my autism brain and makes me so happy. Like JAJAIWIWAJAHBAJWISYENWNS!!!!! I LOVE BEEPY!\n  \n    I love his little feet and his funky little face, when he faces forward. He's literally the best pet ever and I LOVE HIM. I'm really glad that me and Josh[husband] bought him! He was so fucking expensive but it was sooo worth it.\n  \n    It was like love at first sight! When I saw him in his enclosure in the store, I knew that we had to care for him and spoil him. He's literally the best pet ever, he LOVES being handled, and he likes stare at me and sometimes fall asleep on me.\n  \n    I'm glad that we got him, I could never regret spending money on him. He's literally so baby. He's so friend-shaped! He's my little sausage guy! Thinking about him makes me stim and I wag my foot, like I am literally so in love with Beepy! Best little guy EVER!!!\n  \n    I hope whoever reads this gets as happy as I am lol\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 210,
            "title": "Where can aspies meet aspies?",
            "link": "https://www.reddit.com/r/autism/comments/1d389yj/where_can_aspies_meet_aspies/",
            "votes": 7,
            "comments_count": 6,
            "created": "2024-05-29T09:45:19.216000+0000"
        },
        "body": "I am tired of misunderstanding and feel like a fish in the air. I want to find a way to the sea, so to say.\n  \n    But where can I meet other aspies? Most of you are alone and don't go out much. I haven't met that many aspies that use tinder, maybe a couple men, but I would like to focus on women as I want to build friendships.\n  \n    Only place that seems to attract you guys are hospitals after suicide attempts or schools but I am no longer in one.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 211,
            "title": "Do you feel disproportionately upset when you feel like you struggle with something \"simple\" that most people don't seem to have trouble with",
            "link": "https://www.reddit.com/r/autism/comments/1d2n8ex/do_you_feel_disproportionately_upset_when_you/",
            "votes": 177,
            "comments_count": 38,
            "created": "2024-05-28T16:10:59.028000+0000"
        },
        "body": "I seem to be brain dead trying to figure out very simple common sense things. I also really struggle to understand when people explain things verbally. Every time it happens I feel profoundly horrible about myself for a very long time\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 212,
            "title": "Does anyone else cry as a response to certain interactions?",
            "link": "https://www.reddit.com/r/autism/comments/1d3gey9/does_anyone_else_cry_as_a_response_to_certain/",
            "votes": 2,
            "comments_count": 4,
            "created": "2024-05-29T16:31:08.967000+0000"
        },
        "body": "Let me explain because I'm not sure what these type of interactions are called.\n  \n    I'm 18 so there are a lot of people in the world who are a lot older and hold much more senior roles than me. When these people speak to me with slight sympathy/sad/similar emotions involved, my instant response is to start crying. I hold it back but tears are in my eyes and I feel choked up in my throat. However I don't get this with my parents.\n  \n    For example, my boss at my old work came to me after I had been working slightly slower than usual, she asked me something along the lines of 'I've been very understanding and accommodating with you, I've tried to put myself in your shoes and I'm not sure what else I can do to help you, is it not enough?' and I was holding back tears so much to the point I couldn't speak even if I tried. Another time an old teacher of mine asked me about how she can help me better because she didn't think what she was doing was working + asked me to explain my struggles in further detail and I was choked up with tears.\n  \n    Wondering if anyone else experiences this / whether anyone knows why this happens? Thanks :)\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 213,
            "title": "When was your earliest memory & what was it on ?",
            "link": "https://www.reddit.com/r/autism/comments/1d2uefn/when_was_your_earliest_memory_what_was_it_on/",
            "votes": 70,
            "comments_count": 120,
            "created": "2024-05-28T20:58:49.459000+0000"
        },
        "body": "I’ll start. Mines was falling down the stairs and breaking my arm. I was 2.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 214,
            "title": "Can you “beat” autism",
            "link": "https://www.reddit.com/r/autism/comments/1d3g05b/can_you_beat_autism/",
            "votes": 2,
            "comments_count": 20,
            "created": "2024-05-29T16:13:14.916000+0000"
        },
        "body": "I was thinking about this the other day, let’s say hypothetically an autistic person gets so good at masking and acting like an NT that it becomes second nature to them and requires no effort or very minimal effort, does that mean they beat autism???\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 215,
            "title": "Diagnosed last year, now it's hard to believe in my diagnosis because my life has gotten easier for me",
            "link": "https://www.reddit.com/r/autism/comments/1d3l2ad/diagnosed_last_year_now_its_hard_to_believe_in_my/",
            "votes": 1,
            "comments_count": 1,
            "created": "2024-05-29T19:48:54.033000+0000"
        },
        "body": "When I got my diagnosis of ASD and ADHD last year at 22, it made sense of everything. Finally all my struggles in life made sense and I could finally start being more kind to myself, because now my issues weren't because I'm lazy and dumb, but there actually was a reason behind them. I started being kinder and more understanding towards myself, which has made my life easier.\n  \n    Now, I don't know why but I'm having terrible imposter syndrome. I do believe in my ADHD diagnosis, but my autism diagnosis, even though I know it's correctly diagnosed and I do recognize the traits in myself... it's been kind of hard to believe in it because I'm not struggling enough anymore.\n  \n    My life situation has changed a lot since my diagnosis though. I struggled a lot with school, but I gratuated just before my diagnosis and I started a job that I like and that I'm good at. I've been trying to manage my sensory needs better, trying to adjust my life to better suit my needs. But now because I don't struggle as much in life, it's been harder to believe in my diagnosis, even though deep down I know it's correct.\n  \n    Anyone else have these issues? Anyone who got diagnosed a bit later in life?\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 216,
            "title": "does this happen with anyone else ",
            "link": "https://www.reddit.com/r/autism/comments/1d3kwme/does_this_happen_with_anyone_else/",
            "votes": 1,
            "comments_count": 2,
            "created": "2024-05-29T19:42:02.076000+0000"
        },
        "body": "does anyone’s like intense special interest or hyperfixation just completely die down like it doesn’t exist when ur mental health is really bad? like when i was better my special interests n hyperfixtions were so intense and i loved it and i loved talking about it all the time n stuff but now that im not great again i feel like i don’t even have one if that makes any sense it all and it honestly kinda sucks\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 217,
            "title": "Need help about nonverbal moments",
            "link": "https://www.reddit.com/r/autism/comments/1d3kmi2/need_help_about_nonverbal_moments/",
            "votes": 1,
            "comments_count": 1,
            "created": "2024-05-29T19:29:53.378000+0000"
        },
        "body": "Hi. Need help on telling people about my nonverbal moments. I’m trying to get help for anger management. I’m considering signing up for this course run by my state. But… how do I tell them that I may sometimes need extra time to respond to questions, be unable to talk sometimes, etc.? I have nonverbal moments in my autism. Especially when I’m really sad or angry or scared or happy or stressed…\n  \n    I have AAC apps on my phone, but I might not be able to access the sound features during the video calls. It’s an online course with video conferences.\n  \n    It’s only an 8-week course.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 218,
            "title": "Something that makes you feel bad that even you think that is stupid?",
            "link": "https://www.reddit.com/r/autism/comments/1d3kjku/something_that_makes_you_feel_bad_that_even_you/",
            "votes": 1,
            "comments_count": 3,
            "created": "2024-05-29T19:26:11.361000+0000"
        },
        "body": "\"Bad\" like bad emotions in general (angry, uncomfortable, annoying, sad, etc...).\n  \n    For me, it is the redundancy, when someone is exposing his idea or smt and then they repeat something that they already say. I hate when it happens in videos, I automatically stop watching it. It really piss me of when people make me repeat myself, bc they don't understand my point or even if they just don't hear me, i can even get mad over someone just for that, is really stupid and i feel like im annoying somethimes for that, I fkng hate it. And you?\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 219,
            "title": "How Guanfacine Impacts Social Anxiety : My 3-Month Experience",
            "link": "https://www.reddit.com/r/autism/comments/1d3c01a/how_guanfacine_impacts_social_anxiety_my_3month/",
            "votes": 3,
            "comments_count": 3,
            "created": "2024-05-29T13:18:45.644000+0000"
        },
        "body": "Hi folks,\n  \n    I've been keeping a diary while taking Guanfacine at 1mg and then 2mg for the past three months.\n  \n    Although I haven't been able to test my reactions to in-person rejection, I've been wondering if my experiences with online interactions might be relevant. Here are a few examples: being criticised or downvoted on Reddit, having meltdowns due to frustration or feeling overwhelmed by everyday situations. These situations still make me feel like I'm kicked, lead to ruminating, and cause emotional dysregulation.\n  \n    Does this mean Guanfacine isn't working for me, or is it only supposed to help with face-to-face interactions?\n  \n    For those who have taken Guanfacine, how has it helped you? Do you perceive things differently? Do you still feel the pain of rejection but find it disappears quickly and you don't ruminate as much?\n  \n    I'm curious if the apprehension about approaching people will lessen after enough experiences of rejection that don't result in the usual pain thanks to the medication.\n  \n    Feel free to downvote or criticise me—I want to test my response.\n  \n    Thanks!\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 220,
            "title": "Assessment Requirement Concern - proving symptoms before 5 yrs old",
            "link": "https://www.reddit.com/r/autism/comments/1d3kbaj/assessment_requirement_concern_proving_symptoms/",
            "votes": 1,
            "comments_count": 6,
            "created": "2024-05-29T19:15:57.796000+0000"
        },
        "body": "Is it true you have to PROVE symptoms before 5 years old?\n  \n    My co-worker just had her kids assessed and one is autistic. I am working with the same local place. BUT she said a requirement is proving symptoms before 5 yrs old.\n  \n    I am sure I had symptoms before 5 such as limited food types, over eating, no \"I'm full\" signal, barfing from over drinking juice constantly, cramps, tired muscles, balance, light issues, staring at people until they were angry, and not understanding intention (a kid tried to make me drink poison but I just didn't believe someone would want to kill me, a girl saved me - basically I was Butters from South Park).\n  \n    I don't really have anyone reliable that knows me from before 15:-one parent doesn't remember most things correctly, especially traumatic issues-other parent was rarely around-one parent isolated us from their entire family, so I speak to none of them since the 1990s-other parent, the whole family doesn't like to speak much-I didn't start interacting with most my siblings until my 30s.\n  \n    *I do have a picture of me using one arm to hold up another arm because I always had muscle exhaustion but that's about all my proof.\n  \n    I'm not sure how I can prove anything from my childhood...\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 221,
            "title": "Is there a website where I can organize my notes in the most efficient way possible?",
            "link": "https://www.reddit.com/r/autism/comments/1d3k8h3/is_there_a_website_where_i_can_organize_my_notes/",
            "votes": 1,
            "comments_count": 4,
            "created": "2024-05-29T19:12:36.064000+0000"
        },
        "body": "I have complied a ton of soccer research for the past three years and I need to organize my evading and expansive thoughts better. I know there’s a ton of websites or programs out there but would love some ideas.\n  \n    Go!\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 222,
            "title": "Does anyone relate to struggling to put your thoughts into words?",
            "link": "https://www.reddit.com/r/autism/comments/1d30nnb/does_anyone_relate_to_struggling_to_put_your/",
            "votes": 25,
            "comments_count": 5,
            "created": "2024-05-29T01:41:20.907000+0000"
        },
        "body": "Just exactly what the title says. I don't know if this is distinctly an autism thing but there are so many times when I find it hard to communicate what I'm thinking, but there is almost always an internal monologue going on in my head.\n  \n    For example, sometimes when asked a question I’ll just lie (obviously not when it comes to serious questions) or say a vague answer because I don’t know how to word my actual thoughts about it, even to my closest friends. I honestly feel like I talk out loud more when I'm alone 😭\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 223,
            "title": "Anyone else feel bad for fitting perfectly into stereotypes?",
            "link": "https://www.reddit.com/r/autism/comments/1d32mqq/anyone_else_feel_bad_for_fitting_perfectly_into/",
            "votes": 19,
            "comments_count": 10,
            "created": "2024-05-29T03:26:10.365000+0000"
        },
        "body": "I fit autism stereotypes pretty well. From my interests, the way I stim, and the way I talk.\n  \n    I love trains. I love watching them, learning about them, and especially riding them. My stimming is typically rocking back and forth, pacing, flapping my hands, and making sounds. I have been told I have a slightly unusual speech pattern. The way a say words, where I pause in sentences, and even what words I put extra emphasis on.\n  \n    I feel like all of these are super stereotypical and I kinda feel bad about it. I really want to show people that autism is more than just that one stereotype you see over and over again, but I fit it perfectly. For a while it made me feel like I was just faking it for attention, but I realized that that’s just how I am. I still feel like I’m unintentionally pushing a harmful stereotype though.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 224,
            "title": "Need A Video Game Opinion",
            "link": "https://www.reddit.com/r/autism/comments/1d3jzw7/need_a_video_game_opinion/",
            "votes": 1,
            "comments_count": 16,
            "created": "2024-05-29T19:02:15.348000+0000"
        },
        "body": "I'm a younger autistic male and I love to spend what little free time I have playing video games. I find no comfort in typical games like Overwatch or Call of Duty, they just stress me out beyond belief and the unreliability of other people cause unnecessary stress. I love optimizing things and numbers and if I can find a game where I can do that it would be great. Please let me know if there's a game I can really dive into that atmosphere! Thanks for your help in advance!\n  \n    Note: PlayStation or PC gamer.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 225,
            "title": "How do I tell my parents I want to do stuff myself?",
            "link": "https://www.reddit.com/r/autism/comments/1d36edq/how_do_i_tell_my_parents_i_want_to_do_stuff_myself/",
            "votes": 8,
            "comments_count": 5,
            "created": "2024-05-29T07:28:22.425000+0000"
        },
        "body": "My parents have been wonderful all my life and fought hard for my autism diagnosis even though everyone said they were wrong till eventually I got one when I was 16, just before the pandemic I had a mental breakdown due to stress of what to do after I leave college which ironically lead to me leaving earlier.\n  \n    This breakdown which I know now after further research was burnout lasted 3 years and left me unable to wash my hands without assistance and I couldn’t touch things without gloves. It really messed up my OCD handwashing that started a few years before and was causing my hands damage and I was having frequent meltdowns about feeling unclean.\n  \n    I’m 26 now and I have regained control of my handwashing obsession and finally having thoughts that I want to be more independent again, I’m scared of living alone so not too independent and I like living with my parents and they’re happy with that\n  \n    I don’t have control over my money due to poor impulse control and I have to ask if something is expensive as I don’t really understand the value of things unless it’s something I know about like games and books, though I’d like to have control over it.\n  \n    My question is how do I explain to them that I’m not having those thoughts anymore and need to learn how to be independent for when they’re no longer here.\n  \n    Also how do I know I won’t have burnout that bad again, will I need to have a carer for myself?\n  \n    Edit: Sorry for not putting this in originally just one thing to add is that while I don’t have control over my money my mum is allowing me to scan her card  when paying for stuff just so I know how to do it if I ever need to, it sounds like a small thing to do but it’s progress.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 226,
            "title": "Is Medicaid an option for my daughter?",
            "link": "https://www.reddit.com/r/autism/comments/1d3dw5h/is_medicaid_an_option_for_my_daughter/",
            "votes": 2,
            "comments_count": 2,
            "created": "2024-05-29T14:43:22.804000+0000"
        },
        "body": "My daughter is 5, soon to be 6, autistic and non-verbal. Shes always just been on our health insurance plan but I was curious if anyone knows whether Medicaid coverage would be an option for her.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 227,
            "title": "Does anyone else get annoyed when strangers get too close?",
            "link": "https://www.reddit.com/r/autism/comments/1d2x9hc/does_anyone_else_get_annoyed_when_strangers_get/",
            "votes": 36,
            "comments_count": 16,
            "created": "2024-05-28T23:00:15.803000+0000"
        },
        "body": "Sometimes at the shops a stranger will get too close and it really frustrates me, it happened a few times on the weekend and it felt like they were in my personal space.. I feel bad for getting annoyed but I can’t help it 😔\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 228,
            "title": "What is your sexual orientation?",
            "link": "https://www.reddit.com/r/autism/comments/1d31uef/what_is_your_sexual_orientation/",
            "votes": 18,
            "comments_count": 51,
            "created": "2024-05-29T02:43:35.985000+0000"
        },
        "body": "I’ve been told by some I might be on the autism spectrum and I am also bisexual. I read that according to some research there are more LGBT autistic people. I am posting a poll to test this theory.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 229,
            "title": "Can I ask my sister to vouch for me instead of my parents for my screening?",
            "link": "https://www.reddit.com/r/autism/comments/1d3j2sr/can_i_ask_my_sister_to_vouch_for_me_instead_of_my/",
            "votes": 1,
            "comments_count": 4,
            "created": "2024-05-29T18:22:56.333000+0000"
        },
        "body": "I (20 AFAB)was a pretty gifted kid, winning prizes and attending accelerated classes. I didn't struggle socially (in the sense that I was content with being alone, having 1 friend, and didn't understand when I was being picked on). I guess my only clear symptoms were a lot of anxiety, and temper tantrums. When I was 14 and started High School, I fell into a depressive episode that lasted 1 year, and after that something kindof changed. I didn't perform as well in school, and I started showing a lot of ADHD/autism symptoms. When I graduated high school I started a very relaxed art course, and living at home with my parents with barely any pressure, I decided to finally try for an ADHD/austidm diagnosis. My parents were required to give a testimony, and they stated nothing was wrong with me as a kid, except for some anxiety. This coupled with the fact that I wasn't struggling very much in daily life due to my parents caring for me, and the art course requiring very little of me, I didn't get the diagnosis due to lack of \"evidence in childhood\" and \"evidence of disability in daily life\". Fast forward and I am now my first year into college and moved out. And I am struggling. Bad. I can't take care of myself or my household properly, I am skipping entire courses, generally fatigued and I can barely engage in my hobbies anymore. I'm just sad. My lack of focus and my inability to have any kind of routine is killing me. I went to my doctor, and I have been placed in a priority queue to have another go at an adhd/autism screening. And they are going to require speaking to a family member. Seeing as my parents sortof failed me last time, as well as them moving to germany, I am considering asking my sister to vouch for me instead, as she is a bit more understanding with mental health stuff. Though I have been feeling major impostor syndrome, that I am not \"sick\" enough, and that by using my sister instead of my parents I'd be manipulating the system or something. Idk. I just really want help. Any kind words or advice is appreciated!\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 230,
            "title": "Websites to search for autism friendly jobs/companies? ",
            "link": "https://www.reddit.com/r/autism/comments/1d3ap8r/websites_to_search_for_autism_friendly/",
            "votes": 3,
            "comments_count": 1,
            "created": "2024-05-29T12:12:20.472000+0000"
        },
        "body": "I've managed to stay in mainstream education, but with a lot of extra help. I don't think this will change for me career-wise. I'll be looking for my first proper job soon, so does anyone know any good resources? Ideally, a website that lists jobs that are good for autistic people?  I'm based in the UK, but I'm willing to look at international charities.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 231,
            "title": "Anyone allowed to stay on lexapro and amytriptyline?",
            "link": "https://www.reddit.com/r/autism/comments/1d3ipk2/anyone_allowed_to_stay_on_lexapro_and/",
            "votes": 1,
            "comments_count": 1,
            "created": "2024-05-29T18:07:55.064000+0000"
        },
        "body": "I started taking lexapro for depression and anxiety a while back and it didn’t seem to be helping much so had gone through a few dose increases when I was put on amytriptyline for migraines. The combo of the two worked miracles for me, I felt better than I had in many years. I tried weaning off the amytriptyline and just taking lexapro, didn’t have the same effect, then I tried taking amytriptyline and weaned off the lexapro, again not the same effect. My psych made me stay off the lexapro because of the risk of side effects when mixing the two but I feel so defeated now and I’m nervous that I won’t find something that helped the same way. I’ve been increasing the amytriptyline under my psych’s guidance but I’m so depressed and anxious that I’m on the verge of crying all the time now. So I’m just wondering if anyone has been able to stay on both without any side effects or if that’s never going to be offered to me as an option again.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 232,
            "title": "What should I buy to wipe my son's mouth and hands? He hates the way it feels",
            "link": "https://www.reddit.com/r/autism/comments/1d3im3w/what_should_i_buy_to_wipe_my_sons_mouth_and_hands/",
            "votes": 2,
            "comments_count": 18,
            "created": "2024-05-29T18:03:59.394000+0000"
        },
        "body": "So, my son hates all of it - wipes, microfiber cloth, baby cloths, regular cloths. Though he tolerates the wipes the best, but man ... Those wipes are expensive to go through a pack a day.\n  \n    What do you prefer for yourselves? What feels best on your skin? I feel bad that every meal is distressful for him because he hates being wiped down afterwards.\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 233,
            "title": "Sensory sensitivity - EVERYTHING HURTS and I HATE it",
            "link": "https://www.reddit.com/r/autism/comments/1d38ufd/sensory_sensitivity_everything_hurts_and_i_hate_it/",
            "votes": 4,
            "comments_count": 3,
            "created": "2024-05-29T10:22:57.694000+0000"
        },
        "body": "there's rarely anything good ive ever experienced as a result of having sensory processing disorder/ sensory sensitivity disorder. Apart from the nice comforting feel of my cats little furry chins, or the dopamine release i get from rubbnig my face against my husbands beard. Otherwise I just HURT. everything hurts more often and at a stronger level than NT's.\n  \n    My uncomfortable work clothes, sore neck, temperature, even inside my god damn body.\n  \n    I'd genuinely jump at the chance to have someone knock out my physical touch/pain receptors. I wish there was a medication to reduce them. Who else?\n  \n\n\n\n      Read more"
    },
    {
        "meta": {
            "idx": 234,
            "title": "How do I prevent something becoming a obsession/hyperfixation/interest?",
            "link": "https://www.reddit.com/r/autism/comments/1d38u33/how_do_i_prevent_something_becoming_a/",
            "votes": 4,
            "comments_count": 2,
            "created": "2024-05-29T10:22:19.365000+0000"
        },
        "body": "Really needing help with this as it's making me very anxious.\n  \n    For context: I usually go through a cycle of having a new \"main\" special interest every few years. I usually classify it as an obsession/hyperfixation at first, but if it continues at the same intensity over 6+ months, it becomes a special interest. As I've got older, my old special interests have persisted as 'normal' interests after the period of it being my main special interest has ended (e.g. My Little Pony and Steven Universe fall into these categories - I could still tell you ALL the trivia about them, and I still love both series, but I don't feel the same excitement when I think about them because my mind is preoccupied with my current main interest)\n  \n    My main interest for the last year and a half has been the TV series 'Inside no. 9', and in extension it's predecessor 'The League of Gentlemen'. I've watched every episode of both series several times over, consumed all the trivia, bought merch, etc, and I'm still absolutely in love with both series. The fanbase has introduced me to other series I have enjoyed as well. Hell, I recently got to indulge in my interest in British Comedy for a University project, and got a grade 80 for my work (equivalent to a grade A). With the final series of Inside no. 9 airing at the moment, having a comfortably sized fanbase, endless rewatchability, and a talented editing/art scene, I'm certainly NOT ready to leave this interest yet, especially when compared to what's threatening to replace it.\n  \n    When I feel a new interest beginning to take form, I can kind of feel it in my chest. Best to describe it as 'butterflies'. In the past, I've even mistook it for a panic attack, with how intense it can get. The issue is, I've been beginning to get this recently for a series I do NOT want to become fixated on - namely South Park.\n  \n    A friend encouraged me to watch some episodes of South Park recently. From a surface perspective, it is not the kind of series I'm prone to becoming obsessed with. The gross-out and offensive comedy is not something that appeals to me in the quantity that it occurs in South Park. Additionally, I'm well aware of the controversies of the series (especially the transphobia) which is something I do NOT want to associate myself with. I'm also aware of how problematic the fanbase (which is very large and leans younger than me) can be, and that scares me. It's mainly the 'lore' that's made me interested in the series, which is mostly written by the fans.\n  \n    Regardless, I am confident that I, under no circumstances, want to develop in interest in South Park.\n  \n    But when in starting to feel the signs of a new interest forming, I'm feeling very very anxious about it.\n  \n    I've already planned to go cold-turkey - to scroll past it on my TikTok, to not watch any more episodes, to quit talking about it with my friend. However, I'm worried I will fall back into indulging in it if I'm not careful and need to be able to hold myself back. I need to re-ignite my internet in my current special interests as well as giving myself stimulation from other less-obsessive series on the side.\n  \n    I don't know if any of this makes sense. It's helped to vent, though. I'm mainly looking for support to tell me that this is in fact possible to achieve. Thanks for taking the time to read.\n  \n\n\n\n      Read more"
    }
]